declare
  ID_ INT;
  l_seq_num   tms_task.sequence_number%type;
begin
  bc.home;
--------------------------------------
id_ := TMS_UTL.create_or_replace_task
 (      p_task_code               => 'INT15', -- унікальний код процедури (довідник TMS_TASK)
        p_task_group_id           => 1 ,  -- контекст банківської дати при виконанні процедури: 1 - фініш, 2 - старт, 3 - не встановлюється контекст дати
        p_sequence_number         => 48,  -- порядковий номер виконання завдання (може дублюватися)
        p_task_name               => 'Стягнення податку з %% на залишки (СПД) 2560-2600-2650',   -- назва завдання
        p_task_description        => 'Кожного робочого дня',  -- додатковий текстовий опис завдання
        p_separate_by_branch_mode => 3,  -- режим представлення РУ: 1 - виконувати процедуру на "/", 2 - кожна РУ обробляється по черзі, 3 - всі РУ обробляються паралельно
        p_action_on_failure       => 1,  -- порядок дій у разі виникнення помилки: 1 - продовжити виконання процедур, 2 - зупинити виконання наступних процедур
        p_task_statement          =>
q'[begin     
if gl.bdate != dat_last_work(gl.bdate) then
      --logger.info('Поточний банківський день не останній робочий день місяця. Нарахування відсотків виконуємо лише в останній робочий день!');
      logger.tms_info('INT15: Поточний банківський день не останній робочий день місяця. Нарахування відсотків виконуємо лише в останній робочий день!');
      return;
    end if;
  logger.tms_info('INT15: Старт роботи!');
  int15_n(gl.bd);  
  logger.tms_info('INT15: Кінець роботи!');
end ;]' -- PL/SQL-блок, що виконується для даного завдання
   ) ;
--------------------------------------
commit;
----------------------------------------
end;
/
