PROMPT *** Refresh data ead_struct_codes ***

execute bars.bars_context.set_policy_group('WHOLE');

set constraint FK_EADDOCS_EASTRCID_STRCS deferred;

delete from ead_struct_codes;

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0010', 'Угода ЗП', 'Угода ЗП', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('00101', 'Документи договору ЗП', 'Документи договору ЗП', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001010001', 'Заява на реєстрацію ЗП', 'Заява на реєстрацію Зарплатного проекту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001010002', 'Висновок про доцільність співпраці з Організацією', 'Висновок відповідального працівника установи Банку про доцільність співпраці з Організацією', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001010003', 'Договір про надання послуг ЗП', 'Договір між Банком та Організацією про надання послуг по зарахуванню та виплаті заробітної плати та інших виплат через поточні рахунки фізичних осіб (працівників Організації/студентів) з використанням платіжних карток', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001010004', 'Дозвіл ЦА щодо погодження договору ЗП', 'Дозвіл ЦА щодо погодження договору Зарплатного проекту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001010005', 'Договір СДО з використанням транзитного рахунку', 'Договір на передачу платіжних документів для зарахування заробітної плати з використанням програмно-апаратного комплексу (з використанням транзитного рахунку)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001010006', 'Договір СДО з використанням поточного рахунку', 'Договір на передачу платіжних документів для зарахування заробітної плати з використанням програмно-апаратного комплексу (з використанням поточного рахунку)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001010007', 'Тарифи', 'Тарифи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001010008', 'Опис справи', 'Опис справи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001010009', 'Акт приймання-передачі юридичної справи', 'Акт приймання-передачі юридичної справи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001010010', 'Інші документи укладання договору ЗП', 'Інші документи щодо укладання договору Зарплатного проекту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('00102', 'Документи обслуговування ЗП', 'Документи обслуговування ЗП', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001020001', 'Перелік прийнятих/звільнених працівників Організації', 'Перелік працівників Організації, на користь яких відкриваються поточні рахунки (в т.ч. листи з переліком працівників (звільнених/прийнятих), які надає організація в період дії договору', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001020002', 'Лист з переліком працівників, яким необхідно переоформити БПК', 'Лист з переліком працівників, яким необхідно переоформити Зарплатні платіжні картки на новий строк їх дії', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001020003', 'Відомість про доставку карток на адресу Організації та вручення їх працівникам', 'Відомість про доставку карток на адресу Організації (відокремленого підрозділу Організації) та вручення їх працівникам', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001020004', 'Відомість з підписами працівників Організації, яким був здійснений перевипуск БПК', 'Відомість з підписами працівників Організації, яким був здійснений перевипуск Зарплатних платіжних карток, та уповноваженого працівника Організації, який забезпечував передачу карток', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001020005', 'Інші документи обслуговування ЗП', 'Інші документи щодо обслуговування ЗП', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('00103', 'Списки зарахування коштів', 'Списки зарахування коштів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001030001', 'Скорочена відомість зарахувань', 'Зведена відомість сум для зарахування на рахунки', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0011', 'Угода торгового еквайрингу', 'Угода торгового еквайрингу', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('00111', 'Документи договору еквайрингу', 'Документи договору еквайрингу', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001110001', 'Договір на еквайрингове обслуговування ТСП', 'Договір на еквайрингове обслуговування ТСП', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001110002', 'Додатковий договір до Договору на еквайрингове обслуговування ТСП', 'Додатковий договір до Договору на еквайрингове обслуговування ТСП', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001110003', 'Додаток до Договору - Картка торговця', 'Додаток до Договору на еквайрингове обслуговування ТСП - Картка торговця', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001110004', 'Договір оренди приміщення або права власності на приміщення', 'Договір оперативної оренди приміщення, в якому встановлюється устаткування, або правовстановлюючий документ, що підтверджує право власності контрагента на приміщення, в якому встановлюється устаткування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001110005', 'Документ, що підтверджує повноваження представника (уповноваженої особи) клієнта', 'Документ, що підтверджує повноваження представника (уповноваженої особи) клієнта на підписання Договору про надання послуг торгового еквайрингу (в т.ч. додаткових договорів та додатків до нього)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001110006', 'Висновок банківської безпеки щодо перевірки ТСП при укладанні Договору', 'Висновок банківської безпеки щодо перевірки ТСП при укладанні Договору', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001110007', 'Заява до процесінгового центру щодо реєстрації клієнта', 'Заява до процесінгового центру щодо реєстрації клієнта', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001110008', 'Акт приймання-передачі POS-терміналу', 'Акт приймання-передачі POS-терміналу', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001110009', 'Погодження ЦА щодо індивідуальних умов обслуговування ТСП', 'Погодження ЦА щодо індивідуальних умов обслуговування ТСП', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001110010', 'Заява про блокування POS-терміналу', 'Заява про блокування POS-терміналу', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001110011', 'Документ щодо закриття транзитного рахунку', 'Документ щодо закриття транзитного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001110012', 'Опис справи торгового еквайрингу', 'Опис справи торгового еквайрингу', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001110013', 'Акт приймання-передачі юридичної справи', 'Акт приймання-передачі юридичної справи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001110014', 'Інші документи торгового еквайрингу', 'Інші документи торгового еквайрингу', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0012', 'Угода на послуги з  інкасації', 'Угода на послуги з інкасації', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('00121', 'Документи на послуги з інкасації', 'Документи на послуги з інкасації', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001210001', 'Договір про надання послуг з інкасації (в т.ч. додатки до нього)', 'Договір про надання послуг з інкасації та перевезення валютних цінностей та додатки до нього', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001210002', 'Додатковий договір до Договору про надання послуг з інкасації', 'Додатковий договір до Договору про надання послуг з інкасації та перевезення валютних цінностей', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001210003', 'Зміни до додатків без укладання додаткового договору до Договору про надання послуг з інкасації', 'Зміни до додатків до Договору  про надання послуг з інкасації та перевезення валютних цінностей (якщо дата змін відмінна від дати укладання договору та не потребує укладання додаткового договору до нього)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001210004', 'Документ, що підтверджує повноваження представника (уповноваженої особи) клієнта', 'Документ, що підтверджує повноваження представника (уповноваженої особи) клієнта на підписання Договору про надання послуг з інкасації  та перевезення валютних цінностей (в т.ч. додаткових договорів та додатків до нього)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001210005', 'Документ про сплату послуг з інкасації', 'Документ про сплату послуг з інкасації (рахунок-фактура, акт надання послуг з інкасації)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001210006', 'Акт приймання-передачі юридичної справи', 'Акт приймання-передачі юридичної справи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('001210007', 'Інші документи з інкасації', 'Інші документи щодо надання послуг з інкасації', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('01', 'Загальні документи', 'Документи, що посвідчують особу (паспорт, посвідки, які посвідчують особу, довідки про присвоєння реєстраційного номеру облікової картки платника податків, тощо)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('011', 'Установчі документи', 'Установчі документи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('01101', 'Реєстраційні документи ФОП', 'Реєстраційні документи ФОП', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110101', 'Виписка з Єдиного державного реєстру ЮО та ФО-підприємців що містить відомості про фізичну особу', 'Виписка з Єдиного державного реєстру ЮО та ФО-підприємців що містить відомості про фізичну особу', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110102', 'Паспорт ФОП', 'Паспорт ФОП', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110103', 'Довідка про присвоєння ідентифікаційного номера платника податків', 'Довідка про присвоєння ідентифікаційного номера платника податків', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('01102', 'Установчі та реєстраційні документи юридичних осіб', 'Установчі та реєстраційні документи юридичних осіб', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110201', 'Статут', 'Статут', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110202', 'Засновницький договір', 'Засновницький договір', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110203', 'Установчий акт', 'Установчий акт', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110204', 'Положення', 'Положення', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110205', 'Рішення про створення юридичної особи на підставі модельного статуту', 'Рішення про створення юридичної особи на підставі модельного статуту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110206', 'Виписка з Єдиного державного реєстру ЮО та ФО-підприємців, що містить відомості про ЮО', 'Виписка з Єдиного державного реєстру ЮО та ФО-підприємців, що містить відомості про ЮО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110207', 'Договір оренди', 'Договір оренди', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110208', 'Довідка про відсутність внесених змін до реєстраційних та установчих документів', 'Довідка про відсутність внесених змін до реєстраційних та установчих документів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110209', 'Зміни до статуту', 'Зміни до статуту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110210', 'Зміни до засновницького договору', 'Зміни до засновницького договору', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110211', 'Зміни до установчого акту', 'Зміни до установчого акту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110212', 'Зміни до положення', 'Зміни до положення', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('01103', 'Установчі та реєстраційні документи відокремлених підрозділів', 'Установчі та реєстраційні документи відокремлених підрозділів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110301', 'Положення про відокремлений підрозділ', 'Положення про відокремлений підрозділ', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110302', 'Виписка з Єдиного державного реєстру ЮО та ФО-підприємців, що містить відомості про відокремлений підрозділ ЮО', 'Виписка з Єдиного державного реєстру ЮО та ФО-підприємців, що містить відомості про відокремлений підрозділ ЮО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110303', 'Довідка про відсутність внесених змін до реєстраційних та установчих документів', 'Довідка про відсутність внесених змін до реєстраційних та установчих документів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110304', 'Зміни до положення про відокремлений підрозділ', 'Зміни до положення про відокремлений підрозділ', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('01104', 'Реєстраційні документи провадження незалежної професійної діяльності', 'Реєстраційні документи провадження незалежної професійної діяльності', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110401', 'Документ, що підтверджує право фізичної особи на провадження незалежної професійної діяльності', 'Документ, що підтверджує право фізичної особи на провадження незалежної професійної діяльності', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110402', 'Документ, що підтверджує взяття фізичної особи, яка провадить незалежну професійну діяльність, на облік в органі державної податкової служби', 'Документ, що підтверджує взяття фізичної особи, яка провадить незалежну професійну діяльність, на облік в органі державної податкової служби', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110403', 'Документ, що підтверджує взяття фізичної особи, яка провадить незалежну професійну діяльність, на облік в органі Пенсійного фонду України', 'Документ, що підтверджує взяття фізичної особи, яка провадить незалежну професійну діяльність, на облік в органі Пенсійного фонду України', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110404', 'Довідка про відсутність внесених змін до реєстраційних та установчих документів', 'Довідка про відсутність внесених змін до реєстраційних та установчих документів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('01105', 'Реєстраційні документи профспілки', 'Реєстраційні документи профспілки', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110501', 'Статут (положення) профспілки', 'Статут (положення) профспілки', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110502', 'Довідка про внесення профспілки до Єдиного державного реєстру підприємств та організацій України', 'Довідка про внесення профспілки до Єдиного державного реєстру підприємств та організацій України', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110503', 'Свідоцтво про легалізацію профспілки у відповідному органі виконавчої влади', 'Свідоцтво про легалізацію профспілки у відповідному органі виконавчої влади', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110504', 'Довідка про відсутність внесених змін до реєстраційних та установчих документів', 'Довідка про відсутність внесених змін до реєстраційних та установчих документів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('01106', 'Реєстраційні документи офіційного представництва', 'Реєстраційні документи офіційного представництва', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110601', 'Посвідчення Міністерства закордонних справ України про акредитацію представництва на території України', 'Посвідчення Міністерства закордонних справ України про акредитацію представництва на території України', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110602', 'Документ, що підтверджує взяття офіційного представництва на облік в органі Пенсійного фонду України', 'Документ, що підтверджує взяття офіційного представництва на облік в органі Пенсійного фонду України', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110603', 'Довідка про відсутність внесених змін до реєстраційних та установчих документів', 'Довідка про відсутність внесених змін до реєстраційних та установчих документів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('01107', 'Реєстраційні документи постійного представництва', 'Реєстраційні документи постійного представництва', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110701', 'Легалізований або засвідчений шляхом проставлення апостиля витяг з торговельного, банківського або судового реєстру чи реєстраційного посвідчення місцевого органу влади іноземної держави про реєстрацію юридичної особи - нерезидента', 'Легалізований або засвідчений шляхом проставлення апостиля витяг з торговельного, банківського або судового реєстру чи реєстраційного посвідчення місцевого органу влади іноземної держави про реєстрацію юридичної особи - нерезидента', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110702', 'Свідоцтво про реєстрацію представництва юридичної особи-нерезидента в уповноваженому органі виконавчої влади України', 'Свідоцтво про реєстрацію представництва юридичної особи-нерезидента в уповноваженому органі виконавчої влади України', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110703', 'Документ, що підтверджує взяття представництва юридичної особи - нерезидента на облік в органі Пенсійного фонду України', 'Документ, що підтверджує взяття представництва юридичної особи - нерезидента на облік в органі Пенсійного фонду України', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110704', 'Документ, що підтверджує взяття представництва юридичної особи-нерезидента на облік відповідним органом державної податкової служби', 'Документ, що підтверджує взяття представництва юридичної особи-нерезидента на облік відповідним органом державної податкової служби', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110705', 'Довідка про відсутність внесених змін до реєстраційних та установчих документів', 'Довідка про відсутність внесених змін до реєстраційних та установчих документів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('01108', 'Реєстраційні документи організацій та установ (групи управління проектами та програмами)', 'Реєстраційні документи організацій та установ (групи управління проектами та програмами)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110801', 'Реєстраційна картка програми або проекту', 'Реєстраційна картка програми або проекту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0110802', 'Свідоцтво про акредитацію організації або установи (групи управління) - виконавця програми чи проекту, яка підтверджує статус виконавця програми або проекту', 'Свідоцтво про акредитацію організації або установи (групи управління) - виконавця програми чи проекту, яка підтверджує статус виконавця програми або проекту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('01110', 'Реєстраційні документи нерезидента-інвестора', 'Реєстраційні документи нерезидента-інвестора', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0111001', 'Легалізований або засвідчений шляхом проставлення апостиля витяг з торговельного, банківського або судового реєстру', 'Легалізований або засвідчений шляхом проставлення апостиля витяг з торговельного, банківського або судового реєстру', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0111002', 'Реєстраційне посвідчення місцевого органу влади іноземної держави про реєстрацію юридичної особи', 'Реєстраційне посвідчення місцевого органу влади іноземної держави про реєстрацію юридичної особи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0111003', 'Документ, що підтверджує взяття нерезидента-інвестора на облік в органі державної податкової служби', 'Документ, що підтверджує взяття нерезидента-інвестора на облік в органі державної податкової служби', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0111004', 'Довідка про відсутність внесених змін до реєстраційних та установчих документів', 'Довідка про відсутність внесених змін до реєстраційних та установчих документів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('01111', 'Реєстраційні документи виборчого фонду кандидата в президенти України', 'Реєстраційні документи виборчого фонду кандидата в президенти України', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0111101', 'Рішення ЦВК про реєстрацію кандидата на пост Президента України', 'Рішення ЦВК про реєстрацію кандидата на пост Президента України', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0111102', 'Паспорт або інший документ, що посвідчує особу, кандидата в президенти', 'Паспорт або інший документ, що посвідчує особу, кандидата в президенти', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0111103', 'Документ, виданий органом державної податкової служби, що засвідчує реєстрацію в Державному реєстрі фізичних осіб - платників податків кандидата в президенти', 'Документ, виданий органом державної податкової служби, що засвідчує реєстрацію в Державному реєстрі фізичних осіб - платників податків кандидата в президенти', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('01112', 'Реєстраційні документи виборчого фонду політичної партії', 'Реєстраційні документи виборчого фонду політичної партії', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0111201', 'Рішення Центральної виборчої комісії про реєстрацію кандидатів у народні депутати України, включених до виборчого списку партії', 'Рішення Центральної виборчої комісії про реєстрацію кандидатів у народні депутати України, включених до виборчого списку партії', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0111202', 'Свідоцтво про реєстрацію партії', 'Свідоцтво про реєстрацію партії', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0111203', 'Виписка з Єдиного державного реєстру юридичних осіб та фізичних осіб - підприємців, що підтверджує державну реєстрацію партії', 'Виписка з Єдиного державного реєстру юридичних осіб та фізичних осіб - підприємців, що підтверджує державну реєстрацію партії', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('01113', 'Реєстраційні документи виборчого фонду місцевої організації партії', 'Реєстраційні документи виборчого фонду місцевої організації партії', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0111301', 'Рішення територіальної виборчої комісії про реєстрацію кандидатів у депутати, уключених до виборчого списку від місцевої організації партії', 'Рішення територіальної виборчої комісії про реєстрацію кандидатів у депутати, уключених до виборчого списку від місцевої організації партії', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0111302', 'Свідоцтво про реєстрацію місцевої організації партії', 'Свідоцтво про реєстрацію місцевої організації партії', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0111303', 'Виписка з Єдиного державного реєстру юридичних осіб та фізичних осіб - підприємців, що підтверджує державну реєстрацію місцевої організації партії', 'Виписка з Єдиного державного реєстру юридичних осіб та фізичних осіб - підприємців, що підтверджує державну реєстрацію місцевої організації партії', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0111304', 'Виписка з Єдиного державного реєстру юридичних осіб та фізичних осіб - підприємців, що підтверджує державну реєстрацію політичної партії, структурним утворенням якої є місцева організація партії, що не є юридичною особою', 'Виписка з Єдиного державного реєстру юридичних осіб та фізичних осіб - підприємців, що підтверджує державну реєстрацію політичної партії, структурним утворенням якої є місцева організація партії, що не є юридичною особою', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('01114', 'Реєстраційні документи виборчого фонду кандидата в депутати за одномандатним округом', 'Реєстраційні документи виборчого фонду кандидата в депутати за одномандатним округом', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0111401', 'Рішення Центральної виборчої комісії / територіальної виборчої комісії про реєстрацію відповідного кандидата', 'Рішення Центральної виборчої комісії / територіальної виборчої комісії про реєстрацію відповідного кандидата', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0111402', 'Паспорт або інший документ, що посвідчує особу кандидата;', 'Паспорт або інший документ, що посвідчує особу кандидата;', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0111403', 'Документ, виданий органом державної податкової служби, що засвідчує реєстрацію в Державному реєстрі фізичних осіб - платників податків кандидата', 'Документ, виданий органом державної податкової служби, що засвідчує реєстрацію в Державному реєстрі фізичних осіб - платників податків кандидата', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('01115', 'Реєстраційні документи фонду референдуму', 'Реєстраційні документи фонду референдуму', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0111501', 'Рішення Центральної виборчої комісії про реєстрацію ініціативної групи', 'Рішення Центральної виборчої комісії про реєстрацію ініціативної групи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('012', 'Документи пов''язаних осіб', 'Документи пов''язаних осіб', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0120001', 'Протокол (рішення) уповноваженого органу ЮО про обрання (призначення)', 'Протокол (рішення) уповноваженого органу ЮО про обрання (призначення)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0120002', 'Наказ про призначення на посаду', 'Наказ про призначення на посаду', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0120003', 'Трудовий договір', 'Трудовий договір', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0120004', 'Доручення', 'Доручення', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0120005', 'Легалізована або засвідчена шляхом проставляння апостиля довіреність на виконання представницьких функцій тією або іншою особою в Україні', 'Легалізована або засвідчена шляхом проставляння апостиля довіреність на виконання представницьких функцій тією або іншою особою в Україні', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0120006', 'Легалізована або засвідченої шляхом проставлення апостиля довіреність на ім''я особи, яка має право відкривати та розпоряджатися рахунком', 'Легалізована або засвідченої шляхом проставлення апостиля довіреність на ім''я особи, яка має право відкривати та розпоряджатися рахунком', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0120007', 'Інші документи, які визначають повноваження', 'Інші документи, які визначають повноваження', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0120008', 'Паспорт пов''язаної особи', 'Паспорт пов''язаної особи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0120009', 'Довідка про реєстрацію в ДРФОПП', 'Довідка про реєстрацію в ДРФОПП', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('02', 'Фінансовий моніторинг', 'Документи (договори (угоди), листування) про відкриття вкладних (депозитних) рахунків фізичних осіб', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('021', 'Документи щодо фінансового моніторингу', 'Документи щодо фінансового моніторингу', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0210001', 'Опитувальник', 'Опитувальник', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0210002', 'Анкета (ступінь ризику з висновків фінансового моніторингу)', 'Анкета (ступінь ризику з висновків фінансового моніторингу)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0210003', 'Інші документи щодо фінансового моніторингу', 'Інші документи щодо фінансового моніторингу', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0210004', 'Структура власності юридичної особи', 'Структура власності юридичної особи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('022', 'Листування з клієнтом щодо фінансового моніторингу', 'Листування з клієнтом щодо фінансового моніторингу', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0220001', 'Лист від клієнта Банку з питань фінансового моніторингу', 'Лист від клієнта Банку з питань фінансового моніторингу', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0220002', 'Лист від Банку клієнтові з питань фінансового моніторингу', 'Лист від Банку клієнтові з питань фінансового моніторингу', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('03', 'Угода поточного рахунку', 'Угода поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('031', 'Картки зі зразками підписів (до угоди)', 'Картки зі зразками підписів (до угоди)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0310001', 'Картка зі зразками підписів', 'Картка зі зразками підписів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0310002', 'Тимчасова картка зі зразками підписів', 'Тимчасова картка зі зразками підписів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('032', 'Документи відкриття поточного рахунку', 'Документи відкриття поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320001', 'Заява на відкриття поточного рахунку', 'Заява на відкриття поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320002', 'Клопотання щодо відкриття рахунку відокремленого підрозділу', 'Клопотання щодо відкриття рахунку відокремленого підрозділу', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320003', 'Рішення учасників договору спільної діяльності про визначення осіб, яким надається право розпорядчого підпису', 'Рішення учасників договору спільної діяльності про визначення осіб, яким надається право розпорядчого підпису', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320004', 'Документ, що підтверджує взяття на облік в органі державної податкової служби договору про спільну діяльність без створення юридичної особи', 'Документ, що підтверджує взяття на облік в органі державної податкової служби договору про спільну діяльність без створення юридичної особи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320005', 'Рішення засновників (учасників) про визначення особи, якій надається право відкриття та розпорядження рахунком новостворюваної юридичної особи', 'Рішення засновників (учасників) про визначення особи, якій надається право відкриття та розпорядження рахунком новостворюваної юридичної особи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320006', 'Довіреність на ім''я особи, яка має право відкриття та розпорядження рахунком формування статутного фонду', 'Довіреність на ім''я особи, яка має право відкриття та розпорядження рахунком формування статутного фонду', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320007', 'Лист-клопотання організації або установи, уповноваженої від України на виконання міжнародної технічної угоди щодо відкриття рахунку', 'Лист-клопотання організації або установи, уповноваженої від України на виконання міжнародної технічної угоди щодо відкриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320008', 'Лист-клопотання відповідного органу, який уповноважений на виконання від України міжнародної угоди щодо відкриття рахунку', 'Лист-клопотання відповідного органу, який уповноважений на виконання від України міжнародної угоди щодо відкриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320009', 'Дозвіл фінансового органу Міністерства оборони Російської Федерації як розпорядника бюджетних коштів на відкриття рахунку ЧФ', 'Дозвіл фінансового органу Міністерства оборони Російської Федерації як розпорядника бюджетних коштів на відкриття рахунку ЧФ', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320010', 'Клопотання ЮО-нерезидента про відкриття постійному представництву поточного рахунку', 'Клопотання ЮО-нерезидента про відкриття постійному представництву поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320011', 'Договір (контракт) про ведення спільної діяльності', 'Договір (контракт) про ведення спільної діяльності', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320012', 'Документ про реєстрацію договору (контракту) про ведення спільної діяльності', 'Документ про реєстрацію договору (контракту) про ведення спільної діяльності', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320015', 'Довідка банку про відкриття накопичувального рахунку виборчого фонду кандидата на пост Президента України', 'Довідка банку про відкриття накопичувального рахунку виборчого фонду кандидата на пост Президента України', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320016', 'Довідка банку про відкриття накопичувального рахунку виборчого фонду партії', 'Довідка банку про відкриття накопичувального рахунку виборчого фонду партії', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320017', 'Довідка банку про відкриття накопичувального рахунку фонду референдуму ініціативної групи', 'Довідка банку про відкриття накопичувального рахунку фонду референдуму ініціативної групи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320018', 'Витяг з реєстру обтяжень', 'Витяг з реєстру обтяжень', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320019', 'Повідомлення ДПС про взяття на облік поточного рахунку', 'Повідомлення ДПС про взяття на облік поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320020', 'Повідомлення держ. виконавцю про відкриття рахунку', 'Повідомлення держ. виконавцю про відкриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320021', 'Документ, що підтверджує отримання держ. виконавцем повідомлення про відкриття рахунку', 'Документ, що підтверджує отримання держ. виконавцем повідомлення про відкриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320022', 'Довідка про відкриття рахунку', 'Довідка про відкриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320023', 'Договір банківського рахунку', 'Договір банківського рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320024', 'Додаткова угода до договору банківського рахунку', 'Додаткова угода до договору банківського рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320025', 'Акт приймання – передачі юридичної справи', 'Акт приймання – передачі юридичної справи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320026', 'Інші документи щодо відкриття поточного рахунку', 'Інші документи щодо відкриття поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320027', 'Повідомлення органу ліцензування про відкриття спец.рах', 'Повідомлення органу ліцензування про відкриття спец.рах', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0320028', 'Повідомлення про затвердження спец.рах. органом ліцензування', 'Повідомлення про затвердження спец.рах. органом ліцензування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('033', 'Поточний рахунок', 'Поточний рахунок', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('03301', 'Картки зі зразками підписів (до рахунку)', 'Картки зі зразками підписів (до рахунку)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330101', 'Картка зі зразками підписів', 'Картка зі зразками підписів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330102', 'Тимчасова картка зі зразками підписів', 'Тимчасова картка зі зразками підписів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('03302', 'Встановлення індивідуальних умов обслуговування', 'Встановлення індивідуальних умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330201', 'Обґрунтування встановлення інд. умов обслуговування рахунку', 'Обґрунтування встановлення інд. умов обслуговування рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330202', 'Клопотання клієнта про встановлення інд. умов обслуговування', 'Клопотання клієнта про встановлення інд. умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330203', 'Рішення КТПП/ ПТПП щодо інд. тарифів', 'Рішення КТПП/ ПТПП щодо інд. тарифів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330204', 'Рішення КУАП/погодження ЦА щодо інд.% ставки', 'Рішення КУАП/погодження ЦА щодо інд.% ставки', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330205', 'Погодження ЦА щодо інд. редакції договору', 'Погодження ЦА щодо інд. редакції договору', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330206', 'Інші документи щодо інд. умов обслуговування', 'Інші документи щодо інд. умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('03303', 'Листування з клієнтом щодо обслуговування поточного рахунку', 'Листування з клієнтом щодо обслуговування поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330301', 'Вхідні листи щодо обслуговування поточного рахунку', 'Вхідні листи щодо обслуговування поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330302', 'Вихідні листи щодо обслуговування поточного рахунку', 'Вихідні листи щодо обслуговування поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330303', 'Довідки щодо стану обслуговування поточного рахунку', 'Довідки щодо стану обслуговування поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('03306', 'Арешти поточного рахунку', 'Арешти поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330601', 'Постанова держ. виконавця, рішення, ухвала, постанова суду про арешт', 'Постанова держ. виконавця, рішення, ухвала, постанова суду про арешт', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330602', 'Постанова держ. виконавця, постанова слідчого, рішення суду про зняття арешту', 'Постанова держ. виконавця, постанова слідчого, рішення суду про зняття арешту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330603', 'Листування щодо арешту поточного рахунку', 'Листування щодо арешту поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330604', 'Документ на примусове списання', 'Документ на примусове списання', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330605', 'Реєстр документів на примусове списання', 'Реєстр документів на примусове списання', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('03307', 'Закриття поточного рахунку', 'Закриття поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330701', 'Заява на закриття поточного рахунку', 'Заява на закриття поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330702', 'Рішення учасників/рішення суду/рішення відповідного органу щодо припинення клієнта', 'Рішення учасників/рішення суду/рішення відповідного органу щодо припинення клієнта', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330703', 'Документи щодо аналізу відсутності руху коштів на рахунку на протязі 3-х років', 'Документи щодо аналізу відсутності руху коштів на рахунку на протязі 3-х років', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330704', 'Службові записки щодо закриття рахунку', 'Службові записки щодо закриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330705', 'Листування з клієнтом з приводу закриття рахунку', 'Листування з клієнтом з приводу закриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330706', 'Розпорядження про закриття рахунку', 'Розпорядження про закриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330707', 'Повідомлення ДПС про взяття на облік закриття рахунку', 'Повідомлення ДПС про взяття на облік закриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330708', 'Довідка про закриття рахунку', 'Довідка про закриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330709', 'Заява на отримання залишку коштів', 'Заява на отримання залишку коштів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330710', 'Інші документи, що стосуються закриття поточного рахунку', 'Інші документи, що стосуються закриття поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330711', 'Витяг з ЄДРПОУ про державну реєстрацію припинення клієнта', 'Витяг з ЄДРПОУ про державну реєстрацію припинення клієнта', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330712', 'Повідомлення Банку про невикористану чекову книжку', 'Повідомлення Банку про невикористану чекову книжку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0330713', 'Повідомлення органу ліцензування про закриття спец.рах.', 'Повідомлення органу ліцензування про закриття спец.рах.', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('04', 'Депозитна угода', 'Депозитна угода', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('041', 'Документи розміщення депозиту', 'Документи розміщення депозиту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0410001', 'Службова записка з пропозицією про встановлення індивідуальної процентної ставки', 'Службова записка з пропозицією про встановлення індивідуальної процентної ставки', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0410002', 'Рішення КУАП/погодження ЦА щодо індивідуальних умов депозиту', 'Рішення КУАП/погодження ЦА щодо індивідуальних умов депозиту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0410003', 'Депозитний договір', 'Депозитний договір', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0410004', 'Картка зі зразками підписів', 'Картка зі зразками підписів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0410005', 'Картка відкриття депозитного рахунку', 'Картка відкриття депозитного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0410007', 'Витяг з реєстру обтяжень', 'Витяг з реєстру обтяжень', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0410008', 'Повідомлення ДПС про взяття на облік депозитного рахунку', 'Повідомлення ДПС про взяття на облік депозитного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0410009', 'Повідомлення держ. виконавцю про відкриття депозитного рахунку', 'Повідомлення держ. виконавцю про відкриття депозитного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0410010', 'Документ, що підтверджує отримання держ. виконавцем повідомлення про відкриття рахунку', 'Документ, що підтверджує отримання держ. виконавцем повідомлення про відкриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0410011', 'Документ, що підтверджує повноваження представника (уповноваженої особи) Корпоративного клієнта на підписання Депозитного договору', 'Документ, що підтверджує повноваження представника (уповноваженої особи) Корпоративного клієнта на підписання Депозитного договору', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0410012', 'Акт прийому – передачі юридичної справи', 'Акт прийому – передачі юридичної справи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0410013', 'Тимчасова картка зі зразками підписів', 'Тимчасова картка зі зразками підписів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('042', 'Документи обслуговування депозиту', 'Документи обслуговування депозиту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0420001', 'Клопотання про зміну умов депозитного договору', 'Клопотання про зміну умов депозитного договору', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0420002', 'Внутрішні документи служб Банку щодо змін умов депозитної операції', 'Внутрішні документи служб Банку щодо змін умов депозитної операції', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0420003', 'Рішення КУАП/погодження ЦА щодо зміни умов депозитної операції', 'Рішення КУАП/погодження ЦА щодо зміни умов депозитної операції', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0420004', 'Додатковий договір до депозитного договору', 'Додатковий договір до депозитного договору', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0420005', 'Документ, що підтверджує повноваження представника (уповноваженої особи) Корпоративного клієнта на підписання додаткового договору до Депозитного договору', 'Документ, що підтверджує повноваження представника (уповноваженої особи) Корпоративного клієнта на підписання додаткового договору до Депозитного договору', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0420006', 'Лист від клієнта про дострокове повернення коштів', 'Лист від клієнта про дострокове повернення коштів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0420007', 'Повідомлення ДПС про взяття на облік закриття депозитного рахунку', 'Повідомлення ДПС про взяття на облік закриття депозитного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('043', 'Депозитний рахунок', 'Депозитний рахунок', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('04301', 'Арешти депозиту', 'Арешти депозиту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0430101', 'Постанова держ. виконавця, рішення, ухвала, постанова суду про арешт', 'Постанова держ. виконавця, рішення, ухвала, постанова суду про арешт', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0430102', 'Постанова держ. виконавця, постанова слідчого, рішення суду про зняття арешту', 'Постанова держ. виконавця, постанова слідчого, рішення суду про зняття арешту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0430103', 'Листування щодо арешту депозиту', 'Листування щодо арешту депозиту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('05', 'Системи дистанційного обслуговування', 'Системи дистанційного обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('051', 'Основні документи СДО', 'Основні документи СДО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0510001', 'Договір на виконання операцій СДО', 'Договір на виконання операцій СДО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0510002', 'Додатковий договір до договору СДО', 'Додатковий договір до договору СДО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0510003', 'Акт виконаних робіт/ Акт приймання-передачі', 'Акт виконаних робіт/ Акт приймання-передачі', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0510004', 'Перелік рахунків', 'Перелік рахунків', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0510005', 'Інші документи, пов''язані з обслуговуванням СДО', 'Інші документи, пов''язані з обслуговуванням СДО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0510006', 'Перелік підрозділів', 'Перелік підрозділів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0510007', 'Лист - згода', 'Лист - згода', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('052', 'Підключення до СДО', 'Підключення до СДО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0520001', 'Заява на отримання доступу до СДО', 'Заява на отримання доступу до СДО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0520002', 'Акт приймання-передачі засобу захисту', 'Акт приймання-передачі засобу захисту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('053', 'Листування з клієнтом щодо СДО', 'Листування з клієнтом щодо СДО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0530001', 'Вхідні листи щодо СДО', 'Вхідні листи щодо СДО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0530002', 'Вихідні листи щодо СДО', 'Вихідні листи щодо СДО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('054', 'Встановлення індивідуальних умов обслуговування', 'Встановлення індивідуальних умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0540001', 'Клопотання клієнта щодо інд. умов обслуговування', 'Клопотання клієнта щодо інд. умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0540002', 'Обґрунтування встановлення індивідуальних умов обслуговування', 'Обґрунтування встановлення індивідуальних умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0540003', 'Рішення КТПП / погодження ЦА щодо інд. умов обслуговування', 'Рішення КТПП / погодження ЦА щодо інд. умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0540004', 'Інші документи щодо інд. умов обслуговування', 'Інші документи щодо інд. умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0540005', 'Вихідний лист клієнту про встановлення інд. умов', 'Вихідний лист клієнту про встановлення інд. умов', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('06', 'Документи від/до державних органів', 'Документи від/до державних органів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('061', 'Документи щодо доступу до банківських речей та документів', 'Документи щодо доступу до банківських речей та документів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0610001', 'Ухвала щодо доступу до банківських речей та документів', 'Ухвала щодо доступу до банківських речей та документів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0610002', 'Службова записка щодо наявності речей та документів', 'Службова записка щодо наявності речей та документів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0610003', 'Висновок щодо необхідності виконання ухвали', 'Висновок щодо необхідності виконання ухвали', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0610004', 'Повідомлення щодо можливості доступу до речей та документів', 'Повідомлення щодо можливості доступу до речей та документів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0610005', 'Протокол виїмки', 'Протокол виїмки', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0610006', 'Опис речей та документів', 'Опис речей та документів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('062', 'Документи щодо розкриття банківської таємниці', 'Документи щодо розкриття банківської таємниці', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0620001', 'Вимога щодо розкриття банківської таємниці', 'Вимога щодо розкриття банківської таємниці', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0620002', 'Дозвіл клієнта на розкриття банківської таємниці', 'Дозвіл клієнта на розкриття банківської таємниці', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0620003', 'Висновок щодо правомірності розкриття банківської таємниці', 'Висновок щодо правомірності розкриття банківської таємниці', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0620004', 'Документ розкриття банківської таємниці', 'Документ розкриття банківської таємниці', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0620005', 'Документ відмови розкриття банківської таємниці', 'Документ відмови розкриття банківської таємниці', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('07', 'Інші документи юридичної справи', 'Інші документи юридичної справи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('071', 'Інші документи юридичної справи', 'Інші документи юридичної справи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0710001', 'Інші документи щодо обслуговування клієнта', 'Інші документи щодо обслуговування клієнта', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0710002', 'Постанова суду про визнання платника банкрутом і відкриття ліквідаційної процедури', 'Постанова суду про визнання платника банкрутом і відкриття ліквідаційної процедури', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('072', 'Документи рахунків, відкритих в минулому', 'Документи рахунків, відкритих в минулому', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0720001', 'Свідоцтво про державну реєстрацію', 'Свідоцтво про державну реєстрацію', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0720002', 'Довідка ДПС', 'Довідка ДПС', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0720003', 'Довідка Пенсійного фонду', 'Довідка Пенсійного фонду', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0720004', 'Довідка Держкомітету статистики', 'Довідка Держкомітету статистики', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0720005', 'Довідка фонду соціального страхування', 'Довідка фонду соціального страхування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0720006', 'Акт прийому – передачі юридичної справи', 'Акт прийому – передачі юридичної справи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('08', 'Угода поточного рахунку з використанням корпоративної платіжної картки', 'Угода поточного рахунку з використанням корпоративної платіжної картки', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('081', 'Картки зі зразками підписів (до угоди)', 'Картки зі зразками підписів (до угоди)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0810001', 'Картка зі зразками підписів', 'Картка зі зразками підписів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0810002', 'Тимчасова картка зі зразками підписів', 'Тимчасова картка зі зразками підписів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('082', 'Поточний рахунок з КПК', 'Поточний рахунок з КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('08201', 'Поточний рахунок з КПК', 'Поточний рахунок з КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820101', 'Заява про відкриття поточного рахунку з КПК', 'Заява про відкриття поточного рахунку з КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820102', 'Документ з переліком Держателів', 'Документ з переліком Держателів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820103', 'Договір КПК ', 'Договір КПК ', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820104', 'Додатковий договір до Договору КПК', 'Додатковий договір до Договору КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820105', 'Повідомлення ДПС про взяття на облік поточного рахунку з КПК', 'Повідомлення ДПС про взяття на облік поточного рахунку з КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820106', 'Витяг з реєстру обтяжень', 'Витяг з реєстру обтяжень', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820107', 'Повідомлення держ. виконавцю про відкриття рахунку', 'Повідомлення держ. виконавцю про відкриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820108', 'Документ, що підтверджує отримання держ. виконавцем повідомлення про відкриття рахунку', 'Документ, що підтверджує отримання держ. виконавцем повідомлення про відкриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820109', 'Довідки по рахунку', 'Довідки по рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820110', 'Документ щодо оплати послуг', 'Документ щодо оплати послуг', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('08202', 'Документи на випуск / обслуговування КПК', 'Документи на випуск / обслуговування КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820201', 'Анкета на випуск КПК', 'Анкета на випуск КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820202', 'Встановлення лімітів по КПК', 'Встановлення лімітів по КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820203', 'Документи, що ідентифікують держателів КПК', 'Документи, що ідентифікують держателів КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820204', 'Розписка про отримання карти і ПІН-конверту', 'Розписка про отримання карти і ПІН-конверту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820205', 'Інші документи пов''язані з використанням КПК', 'Інші документи пов''язані з використанням КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('08203', 'Встановлення індивідуальних умов обслуговування', 'Встановлення індивідуальних умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820301', 'Обґрунтування встановлення інд. умов обслуговування ', 'Обґрунтування встановлення інд. умов обслуговування ', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820302', 'Клопотання клієнта про встановлення інд. умов обслуговування', 'Клопотання клієнта про встановлення інд. умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820303', 'Рішення КТПП щодо інд. тарифів', 'Рішення КТПП щодо інд. тарифів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820304', 'Рішення КУАП/погодження ЦА щодо інд.% ставки', 'Рішення КУАП/погодження ЦА щодо інд.% ставки', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820305', 'Погодження ЦА щодо інд. редакції договору', 'Погодження ЦА щодо інд. редакції договору', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820306', 'Інші документи щодо інд. умов обслуговування', 'Інші документи щодо інд. умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('08204', 'Листування з клієнтом щодо обслуговування поточного рахунку з КПК', 'Листування з клієнтом щодо обслуговування поточного рахунку з КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820401', 'Вхідні листи щодо обслуговування ', 'Вхідні листи щодо обслуговування ', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820402', 'Вихідні листи щодо обслуговування ', 'Вихідні листи щодо обслуговування ', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('08205', 'Арешти поточного рахунку з КПК', 'Арешти поточного рахунку з КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820501', 'Документи про арешт', 'Документи про арешт', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820502', 'Документи про зняття арешту', 'Документи про зняття арешту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820503', 'Листування щодо арешту ', 'Листування щодо арешту ', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820504', 'Документ на примусове списання', 'Документ на примусове списання', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820505', 'Реєстр документів на примусове списання', 'Реєстр документів на примусове списання', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('08206', 'Закриття поточного рахунку з КПК', 'Закриття поточного рахунку з КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820601', 'Заява на закриття поточного рахунку з КПК', 'Заява на закриття поточного рахунку з КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820602', 'Рішення учасників/рішення суду/рішення відповідного органу щодо припинення клієнта', 'Рішення учасників/рішення суду/рішення відповідного органу щодо припинення клієнта', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820603', 'Документи щодо аналізу відсутності руху коштів на рахунку на протязі 3-х років', 'Документи щодо аналізу відсутності руху коштів на рахунку на протязі 3-х років', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820604', 'Службові записки щодо закриття рахунку', 'Службові записки щодо закриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820605', 'Листування з клієнтом з приводу закриття рахунку', 'Листування з клієнтом з приводу закриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820606', 'Розпорядження про закриття рахунку', 'Розпорядження про закриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820607', 'Довідка про закриття рахунку', 'Довідка про закриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820608', 'Інші документи, що стосуються закриття карткового рахунку', 'Інші документи, що стосуються закриття карткового рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820609', 'Витяг з ЄДРПОУ про державну реєстрацію припинення клієнта', 'Витяг з ЄДРПОУ про державну реєстрацію припинення клієнта', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0820610', 'Повідомлення ДПС про зняття з обліку рахунку', 'Повідомлення ДПС про зняття з обліку рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('083', 'Документи відкриття поточного рахунку з використанням КПК', 'Документи відкриття поточного рахунку з використанням КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0830001', 'Клопотання щодо відкриття рахунку відокремленого підрозділу', 'Клопотання щодо відкриття рахунку відокремленого підрозділу', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0830002', 'Рішення учасників договору спільної діяльності про визначення осіб, яким надається право розпорядчого підпису', 'Рішення учасників договору спільної діяльності про визначення осіб, яким надається право розпорядчого підпису', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0830003', 'Договір (контракт) про ведення спільної діяльності', 'Договір (контракт) про ведення спільної діяльності', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0830004', 'Документ, що підтверджує взяття на облік в органі державної податкової служби договору про спільну діяльність без створення юридичної особи', 'Документ, що підтверджує взяття на облік в органі державної податкової служби договору про спільну діяльність без створення юридичної особи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0830005', 'Документ про реєстрацію договору (контракту) про ведення спільної діяльності', 'Документ про реєстрацію договору (контракту) про ведення спільної діяльності', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0830006', 'Рішення засновників (учасників) про визначення особи, якій надається право відкриття та розпорядження рахунком новостворюваної юридичної особи', 'Рішення засновників (учасників) про визначення особи, якій надається право відкриття та розпорядження рахунком новостворюваної юридичної особи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0830007', 'Клопотання ЮО-нерезидента про відкриття постійному представництву рахунку', 'Клопотання ЮО-нерезидента про відкриття постійному представництву рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0830008', 'Акт приймання – передачі юридичної справи', 'Акт приймання – передачі юридичної справи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0830009', 'Інші документи щодо відкриття поточного рахунку з КПК', 'Інші документи щодо відкриття поточного рахунку з КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('09', 'Договір банківського обслуговування', 'Договір банківського обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('091', 'Документи ДБО', 'Документи ДБО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0910001', 'Договір банківського обслуговування', 'Договір банківського обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0910002', 'Додаткова угода до договору банківського обслуговування', 'Додаткова угода до договору банківського обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0910003', 'Стандартні тарифи', 'Стандартні тарифи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0910004', 'Заява про підключення ТП', 'Заява про підключення ТП', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0910005', 'Умови обслуговування за ТП', 'Умови обслуговування за ТП', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0910006', 'Документ щодо оплати послуг', 'Документ щодо оплати послуг', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('092', 'Поточний рахунок', 'Поточний рахунок', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('09200', 'Основні документи поточного рахунку', 'Основні документи поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920001', 'Заява про відкриття поточного рахунку', 'Заява про відкриття поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920002', 'Довідки по рахунку', 'Довідки по рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920003', 'Повідомлення ДПС про взяття на облік поточного рахунку', 'Повідомлення ДПС про взяття на облік поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920004', 'Документ щодо оплати послуг', 'Документ щодо оплати послуг', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920005', 'Витяг з реєстру обтяжень', 'Витяг з реєстру обтяжень', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920006', 'Повідомлення держ. або приватному виконавцю про відкриття рахунку', 'Повідомлення держ. або приватному виконавцю про відкриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920007', 'Відповідь держ. або приватного виконавця про відкриття рахунку', 'Відповідь держ. або приватного виконавця про відкриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920008', 'Документ, що підтверджує отримання держ. або приватним виконавцем повідомлення про відкриття рахунку', 'Документ, що підтверджує отримання держ. або приватним виконавцем повідомлення про відкриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('09201', 'Картки зі зразками підписів (до рахунку)', 'Картки зі зразками підписів (до рахунку)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920101', 'Картка зі зразками підписів', 'Картка зі зразками підписів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920102', 'Тимчасова картка зі зразками підписів', 'Тимчасова картка зі зразками підписів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('09202', 'Документи про підключення інших послуг', 'Документи про підключення інших послуг', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920201', 'Заява про підключення послуги', 'Заява про підключення послуги', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920202', 'Документ щодо оплати послуг', 'Документ щодо оплати послуг', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920203', 'Інші документи', 'Інші документи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('09203', 'Встановлення індивідуальних умов обслуговування', 'Встановлення індивідуальних умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920301', 'Клопотання клієнта про встановлення інд. умов обслуговування', 'Клопотання клієнта про встановлення інд. умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920302', 'Обґрунтування встановлення інд. умов обслуговування ', 'Обґрунтування встановлення інд. умов обслуговування ', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920303', 'Рішення КТПП щодо інд. тарифів', 'Рішення КТПП щодо інд. тарифів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920304', 'Рішення КУАП/погодження ЦА щодо інд.% ставки', 'Рішення КУАП/погодження ЦА щодо інд.% ставки', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920305', 'Погодження ЦА щодо інд. редакції договору', 'Погодження ЦА щодо інд. редакції договору', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920306', 'Інші документи щодо інд. умов обслуговування', 'Інші документи щодо інд. умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('09204', 'Листування з клієнтом щодо обслуговування поточного рахунку', 'Листування з клієнтом щодо обслуговування поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920401', 'Вхідні листи щодо обслуговування ', 'Вхідні листи щодо обслуговування ', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920402', 'Вихідні листи щодо обслуговування ', 'Вихідні листи щодо обслуговування ', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('09205', 'Арешти поточного рахунку', 'Арешти поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920501', 'Документи про арешт', 'Документи про арешт', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920502', 'Документи про зняття арешту', 'Документи про зняття арешту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920503', 'Листування щодо арешту ', 'Листування щодо арешту ', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920504', 'Документ на примусове списання', 'Документ на примусове списання', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920505', 'Реєстр документів на примусове списання', 'Реєстр документів на примусове списання', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('09206', 'Закриття поточного рахунку', 'Закриття поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920601', 'Заява на закриття поточного рахунку', 'Заява на закриття поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920602', 'Документи щодо закриття поточного рахунку', 'Документи щодо закриття поточного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920603', 'Витяг з ЄДРПОУ про державну реєстрацію припинення клієнта', 'Витяг з ЄДРПОУ про державну реєстрацію припинення клієнта', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0920604', 'Повідомлення ДПС про зняття з обліку рахунку', 'Повідомлення ДПС про зняття з обліку рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('095', 'Поточний рахунок з КПК', 'Поточний рахунок з КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('09500', 'Основні документи поточного рахунку з КПК', 'Основні документи поточного рахунку з КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950001', 'Заява про відкриття поточного рахунку з КПК', 'Заява про відкриття поточного рахунку з КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950002', 'Документ з переліком Держателів', 'Документ з переліком Держателів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950003', 'Повідомлення ДПС про взяття на облік поточного рахунку з КПК', 'Повідомлення ДПС про взяття на облік поточного рахунку з КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950004', 'Довідки по рахунку', 'Довідки по рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950005', 'Тарифи КПК', 'Тарифи КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950006', 'Документ щодо оплати послуг', 'Документ щодо оплати послуг', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950007', 'Витяг з реєстру обтяжень', 'Витяг з реєстру обтяжень', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950008', 'Повідомлення держ. або приватному виконавцю про відкриття рахунку', 'Повідомлення держ. або приватному виконавцю про відкриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950009', 'Відповідь держ. або приватного виконавця про відкриття рахунку', 'Відповідь держ. або приватного виконавця про відкриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950010', 'Документ, що підтверджує отримання держ. або приватним виконавцем повідомлення про відкриття рахунку', 'Документ, що підтверджує отримання держ. або приватним виконавцем повідомлення про відкриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('09501', 'Картки зі зразками підписів (до рахунку)', 'Картки зі зразками підписів (до рахунку)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950101', 'Картка зі зразками підписів', 'Картка зі зразками підписів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950102', 'Тимчасова картка зі зразками підписів', 'Тимчасова картка зі зразками підписів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('09502', 'Документи на випуск/обслуговування КПК', 'Документи на випуск/обслуговування КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950201', 'Анкета на випуск КПК', 'Анкета на випуск КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950202', 'Встановлення лімітів по КПК', 'Встановлення лімітів по КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950203', 'Документи, що ідентифікують держателів КПК', 'Документи, що ідентифікують держателів КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950204', 'Розписка про отримання карти і ПІН-конверту', 'Розписка про отримання карти і ПІН-конверту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950205', 'Інші документи пов''язані з використанням КПК', 'Інші документи пов''язані з використанням КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('09503', 'Листування з клієнтом щодо обслуговування поточного рахунку з КПК', 'Листування з клієнтом щодо обслуговування поточного рахунку з КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950301', 'Вхідні листи щодо обслуговування ', 'Вхідні листи щодо обслуговування ', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950302', 'Вихідні листи щодо обслуговування ', 'Вихідні листи щодо обслуговування ', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('09504', 'Встановлення індивідуальних умов обслуговування', 'Встановлення індивідуальних умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950401', 'Клопотання клієнта про встановлення інд. умов обслуговування', 'Клопотання клієнта про встановлення інд. умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950402', 'Обґрунтування встановлення інд. умов обслуговування ', 'Обґрунтування встановлення інд. умов обслуговування ', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950403', 'Рішення КТПП щодо інд. тарифів', 'Рішення КТПП щодо інд. тарифів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950404', 'Рішення КУАП/погодження ЦА щодо інд.% ставки', 'Рішення КУАП/погодження ЦА щодо інд.% ставки', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950405', 'Інші документи щодо інд. умов обслуговування', 'Інші документи щодо інд. умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('09505', 'Арешти поточного рахунку з КПК', 'Арешти поточного рахунку з КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950501', 'Документи про арешт', 'Документи про арешт', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950502', 'Документи про зняття арешту', 'Документи про зняття арешту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950503', 'Листування щодо арешту ', 'Листування щодо арешту ', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950504', 'Документ на примусове списання', 'Документ на примусове списання', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950505', 'Реєстр документів на примусове списання', 'Реєстр документів на примусове списання', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('09506', 'Закриття поточного рахунку з КПК', 'Закриття поточного рахунку з КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950601', 'Заява на закриття поточного рахунку з КПК', 'Заява на закриття поточного рахунку з КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950602', 'Документи щодо закриття поточного рахунку з КПК', 'Документи щодо закриття поточного рахунку з КПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950603', 'Витяг з ЄДРПОУ про державну реєстрацію припинення клієнта', 'Витяг з ЄДРПОУ про державну реєстрацію припинення клієнта', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0950604', 'Повідомлення ДПС про зняття з обліку рахунку', 'Повідомлення ДПС про зняття з обліку рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('096', 'Підключення СДО', 'Підключення СДО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('09600', 'Основні документи підключення СДО', 'Основні документи підключення СДО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0960001', 'Заява на отримання доступу до СДО', 'Заява на отримання доступу до СДО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0960002', 'Перелік Клієнтів підрозділів', 'Перелік Клієнтів підрозділів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0960003', 'Лист - згода', 'Лист - згода', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0960004', 'Акти виконаних робіт/приймання-передачі', 'Акти виконаних робіт/приймання-передачі', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0960005', 'Інші документи, пов''язані з обслуговуванням СДО', 'Інші документи, пов''язані з обслуговуванням СДО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0960006', 'Документ щодо оплати послуг', 'Документ щодо оплати послуг', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('09601', 'Листування з клієнтом щодо СДО', 'Листування з клієнтом щодо СДО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0960101', 'Вхідні листи щодо СДО', 'Вхідні листи щодо СДО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0960102', 'Вихідні листи щодо СДО', 'Вихідні листи щодо СДО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('09602', 'Встановлення індивідуальних умов обслуговування', 'Встановлення індивідуальних умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0960201', 'Клопотання клієнта щодо інд. умов обслуговування', 'Клопотання клієнта щодо інд. умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0960202', 'Обґрунтування встановлення індивідуальних умов обслуговування', 'Обґрунтування встановлення індивідуальних умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0960203', 'Рішення КТПП / погодження ЦА щодо інд. умов обслуговування', 'Рішення КТПП / погодження ЦА щодо інд. умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0960204', 'Інші документи щодо інд. умов обслуговування', 'Інші документи щодо інд. умов обслуговування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('097', 'Документи відкриття рахунків в рамках ДБО', 'Документи відкриття рахунків в рамках ДБО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0970001', 'Клопотання щодо відкриття рахунку відокремленого підрозділу', 'Клопотання щодо відкриття рахунку відокремленого підрозділу', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0970002', 'Договір (контракт) про ведення спільної діяльності', 'Договір (контракт) про ведення спільної діяльності', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0970003', 'Рішення учасників договору спільної діяльності про визначення осіб, яким надається право розпорядчого підпису', 'Рішення учасників договору спільної діяльності про визначення осіб, яким надається право розпорядчого підпису', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0970004', 'Документ, що підтверджує взяття на облік в органі державної податкової служби договору про спільну діяльність без створення юридичної особи', 'Документ, що підтверджує взяття на облік в органі державної податкової служби договору про спільну діяльність без створення юридичної особи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0970005', 'Документ про реєстрацію договору (контракту) про ведення спільної діяльності', 'Документ про реєстрацію договору (контракту) про ведення спільної діяльності', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0970006', 'Рішення засновників (учасників) про визначення особи, якій надається право відкриття та розпорядження рахунком новостворюваної юридичної особи', 'Рішення засновників (учасників) про визначення особи, якій надається право відкриття та розпорядження рахунком новостворюваної юридичної особи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0970007', 'Довіреність на ім''я особи, яка має право відкриття та розпорядження рахунком формування статутного фонду', 'Довіреність на ім''я особи, яка має право відкриття та розпорядження рахунком формування статутного фонду', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0970008', 'Витяг з реєстру обтяжень', 'Витяг з реєстру обтяжень', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0970009', 'Повідомлення держ. виконавцю про відкриття рахунку', 'Повідомлення держ. виконавцю про відкриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0970010', 'Документ, що підтверджує отримання держ. виконавцем повідомлення про відкриття рахунку', 'Документ, що підтверджує отримання держ. виконавцем повідомлення про відкриття рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0970011', 'Акт приймання – передачі юридичної справи', 'Акт приймання – передачі юридичної справи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0970012', 'Інші документи щодо надання послуг в рамках ДБО', 'Інші документи щодо надання послуг в рамках ДБО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('098', 'Інші послуги в рамках ДБО', 'Інші послуги в рамках ДБО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0980001', 'Заява про підключення послуги', 'Заява про підключення послуги', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0980002', 'Документ щодо оплати послуг', 'Документ щодо оплати послуг', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('0980003', 'Інші документи про підключення послуги', 'Інші документи про підключення послуги', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1', 'Ідентифікаційні документи ФО', 'Документи, що посвідчують особу (паспорт, посвідки, які посвідчують особу, довідки про присвоєння реєстраційного номеру облікової картки платника податків, тощо)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('11', 'Документи, що посвідчують особу', 'Документи, що посвідчують особу', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('111', 'Паспорт громадянина України у вигляді книжечки', 'Паспорт громадянина України у вигляді книжечки', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1110', 'Посвідчення особи без громадянства для виїзду за кордон, що видане в Україні', 'Посвідчення особи без громадянства для виїзду за кордон, що видане в Україні', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1111', 'Свідоцтво про народження громадянина України', 'Свідоцтво про народження громадянина України', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1112', 'Сторінка документу з фото та підписом', 'Сторінка документу з фото та підписом', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1113', 'Паспорт громадянина України для виїзду за кордон', 'Паспорт громадянина України для виїзду за кордон з відміткою про взяття на облік у дипломатичному представництві або консульській установі України', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1114', 'Паспорт гр. України, з місцезнаходженням/постійним проживанням на території ВЕЗ «Крим»', 'Паспорт громадянина України, з місцезнаходженням/постійним проживанням на території ВЕЗ «Крим», без надання довідки про взяття на облік та переміщення', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1115', 'Паспорт громадянина України у вигляді картки', 'Паспорт громадянина України у вигляді картки', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('112', 'Тимчасове посвідчення громадянина України', 'Тимчасове посвідчення громадянина України (видається особам, що набули громадянства України та взяли зобов’язання припинити іноземне громадянство)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('113', 'Тимчасове посвідчення, що підтверджує особу гр. України', 'Тимчасове посвідчення, що підтверджує особу громадянина України (видається на тимчасовий термін в разі втрати або викрадення паспорта)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('114', 'Паспорт гр.України для виїзду за кордон без відмітки, що підтв. постійне проживання за кордоном', 'Паспорт гр.України для виїзду за кордон без відмітки, що підтв. постійне проживання за кордоном', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('115', 'Паспорт гр. України для виїзду за кордон з відм. в пасп. про пост. прожив. за кордоном', 'Паспорт гр. України для виїзду за кордон з відм. в пасп. про пост. прожив. за кордоном', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('116', 'Паспортний документ іноземця з дозволом на постійне місце проживання в Україні', 'Паспортний документ іноземця з дозволом на постійне місце проживання в Україні', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('117', 'Посвідка на постійне проживання в Україні', 'Посвідка на постійне проживання в Україні', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('118', 'Посвідчення біженця, що видане в Україні', 'Посвідчення біженця, що видане в Україні', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('119', 'Національний паспорт громадянина іншої країни', 'Національний паспорт громадянина іншої країни', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('12', 'Інформація про номер облікової картки платника податків', 'Інформація про номер облікової картки платника податків', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('121', 'Довідка про присвоєння реєстраційного номеру облікової картки платника податків', 'Довідка про присвоєння реєстраційного номеру облікової картки платника податків', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('122', 'Сторінка паспорта з відміткою про відмову від присвоєння ІПН', 'Сторінка паспорта з відміткою про відмову від присвоєння ІПН', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('123', 'Сторінка паспорта з даними про ІПН', 'Сторінка паспорта з даними про реєстраційний номер облікової картки платника податків', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('13', 'Завірені копії документів', 'Завірені копії документів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('131', 'Копія паспорта громадянина України у вигляді книжечки', 'Копія паспорта громадянина України у вигляді книжечки', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1310', 'Копія посвідчення особи без громадянства для виїзду за кордон, що видане в Україні', 'Копія посвідчення особи без громадянства для виїзду за кордон, що видане в Україні', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1311', 'Копія свідоцтва про народження громадянина України', 'Копія свідоцтва про народження громадянина України', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1312', 'Копія дозволу на постійне місце проживання в Україні', 'Копія дозволу на постійне місце проживання в Україні', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1313', 'Копія дозволу на тимчасове місце проживання в Україні', 'Копія дозволу на тимчасове місце проживання в Україні', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1314', 'Копія документа, що підтверджує місце тимчасового перебування або реєстрації в Україні', 'Копія документа, що підтверджує місце тимчасового перебування або реєстрації в Україні', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1315', 'Копія довідки про присвоєння реєстр. номеру облікової картки', 'Копія довідки про присвоєння реєстраційного номеру облікової картки платника податків', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1316', 'Копія сторінки паспорта з відміткою про відмову від присвоєння ІПН', 'Копія сторінки паспорта з відміткою про відмову від присвоєння ІПН', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1317', 'Копія документу, що підтверджує неможливість прочитати / підписати договір', 'Копія документу, що підтверджує неможливість прочитати / підписати договір', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1318', 'Копія документу, що підтверджує статус законного представника', 'Копія документу, що підтверджує статус законного представника', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1319', 'Копія довідки про взяття на облік платника податків (4-ОПП)', 'Копія довідки про взяття на облік платника податків (4-ОПП)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('132', 'Копія тимчасового посвідчення громадянина України', 'Копія тимчасового посвідчення громадянина України (видається особам, що набули громадянства України та взяли зобов’язання припинити іноземне громадянство)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1320', 'Копія пенсійного посвідчення', 'Копія пенсійного посвідчення', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1321', 'Копія сторінки паспорта з даними про реєстр. номер облікової картки', 'Копія сторінки паспорта з даними про реєстраційний номер облікової картки платника податків', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1322', 'Копія паспорта громадянина України для виїзду за кордон з відміткою про взяття на облік', 'Копія паспорта громадянина України для виїзду за кордон з відміткою про взяття на облік у дипломатичному представництві або консульській установі України', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1323', 'Копія паспорта гр. України, з місцезнаходженням/постійним проживанням на території ВЕЗ «Крим»', 'Копія паспорта громадянина України, з місцезнаходженням/постійним проживанням на території ВЕЗ «Крим», без надання довідки про взяття на облік та переміщення', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('1324', 'Копія паспорта громадянина України у вигляді картки', 'Копія паспорта громадянина України у вигляді картки', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('133', 'Копія тимчасового посвідчення, що підтверджує особу гр. України', 'Копія тимчасового посвідчення, що підтверджує особу громадянина України (видається на тимчасовий термін в разі втрати або викрадення паспорта)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('134', 'Копія паспорта гр.України для виїзду за кордон без відмітки, що підтв. постійне проживання за кордоном', 'Копія паспорта гр.України для виїзду за кордон без відмітки, що підтв. постійне проживання за кордоном', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('135', 'Копія паспорта гр. України для виїзду за кордон з відм. в пасп. про пост. прожив. за кордоном', 'Копія паспорта гр. України для виїзду за кордон з відм. в пасп. про пост. прожив. за кордоном', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('136', 'Копія паспортного документа іноземця з дозв. на пост. місце проживання в Україні', 'Копія паспортного документа іноземця з дозволом на постійне місце проживання в Україні', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('137', 'Копія посвідки на постійне проживання в Україні', 'Копія посвідки на постійне проживання в Україні', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('138', 'Копія посвідчення біженця, що видане в Україні', 'Копія посвідчення біженця, що видане в Україні', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('139', 'Копія національного паспорта громадянина іншої країни', 'Копія національного паспорта громадянина іншої країни', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('14', 'Інші документи', 'Інші документи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('141', 'Заява на зміну реквізитів', 'Заява на зміну реквізитів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('142', 'Документ, що підтверджує неможливість прочитати / підписати договір', 'Документ, що підтверджує неможливість прочитати / підписати договір', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('143', 'Пенсійне посвідчення', 'Пенсійне посвідчення', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('144', 'Свідоцтво про смерть', 'Свідоцтво про смерть', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('145', 'Документ, що підтверджує статус законного представника', 'Документ, що підтверджує статус законного представника', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('146', 'Заява клієнта на доступ через бек-офіс', 'Заява клієнта на доступ через бек-офіс', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('147', 'Документ, що підтверджує місце тимчас. перебування або реєст. в Україні', 'Документ, що підтверджує місце тимчасового перебування або реєстрації в Україні', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('148', 'Довідка про взяття на облік платника податків (4-ОПП)', 'Довідка про взяття на облік платника податків (4-ОПП)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('149', 'Посвідка на тимчасове проживання', 'Посвідка на тимчасове проживання', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('2', 'Депозити', 'Документи (договори (угоди), листування) про відкриття вкладних (депозитних) рахунків фізичних осіб', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('21', 'Документи ДФО', 'Документи ДФО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('211', 'Заява на дострокове закриття вкладного рахунку', 'Заява на дострокове закриття вкладного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('2110', 'Заява про відмову від автопролонгації договору', 'Заява про відмову від автопролонгації договору', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('2111', 'Заява про зміну строку розміщення депозиту', 'Заява про зміну строку розміщення депозиту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('2112', 'Додаток до заяви про зміну строку розміщення депозиту', 'Додаток до заяви про зміну строку розміщення депозиту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('2113', 'Повідомлення про рішення КУАП', 'Повідомлення про рішення КУАП', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('212', 'Договір на відкриття вкладного (депозитного) рахунку', 'Договір на відкриття вкладного (депозитного) рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('213', 'Додаткові договори', 'Додаткові договори', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('214', 'Документи щодо виплати вкладів і процентів', 'Документи щодо виплати вкладів і процентів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('215', 'Дозвіл на відкриття рахунку для нерезидента', 'Дозвіл на відкриття рахунку для нерезидента', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('216', 'Підтверджувальні документи про походження коштів для нерезидента', 'Підтверджувальні документи про походження коштів для нерезидента', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('217', 'Договір про інвестиції в Україну (нерезидента-інвестора)', 'Договір про інвестиції в Україну (нерезидента-інвестора)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('218', 'Довідка зі зразком підпису неповнолітньої особи (14-16 років)', 'Довідка зі зразком підпису неповнолітньої особи (14-16 років), видана навчальним закладом', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('219', 'Заява про зміну рахунків для перерахування вкладу та процентів', 'Заява про зміну рахунків для перерахування вкладу та процентів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('22', 'Документи на розпорядження рахунком 3-ою особою', 'Документи на розпорядження рахунком 3-ою особою', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('220', 'Заява про відмову від автопролонгації договору', 'Заява про відмову від автопролонгації договору', 'Y');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('221', 'Картка зі зразками підписів', 'Картка зі зразками підписів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('222', 'Довіреність', 'Довіреність', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('223', 'Заповіт', 'Заповіт', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('224', 'Заява на доступ до вкладного рахунку', 'Заява на доступ до вкладного рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('225', 'Заява на анулювання довіреності, оформленої в установі банку', 'Заява на анулювання довіреності, оформленої в установі банку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('226', 'Заява на анулювання заповідального розпорядження, оформленого в установі банку', 'Заява на анулювання заповідального розпорядження, оформленого в установі банку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('227', 'Згода на набуття фіз. особою прав вкладника по рахунку, відкритому на її користь', 'Згода на набуття фізичною особою прав вкладника по рахунку, відкритому на її користь', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('3', 'Запити державних органів', 'Запити державних органів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('31', 'Арешти рахунків', 'Арешти рахунків', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('311', 'Постанова державного виконавця, рішення, ухвала, постанова суду про арешт', 'Постанова державного виконавця, рішення, ухвала, постанова суду про арешт', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('312', 'Постанова держ. виконавця, постанова слідчого, рішення суду про зняття арешту', 'Постанова державного виконавця, постанова слідчого, рішення суду про зняття арешту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('313', 'Розпорядження про блокування рахунку', 'Розпорядження про блокування рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('314', 'Документ на примусове списання', 'Документ на примусове списання', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('315', 'Реєстр документів на примусове списання', 'Реєстр документів на примусове списання', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('32', 'Виїмки', 'Виїмки', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('321', 'Рішення суду щодо ліквідації або визнанні клієнта банкротом; про порушення провадження у справі про банкр. клієнта; про проведення виїмки', 'Рішення (постанова) суду щодо ліквідації або визнанні клієнта банкротом; ухвала суду про порушення провадження у справі про банкрутство клієнта; рішення (ухвала) суду про проведення виїмки', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('322', 'Запит державного органу', 'Запит державного органу', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('323', 'Відповідь державному органу', 'Відповідь державному органу', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('324', 'Протокол виїмки', 'Протокол виїмки', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('325', 'Письмові вимоги (запити) державних органів', 'Письмові вимоги (запити) державних органів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('33', 'Документи, що стосуються банківської таємниці', 'Документи, що стосуються банківської таємниці', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('331', 'Письмовий запит або дозвіл клієнта на розкриття БТ рішення суду', 'Письмовий запит або дозвіл клієнта на розкриття банківської таємниці рішення суду', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('332', 'Рішення (ухвала) суду про розкриття інформації, яка є банківською таємницею', 'Рішення (ухвала) суду про розкриття інформації, яка є банківською таємницею', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('333', 'Довідка за рахунком', 'Довідка за рахунком', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('4', 'Фінансовий моніторинг', 'Фінансовий моніторинг', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('40', 'Фінансовий моніторинг', 'Фінансовий моніторинг', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('401', 'Опитувальний лист клієнта-фізичної особи', 'Опитувальний лист клієнта-фізичної особи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('402', 'Листування з клієнтом щодо фінансового моніторингу', 'Листування з клієнтом щодо фінансового моніторингу', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5', 'ДКБО', 'Справи з юридичного оформлення рахунків клієнтів-фізичних осіб', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('51', 'Документи БПК в ДКБО', 'Документи БПК в ДКБО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('511', 'Заява про приєднання до ДКБО та відкриття поточного рахунку з використанням БПК', 'Заява про приєднання до Договору комплексного банківського обслуговування фізичних осіб та відкриття поточного рахунку з використанням електронного платіжного засобу (платіжної картки)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5110', 'Довідка про доходи / білінгова виписка', 'Довідка про доходи / білінгова виписка', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5111', 'Висновок за попередньою оцінкою фін. стану Позичальника-ФО', 'Висновок за попередньою оцінкою фінансового стану Позичальника фізичної особи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5112', 'Інші документи ДКБО', 'Інші документи ДКБО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('512', 'Заява на встановлення відновлюваної кредитної лінії (Кредиту) відповідно до умов ДКБО', 'Заява на встановлення відновлюваної кредитної лінії (Кредиту) відповідно до  умов Договору комплексного обслуговування фізичних осіб (ДКБО)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('513', 'Заява про випуск додаткової картки в рамках ДКБО', 'Заява про випуск додаткової картки в рамках Договору комплексного обслуговування фізичних осіб (ДКБО)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('514', 'Заява на зміну графіку погашення кредиту відповідно до умов ДКБО', 'Заява на зміну графіку погашення Кредиту відповідно до умов Договору комплексного банківського обслуговування фізичних осіб, укладеного між  Банком та Клієнтом', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('515', 'Заява про розірвання ДКБО та/або закриття рахунку (ів)', 'Заява про розірвання Договору комплексного банківського обслуговування фізичних осіб та/або закриття рахунку (ів)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('516', 'Заява власника рахунку про спірну транзакцію', 'Заява власника рахунку про спірну транзакцію', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('517', 'Заява держателя картки про спірну транзакцію', 'Заява держателя картки про спірну транзакцію', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('518', 'Заява щодо перевипуску БПК на новий строк', 'Заява щодо перевипуску платіжної картки но новий строк', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('519', 'Витяг рішення КК про встановлення овердрафту за рахунком ', 'Витяг рішення Кредитного комітету про встановлення овердрафту за рахунком ', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('52', 'Кредитна фабрика', 'Кредитна фабрика', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('521', 'Сторінки паспорту', 'Сторінки паспорту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5210', 'Пенсійне посвідчення', 'Пенсійне посвідчення', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5211', 'Військовий квиток', 'Військовий квиток', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5212', 'Наказ про звільнення з військової служби (для військових пенсіонерів)', 'Наказ про звільнення з військової служби (для військових пенсіонерів)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5213', 'Висновок фін стану', 'Висновок фін стану', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5214', 'Інше', 'Інше', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5215', 'Підсумковий протокол', 'Підсумковий протокол', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5216', 'Заява ДКБО/Заява на збільшення кредитного ліміту', 'Заява ДКБО/Заява на збільшення кредитного ліміту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5217', 'Кредитна заявка', 'Кредитна заявка', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('522', 'Реєстраційний номер облікової картки платника податків', 'Реєстраційний номер облікової картки платника податків', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('523', 'Довідка про доходи', 'Довідка про доходи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('524', 'Довідка про розмір пенсії', 'Довідка про розмір пенсії', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('525', 'Білінгова виписка', 'Білінгова виписка', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('526', 'Довідка про наявність кредитної заборгованості', 'Довідка про наявність кредитної заборгованості', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('527', 'Квитанції про оплату ним комунальних платежів', 'Квитанції про оплату ним комунальних платежів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('528', 'Виписка про здійснення комунальних платежів', 'Виписка про здійснення комунальних платежів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('529', 'Виписка з АБС про здійснення/отримання переказів', 'Виписка з АБС про здійснення/отримання переказів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('53', 'Документи БПК, що приєднані до ДКБО', 'Документи БПК, що приєднані до ДКБО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('531', 'Заява клієнта', 'Заява клієнта', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5310', 'Заява про пошкодження БПК', 'Заява про пошкодження БПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5311', 'Заява про коригування залишку', 'Заява про коригування залишку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5312', 'Заява про відмову від трансакцій', 'Заява про відмову від трансакцій', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5313', 'Повідомлення про умови кредитування', 'Повідомлення про умови кредитування', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5314', 'Заява про зняття ліміту по БПК', 'Заява про зняття ліміту по БПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5315', 'Заява про встановлення ліміту по БПК', 'Заява про встановлення ліміту по БПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5316', 'Заява про видачу коштів', 'Заява про видачу коштів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5317', 'Реквізити', 'Реквізити', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5318', 'Заява про розблокування коштів', 'Заява про розблокування коштів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5319', 'Додаткова угода W4 зміна % ставки (співробітники)', 'Додаткова угода W4 зміна % ставки (співробітники)', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('532', 'Заява на встановлення кредиту', 'Заява на встановлення кредиту', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5320', 'Опис документів до справи ФО\ЮО', 'Опис документів до справи ФО\ЮО', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5321', 'Таблиця сукупної вартості', 'Таблиця сукупної вартості', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5322', 'Таблиця сукупної вартості в WAY4 + 2.5% зняття готівки', 'Таблиця сукупної вартості в WAY4 + 2.5% зняття готівки', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5323', 'Заява про зарахування сум соціальної пенсії', 'Заява про зарахування сум соціальної пенсії', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5324', 'Заява про зарахування сум військової пенсії', 'Заява про зарахування сум військової пенсії', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5325', 'Заява працівника банку', 'Заява працівника банку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5326', 'Згода на передачу роботодавцю інформації по рахунку', 'Згода на передачу роботодавцю інформації по рахунку', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5327', 'Заява зарахування зарплати на рахунок', 'Заява зарахування зарплати на рахунок', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5328', 'Довідка про взяття на облік внутрішньопереміщених осіб', 'Довідка про взяття на облік внутрішньопереміщених осіб', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('5329', 'Інші документи БПК', 'Інші документи БПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('533', 'Анкета клієнта - фізичної особи', 'Анкета клієнта - фізичної особи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('534', 'Опитувальник клієнта - фізичної особи', 'Опитувальник клієнта - фізичної особи', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('535', 'Заява на повернення затриманої банкоматом картки', 'Заява на повернення затриманої банкоматом картки', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('536', 'Заява про повернення коштів', 'Заява про повернення коштів', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('537', 'Заява про заміну картки', 'Заява про заміну картки', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('538', 'Заява про зміну інформації', 'Заява про зміну інформації', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('539', 'Заява про втрату БПК', 'Заява про втрату БПК', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('54', 'Документи сформовані у WEB-банкінгу', 'Документи сформовані у WEB-банкінгу', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('541', 'Заява про відкриття депозиту через Ощад 24/7', 'Заява про відкриття депозиту через Ощад 24/7', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('542', 'Заява про відмову від автопролонгації за депозитом через Ощад 24/7', 'Заява про відмову від автопролонгації за депозитом через Ощад 24/7', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('543', 'Заява про зміну рахунку виплати відсотків та тіла депозиту через Ощад 24/7', 'Заява про зміну рахунку виплати відсотків та тіла депозиту через Ощад 24/7', 'N');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('6', 'Депозити онлайн', 'Депозити онлайн', 'Y');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('61', 'Документи сформовані у WEB-банкінгу', 'Документи сформовані у WEB-банкінгу', 'Y');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('611', 'Заява про відкриття депозиту через Ощад 24/7', 'Заява про відкриття депозиту через Ощад 24/7', 'Y');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('612', 'Заява про відмову від автопролонгації за депозитом через Ощад 24/7', 'Заява про відмову від автопролонгації за депозитом через Ощад 24/7', 'Y');

insert into ead_struct_codes (ID, NAME, FULLTITLE, OBSOLETE)
values ('613', 'Заява про зміну рахунку виплати відсотків та тіла депозиту через Ощад 24/7', 'Заява про зміну рахунку виплати відсотків та тіла депозиту через Ощад 24/7', 'Y');

commit work;