DELETE FROM kl_k140;

Insert into BARS.KL_K140
   (K140, TXT, D_OPEN, K140SR)
 Values
   ('1', 'Суб''єкт великого підприємництва', TO_DATE('07/01/2017 00:00:00', 'MM/DD/YYYY HH24:MI:SS'), '60');
Insert into BARS.KL_K140
   (K140, TXT, D_OPEN, K140SR)
 Values
   ('2', 'Суб''єкт середнього підприємництва', TO_DATE('07/01/2017 00:00:00', 'MM/DD/YYYY HH24:MI:SS'), '70');
Insert into BARS.KL_K140
   (K140, TXT, D_OPEN, K140SR)
 Values
   ('3', 'Суб''єкт малого підприємництва, що не є суб''єктом мікропідприємництва', TO_DATE('07/01/2017 00:00:00', 'MM/DD/YYYY HH24:MI:SS'), '41');
Insert into BARS.KL_K140
   (K140, TXT, D_OPEN, K140SR)
 Values
   ('4', 'Суб''єкт мікропідприємництва, річний дохід якого від будь-якої діяльності перевищує суму, еквівалентну 500 тис.євро та не перевищує суму, еквівалентну 2 млн.євро', TO_DATE('07/01/2017 00:00:00', 'MM/DD/YYYY HH24:MI:SS'), '42');
Insert into BARS.KL_K140
   (K140, TXT, D_OPEN, K140SR)
 Values
   ('5', 'Суб''єкт мікропідприємництва, річний дохід якого від будь-якої діяльності перевищує суму, еквівалентну 50 тис.євро та не перевищує суму, еквівалентну 500 тис.євро', TO_DATE('07/01/2017 00:00:00', 'MM/DD/YYYY HH24:MI:SS'), '42');
Insert into BARS.KL_K140
   (K140, TXT, D_OPEN, K140SR)
 Values
   ('6', 'Суб''єкт мікропідприємництва, річний дохід якого вўд будь-якої діяльності не перевищує суму, еквівалентну 50 тис.євро', TO_DATE('07/01/2017 00:00:00', 'MM/DD/YYYY HH24:MI:SS'), '42');
Insert into BARS.KL_K140
   (K140, TXT, D_OPEN)
 Values
   ('9', 'Інші', TO_DATE('07/01/2017 00:00:00', 'MM/DD/YYYY HH24:MI:SS'));
COMMIT;