truncate table TRANSFER_2017;


Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('1416', '00', '1416', '01', 'Неамортизована дисконт за борговими цінними паперами, що рефінансуються Національним банком України,', 
    1);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('1417', '00', '1416', '02', 'Неамортизована премія за борговими цінними паперами, що рефінансуються Національним банком України, ', 
    2);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('1426', '00', '1426', '01', 'Неамортизована дисконт за борговими цінними паперами,  що рефінансуються Національним банком України', 
    3);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('1427', '00', '1426', '02', 'Неамортизована премія за борговими цінними паперами,  що рефінансуються Національним банком України,', 
    4);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('1509', '01', '1508', '05', 'прострочені нараховані доходи за коштами на вимогу в інших банках', 
    5);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('1512', '00', '1513', '01', 'вклади (депозити), що розміщені в інших банках', 
    6);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('1517', '01', '1513', '02', 'Прострочена заборгованість за  вкладами (депозитами), що розміщені в інших банках', 
    7);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('1523', '01', '1524', '03', 'короткострокові кредити, що надані іншим банкам', 
    8);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('1527', '02', '1524', '04', 'Прострочена заборгованість за короткостроковими кредитами, що надані іншим банкам', 
    9);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('1527', '04', '1524', '04', 'Прострочена заборгованість за короткостроковими кредитами, що надані іншим банкам', 
    10);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('1527', '05', '1524', '05', 'Прострочена заборгованість за довгостроковими кредитами, що надані іншим банкам', 
    11);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('1529', '01', '1528', '09', 'прострочені нараховані доходи за короткостроковими кредитами', 
    12);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('1612', '01', '1613', '03', 'Короткострокові вклади (депозити) інших банків', 
    13);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('1612', '02', '1613', '04', 'Короткострокові вклади (депозити) міжнародних та інвестиційних банків', 
    14);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('1624', '01', '1623', '03', 'Довгострокові кредити , що отримані від інших банків', 
    15);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('1624', '02', '1623', '04', 'Довгострокові  кредити , що отримані  від міжнародних та інвестиційних банків', 
    16);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('1627', '01', '1623', '05', 'Прострочена заборгованість за кредитами, що отримані від інших банків', 
    17);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('1627', '02', '1623', '05', 'Прострочена заборгованість за кредитами, що отримані від інших банків', 
    18);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('1627', '03', '1623', '05', 'Прострочена заборгованість за кредитами, що отримані від інших банків', 
    19);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('1627', '04', '1623', '05', 'Прострочена заборгованість за кредитами, що отримані від інших банків', 
    20);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2027', '01', '2020', '03', 'Прострочена заборгованість  за короткостроковими врахованими векселями', 
    21);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2027', '02', '2020', '04', 'Прострочена заборгованість за довгостроковими врахованими векселями', 
    22);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2029', '03', '2028', '05', 'Прострочені нараховані доходи за короткостроковими врахованими векселями', 
    23);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2029', '04', '2028', '06', 'Прострочені нараховані доходи за довгостроковими врахованими векселями', 
    24);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2030', '00', '2030', '01', 'заборгованість за операціями факторингу', 
    25);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2037', '01', '2030', '02', 'прострочена заборгованість за операціями факторингу', 
    26);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2039', '01', '2038', '03', 'прострочені нараховані доходи за вимогами, що придбані за операціями факторингу', 
    27);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2062', '24', '2063', '30', 'Короткострокові кредити, що надані клієнтам ММСБ в рамках акційної програми', 
    41);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2062', '25', '2063', '31', 'Короткострокові кредити, що надані клієнтам ММСБ в рамках  програми "соціальне підприємництво"', 
    42);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2062', '22', '2063', '28', 'Короткострокові кредити, що надані клієнтам ММСБ на придбання транспортних засобів та обладнання (па', 
    39);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2062', '21', '2063', '27', 'Короткострокові кредити, що надані клієнтам ММСБ на придбання транспортних засобів та обладнання', 
    38);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2062', '20', '2063', '26', 'Короткострокові кредити, що надані об"єднанням співвласників багатоквартирних будинків (стандартні)', 
    37);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2062', '19', '2063', '25', 'Короткострокові кредити, що надані об"єднанням співвласників багатоквартирних будинків (з використан', 
    36);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2062', '18', '2063', '24', 'Короткострокові кредити в іншу інвестиційну діяльність', 
    35);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2062', '17', '2063', '23', 'Короткострокові кредити під інвестиційні проекти на придбання нових механічних транспортних засобів', 
    34);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2062', '16', '2063', '22', 'Короткострокові кредити під інвестиційні проекти на купівлю будівель, споруд, обладнання та землі', 
    33);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2062', '15', '2063', '21', 'Короткострокові кредити під інвестиційні проекти на будівництво та освоєння землі', 
    32);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2062', '14', '2063', '20', 'Короткострокові кредитикредити під заставу грошових коштів, розміщених на депозит', 
    31);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2062', '03', '2063', '19', 'Короткострокові кредити за іншими операціями', 
    30);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2062', '26', '2063', '32', 'Короткострокові кредити, що надані клієнтам ММБ в рамках програми НУФ з підтримки підприємств ММСБ', 
    43);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2062', '01', '2063', '17', 'Короткострокові кредити за внутрішніми торговельними операціями', 
    28);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2062', '02', '2063', '18', 'Короткострокові кредити за експортно-імпортними операціями', 
    29);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2062', '23', '2063', '29', 'Короткострокові кредити, що надані клієнтам ММСБ за операціями з авалювання векселів', 
    40);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '02', '2066', '38', 'премія за довгостроковими кредитами за експортно-імпортними операціями', 
    80);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '04', '2066', '39', 'премія за довгостроковими кредитами за іншими операціями', 
    81);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '05', '2066', '40', 'премія за довгостроковими кредитами під заставу грошових коштів, розміщених на   депозит', 
    82);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '06', '2066', '41', 'премія за короткостроковими кредитами за внутрішніми торговельними операціями', 
    83);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '07', '2066', '42', 'премія за короткостроковими кредитами за експортно-імпортними операціями', 
    84);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '10', '2066', '43', 'премія за короткостроковими кредитами під заставу грошових коштів, розміщених на депозит', 
    85);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '11', '2066', '44', 'премія за довгостроковими кредитами під інвестиційні проекти на будівництво та освоєння землі', 
    86);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '12', '2066', '45', 'премія за довгостроковими кредитами під інвестиційні проекти на купівлю будівель, споруд, обладнання', 
    87);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '13', '2066', '46', 'премія за довгостроковими кредитами під інвестиційні проекти на придбання нових механічних транспорт', 
    88);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '14', '2066', '47', 'премія за довгостроковими кредитами в іншу інвестиційну діяльність', 
    89);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '15', '2066', '48', 'премія за короткостроковими кредитами під інвестиційні проекти на будівництво та освоєння землі', 
    90);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '16', '2066', '49', 'премія за короткостроковими кредитами під інвестиційні проекти на купівлю будівель, споруд, обладнан', 
    91);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '17', '2066', '50', 'премія за короткостроковими кредитами під інвестиційні проекти на придбання нових механічних транспо', 
    92);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '18', '2066', '51', 'премія за короткостроковими кредитами в іншу інвестиційну діяльність', 
    93);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '01', '2066', '37', 'премія за довгостроковими кредитами за внутрішніми торговельними операціями', 
    79);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '34', '2066', '67', 'премія за довгостроковими кредитами, що надані клієнтам ММБ в рамках програми НУФ з підтримки підпри', 
    109);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '33', '2066', '66', 'премія за короткостроковими кредитами, що надані клієнтам ММБ в рамках програми НУФ з підтримки підп', 
    108);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '32', '2066', '65', 'премія за довгостроковими кредитами, що надані клієнтам ММСБ в рамках  програми "соціальне підприємн', 
    107);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '31', '2066', '64', 'премія за короткостроковими кредитами, що надані клієнтам ММСБ в рамках  програми "соціальне підприє', 
    106);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '30', '2066', '63', 'премія за довгостроковими кредитами, що надані клієнтам ММСБ в рамках акційної програми', 
    105);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '29', '2066', '62', 'премія за короткостроковими кредитами, що надані клієнтам ММСБ в рамках акційної програми', 
    104);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '28', '2066', '61', 'премія за довгостроковими кредитами, що надані клієнтам ММСБ за операціями з авалювання векселів', 
    103);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '19', '2066', '52', 'премія за короткостроковими кредитами, що надані об"єднанням співвласників багатоквартирних будинків', 
    94);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '26', '2066', '59', 'премія за довгостроковими кредитами, що надані клієнтам ММСБ на придбання транспортних засобів та об', 
    101);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '25', '2066', '58', 'премія за короткостроковими кредитами, що надані клієнтам ММСБ на придбання транспортних засобів та ', 
    100);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '24', '2066', '57', 'премія за довгостроковими кредитами, що надані клієнтам ММСБ на придбання транспортних засобів та об', 
    99);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '23', '2066', '56', 'премія за короткостроковими кредитами, що надані клієнтам ММСБ на придбання транспортних засобів та ', 
    98);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '22', '2066', '55', 'премія за довгостроковими кредитами, що надані об"єднанням співвласників багатоквартирних будинків (', 
    97);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '21', '2066', '54', 'премія за короткостроковими кредитами, що надані об"єднанням співвласників багатоквартирних будинків', 
    96);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '20', '2066', '53', 'премія за довгостроковими кредитами, що надані об"єднанням співвласників багатоквартирних будинків (', 
    95);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2065', '27', '2066', '60', 'премія за короткостроковими кредитами, що надані клієнтам ММСБ за операціями з авалювання векселів', 
    102);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '30', '2063', '50', 'Прострочена заборгованість за несанкціонований овердрафт за банківським продуктом `Корпоративні плат', 
    61);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '31', '2063', '51', 'Прострочена заборгованість за несанкціонований овердрафт за банківським продуктом " Корпоративні пла', 
    62);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '32', '2063', '52', 'Прострочена заборгованість за короткострокові кредити, що надані об"єднанням співвласників багатоква', 
    63);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '33', '2063', '53', 'Прострочена заборгованість за довгострокові кредити, що надані об"єднанням співвласників багатокварт', 
    64);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '34', '2063', '54', 'Прострочена заборгованість за короткострокові кредити, що надані об"єднанням співвласників багатоква', 
    65);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '35', '2063', '55', 'Прострочена заборгованість за довгострокові кредити, що надані об"єднанням співвласників багатокварт', 
    66);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '36', '2063', '56', 'Прострочена заборгованість за короткостроковими кредитами, що надані клієнтам ММСБ на придбання тран', 
    67);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '37', '2063', '57', 'Прострочена заборгованість за  довгостроковими кредитами, що надані клієнтам ММСБ на придбання транс', 
    68);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '38', '2063', '58', 'Прострочена заборгованість за  короткостроковими кредитами, що надані клієнтам ММСБ на придбання тра', 
    69);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '39', '2063', '59', 'Прострочена заборгованість за  довгостроковими кредитами, що надані клієнтам ММСБ на придбання транс', 
    70);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '40', '2063', '60', 'Прострочена заборгованість за короткостроковими кредитами, що надані клієнтам ММСБ за операціями з а', 
    71);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '41', '2063', '61', 'Прострочена заборгованість за  довгостроковими кредитами, що надані клієнтам ММСБ за операціями з ав', 
    72);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '42', '2063', '62', 'Прострочена заборгованість за короткостроковими кредитами, що надані клієнтам ММСБ в рамках акційної', 
    73);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '43', '2063', '63', 'Прострочена заборгованість за довгостроковими кредитами, що надані клієнтам ММСБ в рамках акційної п', 
    74);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '44', '2063', '64', 'Прострочена заборгованість за короткострокові кредити, що надані клієнтам ММСБ в рамках  програми "с', 
    75);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '45', '2063', '65', 'Прострочена заборгованість за довгострокові кредити, що надані клієнтам ММСБ в рамках  програми "соц', 
    76);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '46', '2063', '66', 'Прострочена заборгованість за короткострокові кредити, що надані клієнтам ММБ в рамках програми НУФ ', 
    77);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '02', '2063', '34', 'Прострочена заборгованість за довгострокові кредити в поточну діяльність', 
    45);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '01', '2063', '33', 'Прострочена заборгованість за короткострокові кредити в поточну діяльність', 
    44);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '47', '2063', '67', 'Прострочена заборгованість за довгострокові кредити, що надані клієнтам ММБ в рамках програми НУФ з ', 
    78);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '04', '2063', '35', 'Прострочена заборгованість за короткострокові кредити за внутрішніми торговельними операціями', 
    46);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '05', '2063', '36', 'Прострочена заборгованість за довгострокові кредити за внутрішніми торговельними операціями', 
    47);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '06', '2063', '37', 'Прострочена заборгованість за короткострокові кредити за експортно-імпортними операціями', 
    48);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '07', '2063', '38', 'Прострочена заборгованість за довгострокові кредити за експортно-імпортними операціями', 
    49);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '09', '2063', '39', 'Прострочена заборгованість за короткострокові кредити під заставу грошових коштів, розміщених на деп', 
    50);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '10', '2063', '40', 'Прострочена заборгованість за довгострокові кредити під заставу грошових коштів, розміщених на депоз', 
    51);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '21', '2063', '41', 'Прострочена заборгованість за короткострокові кредити під інвестиційні проекти на будівництво та осв', 
    52);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '22', '2063', '42', 'Прострочена заборгованість за короткострокові кредити під інвестиційні проекти на купівлю будівель, ', 
    53);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '23', '2063', '43', 'Прострочена заборгованість за довгострокові кредити під інвестиційні проекти на будівництво та освоє', 
    54);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '24', '2063', '44', 'Прострочена заборгованість за довгострокові кредити під інвестиційні проекти на купівлю будівель, сп', 
    55);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '25', '2063', '45', 'Прострочена заборгованість за короткостроковими кредитами під інвестиційні проекти на придбання нови', 
    56);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '26', '2063', '46', 'Прострочена заборгованість за довгострокові кредити під інвестиційні проекти на придбання нових меха', 
    57);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '27', '2063', '47', 'Прострочена заборгованість за довгострокові кредити в іншу інвестиційну діяльність', 
    58);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '28', '2063', '48', 'Прострочена заборгованість за короткострокові кредити в іншу інвестиційну діяльність', 
    59);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2067', '29', '2063', '49', 'Прострочена заборгованість за несанкціонований овердрафт за банківським продуктом "Корпоративні плат', 
    60);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '04', '2068', '46', 'прострочені нараховані доходи за короткостроковими кредитами в поточну діяльність', 
    110);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '05', '2068', '47', 'прострочені нараховані доходи за довгостроковими кредитами в поточну діяльність', 
    111);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '10', '2068', '48', 'прострочені нараховані доходи за короткостроковими кредитами за внутрішніми торговельними операціями', 
    112);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '11', '2068', '49', 'прострочені нараховані доходи за довгостроковими кредитами за внутрішніми торговельними операціями', 
    113);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '14', '2068', '50', 'прострочені нараховані доходи за короткостроковими кредитами за експортно-імпортними операціями', 
    114);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '15', '2068', '51', 'прострочені нараховані доходи за довгостроковими кредитами за експортно-імпортними операціями', 
    115);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '20', '2068', '52', 'прострочені нараховані доходи за короткостроковими кредитами під заставу грошових коштів, розміщених', 
    116);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '22', '2068', '53', 'прострочені нараховані доходи за довгостроковими кредитами під заставу грошових коштів, розміщених н', 
    117);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '30', '2068', '54', 'прострочені нараховані доходи за кредитами в поточну діяльність, що надані суб`єктам господарювання ', 
    118);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '39', '2068', '55', 'прострочені нараховані доходи за короткостроковими кредитами під інвестиційні проекти на будівництво', 
    119);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '40', '2068', '56', 'прострочені нараховані доходи за короткостроковими кредитами під інвестиційні проекти на купівлю буд', 
    120);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '41', '2068', '57', 'прострочені нараховані доходи за довгостроковими  кредитами під інвестиційні проекти  на будівництво', 
    121);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '42', '2068', '58', 'прострочені нараховані доходи за довгостроковими кредитами під інвестиційні проекти на купівлю будів', 
    122);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '43', '2068', '59', 'прострочені нараховані доходи за короткостроковими кредитами під інвестиційні проекти на придбання н', 
    123);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '44', '2068', '60', 'прострочені нараховані доходи за довгостроковими кредитами під інвестиційні проекти на придбання нов', 
    124);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '45', '2068', '61', 'прострочені нараховані доходи за довгостроковими кредитами в іншу інвестиційну діяльність', 
    125);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '47', '2068', '62', 'прострочені нараховані доходи за короткостроковими кредитами в іншу інвестиційну діяльність', 
    126);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '49', '2068', '63', 'прострочені нараховані доходи за несанкціонованим овердрафтом за банківським продуктом " Корпоративн', 
    127);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '51', '2068', '64', 'прострочені нараховані доходи за короткостроковими  кредитами, що надані об"єднанням співвласників б', 
    128);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '52', '2068', '65', 'прострочені нараховані доходи за довгостроковими  кредитами, що надані об"єднанням співвласників баг', 
    129);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '53', '2068', '66', 'прострочені нараховані доходи за короткостроковими кредитами, що надані об"єднанням співвласників ба', 
    130);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '54', '2068', '67', 'прострочені нараховані доходи за довгостроковими  кредитами, що надані об"єднанням співвласників баг', 
    261);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '55', '2068', '68', 'прострочені нараховані доходи за короткостроковими кредитами, що надані клієнтам ММСБ на придбання т', 
    262);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '56', '2068', '69', 'прострочені нараховані доходи за довгостроковими кредитами, що надані клієнтам ММСБ на придбання тра', 
    263);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '57', '2068', '70', 'прострочені нараховані доходи за короткостроковими кредитами, що надані клієнтам ММСБ на придбання т', 
    264);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '58', '2068', '71', 'прострочені нараховані доходи за довгостроковими кредитами, що надані клієнтам ММСБ на придбання тра', 
    265);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '59', '2068', '72', 'прострочені нараховані доходи за короткостроковими кредитами, що надані клієнтам ММСБ за операціями ', 
    266);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '60', '2068', '73', 'прострочені нараховані доходи за довгостроковими кредитами, що надані клієнтам ММСБ за операціями з ', 
    267);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '61', '2068', '74', 'прострочені нараховані доходи за короткостроковими кредитами, що надані клієнтам ММСБ в рамках акцій', 
    268);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '62', '2068', '75', 'прострочені нараховані доходи за довгостроковими кредитами, що надані клієнтам ММСБ в рамках акційно', 
    269);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '63', '2068', '76', 'прострочені нараховані доходи за короткостроковими кредитами, що надані клієнтам ММСБ в рамках  прог', 
    270);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '64', '2068', '77', 'прострочені нараховані доходи за довгостроковими кредитами, що надані клієнтам ММСБ в рамках  програ', 
    271);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '65', '2068', '78', 'прострочені нараховані доходи за короткостроковими кредитами, що надані клієнтам ММБ в рамках програ', 
    272);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2069', '66', '2068', '79', 'прострочені нараховані доходи за довгостроковими кредитами, що надані клієнтам ММБ в рамках програми', 
    273);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2075', '14', '2076', '16', ' Неамортизована премія за земельними ділянками, наданими у фінансовий лізинг (оренду)', 
    279);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2075', '12', '2076', '14', 'Неамортизована премія за  іншими основними засобами, наданими у фінансовий лізинг  (оренду) (рахунок', 
    277);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2075', '13', '2076', '15', 'Неамортизована премія за  будівлямиі і спорудами, наданими у фінансовий лізинг (оренду);', 
    278);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2076', '00', '2076', '17', ' Неамортизований дисконт за фінансовим лізингом, що наданий суб`єктам господарювання', 
    280);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2077', '05', '2071', '06', 'Прострочена заборгованість за фінансовий лізинг (оренда)', 
    274);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2077', '19', '2071', '08', 'Прострочена заборгованість за земельні ділянки, надані у фінансовий лізинг (оренду);', 
    276);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2077', '18', '2071', '07', 'Прострочена заборгованість за будівлі і споруди, надані у фінансовий лізинг (оренду);', 
    275);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2079', '28', '2078', '23', 'Прострочені нараховані доходи за будівлями і спорудами, наданими у фінансовий лізинг (оренду);', 
    282);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2079', '29', '2078', '24', 'Прострочені нараховані доходи за земельні ділянки, надані у фінансовий лізинг (оренду);', 
    283);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2079', '27', '2078', '22', 'Прострочені нараховані доходи за фінансовим лізингом (орендою)', 
    281);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2082', '03', '2083', '10', 'Короткострокові кредити на будівництво об`єктів іншого призначення', 
    286);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2082', '04', '2083', '11', 'Короткострокові кредити на купівлю об`єктів виробничого призначення', 
    287);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2082', '05', '2083', '12', 'Короткострокові кредити на купівлю об`єктів житлового призначення', 
    288);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2082', '06', '2083', '13', 'Короткострокові кредити на купівлю об`єктів  іншого призначення', 
    289);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2082', '02', '2083', '09', 'Короткострокові кредити на будівництво об`єктів житлового призначення', 
    285);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2082', '07', '2083', '14', 'Короткострокові кредити на купівлю землі', 
    290);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2082', '01', '2083', '08', 'Короткострокові кредити на будівництво об`єктів виробничого призначення', 
    284);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2085', '03', '2086', '17', 'премія за довгостроковими кредитами на будівництво об`єктів іншого призначення', 
    307);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2085', '04', '2086', '18', 'премія за довгостроковими кредитами на купівлю об`єктів виробничого призначення', 
    308);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2085', '05', '2086', '19', 'премія за довгостроковими кредитами на купівлю об`єктів житлового призначення', 
    309);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2085', '09', '2086', '23', 'премія за короткостроковими кредитами на будівництво об`єктів житлового призначення', 
    313);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2085', '14', '2086', '28', 'премія за короткостроковими кредитами на купівлю землі', 
    318);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2085', '01', '2086', '15', 'премія за довгостроковими кредитами на будівництво об`єктів виробничого   призначення', 
    305);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2085', '06', '2086', '20', 'премія за довгостроковими кредитами на купівлю об`єктів іншого призначення', 
    310);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2085', '08', '2086', '22', 'премія за короткостроковими кредитами на будівництво об`єктів виробничого призначення', 
    312);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2085', '10', '2086', '24', 'премія за короткостроковими кредитами на будівництво об`єктів іншого призначення', 
    314);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2085', '11', '2086', '25', 'премія за короткостроковими кредитами на купівлю об`єктів виробничого призначення', 
    315);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2085', '12', '2086', '26', 'премія за короткостроковими кредитами на купівлю об`єктів житлового призначення', 
    316);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2085', '13', '2086', '27', 'премія за короткостроковими кредитами на купівлю об`єктів  іншого призначення', 
    317);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2085', '02', '2086', '16', 'премія за довгостроковими кредитами на будівництво об`єктів житлового призначення', 
    306);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2085', '07', '2086', '21', 'премія за довгостроковими кредитами на купівлю землі', 
    311);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2087', '14', '2083', '28', 'Прострочена заборгованість за довгостроковими кредитами на купівлю землі', 
    304);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2087', '13', '2083', '27', 'Прострочена заборгованість за довгостроковими кредитами на купівлю об`єктів іншого призначення', 
    303);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2087', '08', '2083', '22', 'Прострочена заборгованість за довгостроковими кредитами на будівництво об`єктів виробничого призначе', 
    298);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2087', '01', '2083', '15', 'Прострочена заборгованість за короткостроковими кредитами на будівництво об`єктів виробничого призна', 
    291);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2087', '02', '2083', '16', 'Прострочена заборгованість за короткостроковими кредитами на будівництво об`єктів житлового призначе', 
    292);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2087', '03', '2083', '17', 'Прострочена заборгованість за короткостроковими кредитами на будівництво об`єктів іншого призначення', 
    293);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2087', '04', '2083', '18', 'Прострочена заборгованість за короткостроковими кредитами на купівлю об`єктів виробничого призначенн', 
    294);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2087', '05', '2083', '19', 'Прострочена заборгованість за короткостроковими кредитами на купівлю об`єктів житлового призначення', 
    295);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2087', '06', '2083', '20', 'Прострочена заборгованість за короткостроковими кредитами на купівлю об`єктів іншого призначення', 
    296);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2087', '07', '2083', '21', 'Прострочена заборгованість за короткостроковими кредитами на купівлю землі', 
    297);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2087', '09', '2083', '23', 'Прострочена заборгованість за довгостроковими кредитами на будівництво об`єктів житлового призначенн', 
    299);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2087', '10', '2083', '24', 'Прострочена заборгованість за довгостроковими кредитами на будівництво об`єктів іншого призначення', 
    300);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2087', '11', '2083', '25', 'Прострочена заборгованість за довгостроковими кредитами на купівлю об`єктів виробничого призначення', 
    301);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2087', '12', '2083', '26', 'Прострочена заборгованість за довгостроковими кредитами на купівлю об`єктів житлового призначення', 
    302);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2089', '20', '2088', '41', 'Прострочені нараховані доходи за довгостроковими кредитами на купівлю об`єктів іншого призначення', 
    136);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2089', '15', '2088', '36', 'Прострочені нараховані доходи за довгостроковими кредитами на будівництво об`єктів виробничого призн', 
    131);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2089', '07', '2088', '35', 'Прострочені нараховані доходи за короткостроковими кредитами на купівлю землі', 
    325);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2089', '06', '2088', '34', 'Прострочені нараховані доходи за короткостроковими кредитами на купівлю об`єктів іншого призначення', 
    324);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2089', '05', '2088', '33', 'Прострочені нараховані доходи за короткостроковими кредитами на купівлю об`єктів житлового призначен', 
    323);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2089', '04', '2088', '32', 'Прострочені нараховані доходи за короткостроковими кредитами на купівлю об`єктів виробничого признач', 
    322);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2089', '02', '2088', '30', 'Прострочені нараховані доходи за короткостроковими кредитами на будівництво об`єктів житлового призн', 
    320);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2089', '21', '2088', '42', 'Прострочені нараховані доходи за довгостроковими кредитами на купівлю землі', 
    137);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2089', '01', '2088', '29', 'Прострочені нараховані доходи за короткостроковими кредитами на будівництво об`єктів виробничого при', 
    319);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2089', '16', '2088', '37', 'Прострочені нараховані доходи за довгостроковими кредитами на будівництво об`єктів житлового признач', 
    132);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2089', '17', '2088', '38', 'Прострочені нараховані доходи за довгостроковими кредитами на будівництво об`єктів іншого призначенн', 
    133);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2089', '18', '2088', '39', 'Прострочені нараховані доходи за довгостроковими кредитами на купівлю об`єктів виробничого призначен', 
    134);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2089', '19', '2088', '40', 'Прострочені нараховані доходи за довгостроковими кредитами на купівлю об`єктів житлового призначення', 
    135);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2089', '03', '2088', '31', 'Прострочені нараховані доходи за короткостроковими кредитами на будівництво об`єктів іншого призначе', 
    321);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2102', '03', '2103', '07', 'Короткострокові кредити під державні гарантії  в рамках програми КМУ', 
    140);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2102', '02', '2103', '06', 'Короткострокові кредити під заставу грошових коштів, розміщених на депозит', 
    139);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2102', '01', '2103', '05', 'Короткострокові кредити на придбання нових  механічних транспортних засобів', 
    138);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2105', '05', '2106', '14', 'премія за довгостроковими кредитами за іншими операціями', 
    152);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2105', '04', '2106', '13', 'премія за короткостроковими кредитами під заставу грошових коштів, розміщених на депозит', 
    151);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2105', '03', '2106', '12', 'премія за короткостроковими кредитами на придбання нових  механічних транспортних засобів;', 
    150);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2105', '06', '2106', '15', 'премія за короткостроковими кредитами під державні гарантії в рамках програми КМУ', 
    153);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2105', '01', '2106', '10', 'премія за довгостроковими кредитами на придбання нових  механічних транспортних засобів', 
    148);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2105', '02', '2106', '11', 'премія за довгостроковими кредитами під заставу грошових коштів, розміщених на депозит', 
    149);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2105', '07', '2106', '16', 'премія за довгостроковими кредитами під державні гарантії в рамках програми КМУ', 
    154);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2107', '02', '2103', '09', 'Прострочена заборгованість за довгостроковими кредитами на придбання нових  механічних транспортних ', 
    142);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2107', '03', '2103', '10', 'Прострочена заборгованість за короткостроковими кредитами під заставу грошових коштів, розміщених на', 
    143);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2107', '01', '2103', '08', 'Прострочена заборгованість  за короткостроковими кредитами на придбання нових  механічних транспортн', 
    141);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2107', '12', '2103', '14', 'Прострочена заборгованість за довгостроковими кредитами під державні гарантії  в рамках програми КМУ', 
    147);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2107', '11', '2103', '13', 'Прострочена заборгованість за короткостроковими кредитами під державні гарантії  в рамках програми К', 
    146);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2107', '09', '2103', '12', 'Прострочена заборгованість за довгостроковими кредитами за іншими операціями', 
    145);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2107', '04', '2103', '11', 'Прострочена заборгованість за довгостроковими кредитами під заставу грошових коштів, розміщених на д', 
    144);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2109', '13', '2108', '17', 'Прострочені нараховані доходи за довгостроковими кредитами за іншими операціями', 
    159);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2109', '03', '2108', '13', 'Прострочені нараховані доходи за короткостроковими кредитами на придбання нових механічних транспорт', 
    155);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2109', '16', '2108', '19', 'Прострочені нараховані доходи за довгостроковими кредитами під державні гарантії  в рамках програми ', 
    161);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2109', '04', '2108', '14', 'Прострочені нараховані доходи за довгостроковими кредитами на придбання нових механічних транспортни', 
    156);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2109', '07', '2108', '15', 'Прострочені нараховані доходи за короткостроковими кредитами під заставу грошових коштів, розміщених', 
    157);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2109', '09', '2108', '16', ' Прострочені нараховані доходи за довгостроковими кредитами під заставу грошових коштів, розміщених ', 
    158);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2109', '15', '2108', '18', 'Прострочені нараховані доходи за короткостроковими кредитами під державні гарантії  в рамках програм', 
    160);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2112', '01', '2113', '04', 'Короткострокові кредити на придбання нових  механічних транспортних засобів', 
    162);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2112', '02', '2113', '05', 'Короткострокові інші кредити в поточну діяльність', 
    163);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2112', '03', '2113', '06', 'Короткострокові кредити під заставу грошових коштів, розміщених на депозит', 
    164);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2115', '02', '2116', '10', 'премія за довгостроковими кредитами під заставу грошових коштів, розміщених на депозит', 
    172);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2115', '06', '2116', '14', 'премія за довгостроковими іншими кредитами в поточну діяльність', 
    176);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2115', '05', '2116', '13', 'премія за короткостроковими кредитами під заставу грошових коштів, розміщених на депозит', 
    175);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2115', '04', '2116', '12', 'премія за короткостроковими іншими кредитами в поточну діяльність', 
    174);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2115', '03', '2116', '11', 'премія за короткостроковими кредитами на придбання нових  механічних транспортних засобів', 
    173);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2115', '01', '2116', '09', 'премія за довгостроковими кредитами на придбання нових  механічних транспортних   засобів', 
    171);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2117', '02', '2113', '08', 'Прострочена заборгованість за довгостроковими кредитами на придбання нових  механічних транспортних ', 
    166);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2117', '03', '2113', '09', 'Прострочена заборгованість за іншими короткостроковими кредитами в поточну діяльність', 
    167);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2117', '04', '2113', '10', 'Прострочена заборгованість за короткостроковими кредитами під заставу грошових коштів, розміщених на', 
    168);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2117', '05', '2113', '11', 'Прострочена заборгованість за довгостроковими кредитами під заставу грошових коштів, розміщених на д', 
    169);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2117', '11', '2113', '12', 'Прострочена заборгованість за довгостроковими іншими кредитами в поточну діяльність', 
    170);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2117', '01', '2113', '07', 'Прострочена заборгованість за короткостроковими кредитами на придбання нових механічних транспортних', 
    165);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2119', '09', '2118', '16', 'прострочені нараховані доходи за короткостроковими кредитами під заставу грошових коштів, розміщених', 
    180);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2119', '11', '2118', '17', 'прострочені нараховані доходи за довгостроковими кредитами під заставу грошових коштів, розміщених н', 
    181);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2119', '03', '2118', '13', 'прострочені нараховані доходи за короткостроковими кредитами на придбання нових  механічних транспор', 
    177);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2119', '15', '2118', '18', 'прострочені нараховані доходи за довгостроковими іншими кредитами в поточну діяльність', 
    182);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2119', '04', '2118', '14', 'прострочені нараховані доходи за довгостроковими кредитами на придбання нових  механічних транспортн', 
    178);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2119', '07', '2118', '15', 'прострочені нараховані доходи за іншими короткостроковими кредитами в поточну діяльність', 
    179);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2122', '02', '2123', '09', 'Короткострокові кредити на будівництво об`єктів житлового призначення', 
    184);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2122', '04', '2123', '11', 'Короткострокові кредити на купівлю об`єктів виробничого призначення', 
    186);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2122', '05', '2123', '12', 'Короткострокові кредити на купівлю об`єктів житлового призначення', 
    187);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2122', '06', '2123', '13', 'Короткострокові кредити на купівлю об`єктів іншого призначення', 
    188);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2122', '07', '2123', '14', 'Короткострокові кредити на купівлю землі', 
    189);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2122', '01', '2123', '08', 'Короткострокові кредити на будівництво об`єктів виробничого призначення', 
    183);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2122', '03', '2123', '10', 'Короткострокові кредити на будівництво об`єктів іншого призначення', 
    185);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2125', '06', '2126', '20', 'премія за довгостроковими кредитами на купівлю об`єктів іншого призначення', 
    209);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2125', '07', '2126', '21', 'премія довгостроковими кредитами на купівлю землі', 
    210);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2125', '04', '2126', '18', 'премія за довгостроковими кредитами на купівлю об`єктів виробничого призначення', 
    207);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2125', '05', '2126', '19', 'премія за довгостроковими кредитами на купівлю об`єктів житлового призначення', 
    208);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2125', '10', '2126', '24', 'премія за короткостроковими кредитами на будівництво об`єктів іншого призначення', 
    213);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2125', '11', '2126', '25', 'премія за короткостроковими кредитами на купівлю об`єктів  виробничого призначення', 
    214);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2125', '12', '2126', '26', 'премія за короткостроковими кредитами на купівлю об`єктів  житлового призначення', 
    215);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2125', '13', '2126', '27', 'премія за короткостроковими кредитами на купівлю об`єктів іншого призначення', 
    216);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2125', '03', '2126', '17', 'премія за довгостроковими кредитами на будівництво об`єктів іншого призначення', 
    206);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2125', '02', '2126', '16', 'премія за довгостроковими кредитами на будівництво об`єктів житлового призначення', 
    205);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2125', '01', '2126', '15', 'премія за довгостроковими кредитами на будівництво об`єктів виробничого призначення', 
    204);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2125', '09', '2126', '23', 'премія за короткостроковими кредитами на будівництво об`єктів житлового призначення', 
    212);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2125', '08', '2126', '22', 'премія за короткостроковими кредитами на будівництво об`єктів виробничого призначення', 
    211);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2125', '14', '2126', '28', 'премія за короткостроковими кредитами на купівлю землі', 
    217);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2127', '03', '2123', '17', 'Прострочена заборгованість за короткостроковими кредитами на будівництво об`єктів іншого призначення', 
    192);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2127', '02', '2123', '16', 'Прострочена заборгованість за короткостроковими кредитами на будівництво об`єктів житлового призначе', 
    191);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2127', '01', '2123', '15', 'Прострочена заборгованість за короткостроковими кредитами на будівництво об`єктів виробничого призна', 
    190);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2127', '04', '2123', '18', 'Прострочена заборгованість за короткостроковими кредитами на купівлю об`єктів виробничого призначенн', 
    193);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2127', '05', '2123', '19', 'Прострочена заборгованість за короткостроковими кредитами на купівлю об`єктів житлового призначення', 
    194);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2127', '06', '2123', '20', 'Прострочена заборгованість за короткостроковими кредитами на купівлю об`єктів іншого призначення', 
    195);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2127', '14', '2123', '28', 'Прострочена заборгованість за довгостроковими кредитами на купівлю землі', 
    203);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2127', '08', '2123', '22', 'Прострочена заборгованість за довгостроковими кредитами на будівництво об`єктів виробничого призначе', 
    197);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2127', '09', '2123', '23', 'Прострочена заборгованість за довгостроковими кредитами на будівництво об`єктів житлового призначенн', 
    198);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2127', '10', '2123', '24', 'Прострочена заборгованість за довгостроковими кредитами на будівництво об`єктів іншого призначення', 
    199);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2127', '11', '2123', '25', 'Прострочена заборгованість за довгостроковими кредитами на купівлю об`єктів виробничого призначення', 
    200);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2127', '12', '2123', '26', 'Прострочена заборгованість за довгостроковими кредитами на купівлю об`єктів житлового призначення', 
    201);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2127', '13', '2123', '27', 'Прострочена заборгованість за довгостроковими кредитами на купівлю об`єктів іншого призначення', 
    202);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2127', '07', '2123', '21', 'Прострочена заборгованість за короткостроковими кредитами на купівлю землі', 
    196);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2129', '04', '2128', '32', 'прострочені нараховані доходи за короткостроковими кредитами на купівлю об`єктів виробничого признач', 
    221);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2129', '03', '2128', '31', 'прострочені нараховані доходи за короткостроковими кредитами на будівництво об`єктів іншого призначе', 
    220);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2129', '02', '2128', '30', 'прострочені нараховані доходи за короткостроковими кредитами на будівництво об`єктів житлового призн', 
    219);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2129', '05', '2128', '33', 'прострочені нараховані доходи за короткостроковими кредитами на купівлю об`єктів житлового призначен', 
    222);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2129', '01', '2128', '29', 'прострочені нараховані доходи за короткостроковими кредитами на будівництво об`єктів виробничого при', 
    218);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2129', '20', '2128', '41', 'прострочені нараховані доходи за довгостроковими кредитами на купівлю об`єктів іншого призначення', 
    230);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2129', '21', '2128', '42', 'прострочені нараховані доходи за довгостроковими кредитами на купівлю землі', 
    231);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2129', '07', '2128', '35', 'прострочені нараховані доходи за короткостроковими кредитами на купівлю землі', 
    224);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2129', '17', '2128', '38', 'прострочені нараховані доходи за довгостроковими кредитами на будівництво об`єктів іншого призначенн', 
    227);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2129', '16', '2128', '37', 'прострочені нараховані доходи за довгостроковими кредитами на будівництво об`єктів житлового признач', 
    226);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2129', '06', '2128', '34', 'прострочені нараховані доходи за короткостроковими кредитами на купівлю об`єктів іншого призначення', 
    223);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2129', '18', '2128', '39', 'прострочені нараховані доходи за довгостроковими кредитами на купівлю об`єктів виробничого призначен', 
    228);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2129', '19', '2128', '40', 'прострочені нараховані доходи за довгостроковими кредитами на купівлю об`єктів житлового призначення', 
    229);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2129', '15', '2128', '36', 'прострочені нараховані доходи за довгостроковими кредитами на будівництво об`єктів виробничого призн', 
    225);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2132', '04', '2133', '11', 'Короткострокові кредити на купівлю об`єктів виробничого призначення', 
    235);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2132', '03', '2133', '10', 'Короткострокові кредити на будівництво об`єктів іншого призначення', 
    234);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2132', '02', '2133', '09', 'Короткострокові кредити на будівництво об`єктів житлового  призначення', 
    233);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2132', '07', '2133', '14', 'Короткострокові кредити на купівлю землі', 
    238);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2132', '06', '2133', '13', 'Короткострокові кредити на купівлю об`єктів іншого призначення', 
    237);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2132', '05', '2133', '12', 'Короткострокові кредити на купівлю об`єктів житлового призначення', 
    236);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2132', '01', '2133', '08', 'Короткострокові кредити на будівництво об`єктів виробничого призначення', 
    232);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2135', '07', '2136', '21', 'премія за довгостроковими кредитами на купівлю землі', 
    259);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2135', '04', '2136', '18', 'премія за довгостроковими кредитами на купівлю об`єктів виробничого призначення', 
    256);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2135', '05', '2136', '19', 'премія за довгостроковими кредитами на купівлю об`єктів житлового призначення', 
    257);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2135', '06', '2136', '20', 'премія за довгостроковими кредитами на купівлю об`єктів іншого призначення', 
    258);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2135', '03', '2136', '17', 'премія за довгостроковими кредитами на будівництво об`єктів іншого призначення', 
    255);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2135', '02', '2136', '16', 'премія за довгостроковими кредитами на будівництво об`єктів житлового  призначення', 
    254);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2135', '01', '2136', '15', 'премія за довгостроковими кредитами на будівництво об`єктів виробничого призначення', 
    253);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2135', '14', '2136', '28', 'премія за короткостроковими кредитами на купівлю землі', 
    596);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2135', '13', '2136', '27', 'премія за короткостроковими кредитами на купівлю об`єктів іншого призначення', 
    595);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2135', '12', '2136', '26', 'премія за короткостроковими кредитами на купівлю об`єктів житлового  призначення', 
    594);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2135', '11', '2136', '25', 'премія за короткостроковими кредитами на купівлю об`єктів виробничого призначення', 
    593);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2135', '10', '2136', '24', 'премія за короткостроковими кредитами на будівництво об`єктів іншого призначення', 
    592);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2135', '09', '2136', '23', 'премія за короткостроковими кредитами на будівництво об`єктів житлового призначення', 
    591);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2135', '08', '2136', '22', 'премія за короткостроковими кредитами на будівництво об`єктів виробничого призначення', 
    260);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2137', '03', '2133', '17', 'Прострочена заборгованість за короткостроковими кредитами на будівництво об`єктів іншого призначення', 
    241);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2137', '02', '2133', '16', 'Прострочена заборгованість за короткостроковими кредитами на будівництво об`єктів житлового призначе', 
    240);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2137', '11', '2133', '25', 'Прострочена заборгованість за довгостроковими кредитами на купівлю об`єктів виробничого призначення', 
    249);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2137', '05', '2133', '19', 'Прострочена заборгованість за короткостроковими кредитами на купівлю об`єктів житлового призначення', 
    243);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2137', '06', '2133', '20', 'Прострочена заборгованість за короткостроковими кредитами на купівлю об`єктів іншого призначення', 
    244);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2137', '07', '2133', '21', 'Прострочена заборгованість за короткостроковими кредитами на купівлю землі', 
    245);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2137', '08', '2133', '22', 'Прострочена заборгованість за довгостроковими кредитами на будівництво об`єктів виробничого призначе', 
    246);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2137', '09', '2133', '23', 'Прострочена заборгованість за довгостроковими кредитами на будівництво об`єктів житлового призначенн', 
    247);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2137', '10', '2133', '24', 'Прострочена заборгованість за довгостроковими кредитами на будівництво об`єктів іншого призначення', 
    248);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2137', '04', '2133', '18', 'Прострочена заборгованість за короткостроковими кредитами на купівлю об`єктів виробничого призначенн', 
    242);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2137', '12', '2133', '26', 'Прострочена заборгованість за довгостроковими кредитами на купівлю об`єктів житлового призначення', 
    250);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2137', '13', '2133', '27', 'Прострочена заборгованість за довгостроковими кредитами на купівлю об`єктів іншого призначення', 
    251);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2137', '14', '2133', '28', 'Прострочена заборгованість за довгостроковими кредитами на купівлю землі', 
    252);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2137', '01', '2133', '15', 'Прострочена заборгованість за короткостроковими кредитами на будівництво об`єктів виробничого призна', 
    239);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2139', '02', '2138', '30', 'прострочені нараховані доходи за короткостроковими кредитами на будівництво об`єктів житлового призн', 
    598);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2139', '20', '2138', '41', 'прострочені нараховані доходи за довгостроковими кредитами на купівлю об`єктів іншого призначення', 
    609);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2139', '03', '2138', '31', 'прострочені нараховані доходи за короткостроковими кредитами на будівництво об`єктів іншого призначе', 
    599);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2139', '18', '2138', '39', 'прострочені нараховані доходи за довгостроковими кредитами на купівлю об`єктів виробничого призначен', 
    607);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2139', '17', '2138', '38', 'прострочені нараховані доходи за довгостроковими  кредитами на будівництво об`єктів іншого призначен', 
    606);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2139', '16', '2138', '37', 'прострочені нараховані доходи за довгостроковими кредитами на будівництво об`єктів житлового признач', 
    605);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2139', '19', '2138', '40', ' прострочені нараховані доходи за довгостроковими кредитами на купівлю об`єктів житлового призначенн', 
    608);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2139', '07', '2138', '35', 'прострочені нараховані доходи за короткостроковими кредитами на купівлю землі', 
    603);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2139', '06', '2138', '34', 'прострочені нараховані доходи за короткостроковими кредитами на купівлю об`єктів іншого призначення', 
    602);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2139', '05', '2138', '33', 'прострочені нараховані доходи за короткостроковими кредитами на купівлю об`єктів житлового призначен', 
    601);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2139', '04', '2138', '32', 'прострочені нараховані доходи за короткостроковими кредитами на купівлю об`єктів виробничого признач', 
    600);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2139', '21', '2138', '42', 'прострочені нараховані доходи за довгостроковими кредитами на купівлю землі', 
    610);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2139', '01', '2138', '29', 'прострочені нараховані доходи за короткостроковими кредитами на будівництво об`єктів виробничого при', 
    597);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2139', '15', '2138', '36', 'прострочені нараховані доходи за довгостроковими кредитами на будівництво об`єктів виробничого призн', 
    604);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '01', '2203', '54', 'Короткострокові кредити  на споживчі потреби тільки під поруку (без умови страхування кредиту)', 
    611);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '63', '2203', '77', 'Короткострокові кредити за банківським продуктом "Кеш кредити"', 
    653);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '05', '2203', '56', 'Короткострокові кредити  на споживчі потреби під заклад виробів та лому із дорогоцінних металів', 
    613);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '06', '2203', '57', 'Короткострокові кредити  на придбання нового транспортного засобу безготівковим шляхом', 
    614);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '08', '2203', '59', 'Короткострокові кредити  під платіжні картки ', 
    615);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '09', '2203', '59', 'Короткострокові кредити  під платіжні картки ', 
    616);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '10', '2203', '59', 'Короткострокові кредити  під платіжні картки ', 
    617);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '11', '2203', '59', 'Короткострокові кредити  під платіжні картки ', 
    618);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '12', '2203', '59', 'Короткострокові кредити  під платіжні картки ', 
    619);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '13', '2203', '59', 'Короткострокові кредити  під платіжні картки ', 
    620);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '14', '2203', '59', 'Короткострокові кредити  під платіжні картки ', 
    621);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '15', '2203', '59', 'Короткострокові кредити  під платіжні картки ', 
    622);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '16', '2203', '59', 'Короткострокові кредити  під платіжні картки ', 
    623);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '18', '2203', '59', 'Короткострокові кредити  під платіжні картки ', 
    624);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '20', '2203', '58', 'Короткострокові кредити  на придбання енергозберігаючих товарів через торговельну мережу', 
    625);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '21', '2203', '59', 'Короткострокові кредити  під платіжні картки ', 
    626);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '23', '2203', '60', 'Короткострокові кредити  під платіжні картки MasterCard по програмі "Арсенал"', 
    627);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '27', '2203', '61', 'Короткострокові кредити  на придбання нового транспортного засобу за готівку', 
    628);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '28', '2203', '62', 'Короткострокові кредити  на сплату страхових платежів за пакетом "повне КАСКО" за банківським продук', 
    629);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '32', '2203', '63', 'Короткострокові кредити  за стандартизованим банківським продуктом на придбання нового транспортного', 
    630);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '33', '2203', '64', 'Короткострокові кредити  на будівництво та ремонт житла і будівель за нестандартизованими умовами та', 
    631);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '34', '2203', '65', 'Короткострокові кредити  на кредити під заставу майнових прав на отримання грошових коштів, розміщен', 
    632);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '35', '2203', '66', 'Короткостроковікредити на придбання транспортних засобів, що перебували у користуванні', 
    633);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '41', '2203', '67', 'Короткострокові кредити на споживчі потреби під поруку (для працівників підприємств, які мають страт', 
    634);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '42', '2203', '68', 'Короткострокові кредити за стандартизованим банківським продуктом на придбання нового транспортного ', 
    635);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '43', '2203', '69', 'Короткострокові кредити  за стандартизованим банківським продуктом на придбання нового транспортного', 
    636);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '45', '2203', '70', 'Короткострокові кредити за поточними рахункам фізичних осіб з використаням платіжих карток в системі', 
    637);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '46', '2203', '70', 'Короткострокові кредити за поточними рахункам фізичних осіб з використаням платіжих карток в системі', 
    638);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '47', '2203', '70', 'Короткострокові кредити за поточними рахункам фізичних осіб з використаням платіжих карток в системі', 
    639);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '48', '2203', '70', 'Короткострокові кредити за поточними рахункам фізичних осіб з використаням платіжих карток в системі', 
    640);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '49', '2203', '70', 'Короткострокові кредити за поточними рахункам фізичних осіб з використаням платіжих карток в системі', 
    641);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '50', '2203', '70', 'Короткострокові кредити за поточними рахункам фізичних осіб з використаням платіжих карток в системі', 
    642);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '51', '2203', '70', 'Короткострокові кредити за поточними рахункам фізичних осіб з використаням платіжих карток в системі', 
    643);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '52', '2203', '70', 'Короткострокові кредити за поточними рахункам фізичних осіб з використаням платіжих карток в системі', 
    644);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '54', '2203', '71', 'Короткострокові  споживчі кредити за стандартизованими умовами "Споживче кредитування, забезпечене і', 
    645);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '56', '2203', '72', 'Короткострокові споживчі кредити на придбання енергозберігаючого обладнання та матеріалів', 
    646);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '57', '2203', '73', 'Короткострокові споживчі кредити на придбання енергозберігаючого обладнання та матеріалів в рамках д', 
    647);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '58', '2203', '74', 'Короткострокові споживчі кредити на придбання енергозберігаючого обладнання та матеріалів в рамках д', 
    648);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '59', '2203', '70', 'Короткострокові кредити за поточними рахункам фізичних осіб з використаням платіжих карток в системі', 
    649);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '60', '2203', '70', 'Короткострокові кредити за поточними рахункам фізичних осіб з використаням платіжих карток в системі', 
    650);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '61', '2203', '75', 'Короткострокові споживчі кредити на придбання електромобілів', 
    651);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '62', '2203', '76', 'Короткострокові споживчі кредити на придбання супутніх товарів до електромобілів', 
    652);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2202', '02', '2203', '55', 'Короткострокові кредити  на споживчі потреби під заставу', 
    612);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '00', '2206', '84', 'Неамортизована премiя за кредитами на поточнi потреби, що наданi фiзичним особам', 
    728);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '05', '2206', '85', 'премія за довгостроковими кредитами на купівлю автомобілів', 
    729);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '06', '2206', '86', 'премія за довгостроковими кредитами на придбання товарів тривалого користування', 
    730);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '08', '2206', '87', 'премія за довгостроковими кредитами на придбання нового транспортного засобу   безготівковим шляхом', 
    731);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '10', '2206', '88', 'премія за довгостроковими кредитами кредити на придбання енергозберігаючих товарів через торговельну', 
    732);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '11', '2206', '89', 'премія за довгостроковими споживчими кредитами за стандартизованими умовами "Споживче кредитування, ', 
    733);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '14', '2206', '90', 'премія за довгостроковими кредитами на споживчі потреби тільки під поруку (без умови страхування кре', 
    734);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '15', '2206', '91', 'премія за довгостроковими кредитами на споживчі потреби', 
    735);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '18', '2206', '92', 'премія за довгостроковими кредитами на придбання нового транспортного засобу за готівку', 
    736);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '22', '2206', '93', 'премія за довгостроковими кредитами за стандартизованим банківським продуктом на придбання нового тр', 
    737);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '23', '2206', '94', 'премія за довгостроковими кредитами на будівництво та ремонт житла і будівель за нестандартизованими', 
    738);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '24', '2206', '95', 'премія за довгостроковими кредитами на придбання житла та будівель за нестандартизованими умовами та', 
    739);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '25', '2206', '96', 'премія за довгостроковими кредитами на придбання житла на вторинному ринку нерухомості за нестандарт', 
    740);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '26', '2206', '97', 'премія за короткостроковими кредитами на споживчі потреби тільки під поруку (без умови страхування к', 
    741);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '27', '2206', '98', 'премія за короткостроковими кредитами на споживчі потреби під заставу', 
    742);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '29', '2206', '99', 'премія за короткостроковими кредитами на споживчі потреби під заклад виробів та лому із дорогоцінних', 
    743);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '30', '2206', 'A0', 'премія за короткостроковими кредитами на придбання нового транспортного засобу безготівковим шляхом', 
    744);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '33', '2206', 'A1', 'премія за короткостроковими кредитами на придбання енергозберігаючих товарів через торговельну мереж', 
    745);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '38', '2206', 'A2', 'премія за короткостроковими кредитами на придбання нового транспортного засобу за готівку', 
    746);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '39', '2206', 'A3', 'премія за короткостроковими кредитами на сплату страхових платежів за пакетом "повне КАСКО" за банкі', 
    747);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '43', '2206', 'A4', 'премія за короткостроковими кредитами за стандартизованим банківським продуктом на придбання нового ', 
    748);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '44', '2206', 'A5', 'премія за короткостроковими кредитами на будівництво та ремонт житла і будівель за нестандартизовани', 
    749);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '45', '2206', 'A6', 'премія за короткостроковими кредитами під заставу майнових прав на отримання грошових коштів, розміщ', 
    750);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '46', '2206', 'A7', 'премія за довгостроковими кредитами під заставу майнових прав на отримання грошових коштів, розміщен', 
    751);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '47', '2206', 'A8', 'премія за короткостроковими кредитами на придбання транспортних засобів, що перебували у користуванн', 
    752);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '48', '2206', 'A9', 'премія за довгостроковими кредитами на придбання транспортних засобів, що перебували у користуванні', 
    753);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '55', '2206', 'B0', 'премія за довгостроковими кредитами під заставу майнових прав на отримання банківських металів, розм', 
    754);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '57', '2206', 'B1', 'премія за довгостроковими кредитами за стандартизованим банківським продуктом на придбання нового тр', 
    755);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '58', '2206', 'B2', 'премія за короткостроковими кредитами на споживчі потреби під поруку (для працівників підприємств, я', 
    756);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '59', '2206', 'B3', 'премія за довгостроковими кредитами на споживчі потреби під поруку (для працівників підприємств, які', 
    757);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '60', '2206', 'B4', 'премія за довгостроковими кредитами на сплату страхових платежів за пакетом "повне КАСКО" за банківс', 
    758);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '61', '2206', 'B5', 'премія за короткостроковими кредитами за стандартизованим банківським продуктом на придбання нового ', 
    759);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '62', '2206', 'B6', 'премія за довгостроковими кредитами за стандартизованим банківським продуктом на придбання нового тр', 
    760);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '63', '2206', 'B7', 'премія за короткостроковими кредитами за стандартизованим банківським продуктом на придбання нового ', 
    761);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '64', '2206', 'B8', 'премія за довгостроковими кредитами за стандартизованим банківським продуктом на придбання нового тр', 
    762);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '66', '2206', 'B9', 'премія за короткостроковими споживчими кредитами за стандартизованими умовами "Споживче кредитування', 
    763);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '68', '2206', 'C0', 'премія за довгостроковими кредитами на споживчі потреби під заставу казначейських зобовязань', 
    764);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '69', '2206', 'C1', 'премія за короткостроковими споживчими кредитами на придбання енергозберігаючого обладнання та матер', 
    765);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '70', '2206', 'C2', 'премія за довгостроковими споживчими кредитами на придбання енергозберігаючого обладнання та матеріа', 
    766);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '71', '2206', 'C3', 'премія за короткостроковими споживчими кредитами на придбання енергозберігаючого обладнання та матер', 
    767);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '72', '2206', 'C4', 'премія за довгостроковими споживчими кредитами на придбання енергозберігаючого обладнання та матеріа', 
    768);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '73', '2206', 'C5', 'премія за короткостроковими споживчими кредитами на придбання енергозберігаючого обладнання та матер', 
    769);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '74', '2206', 'C6', 'премія за довгостроковими споживчими кредитами на придбання енергозберігаючого обладнання та матеріа', 
    770);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '77', '2206', 'C7', 'премія за короткостроковими споживчими кредитами на придбання електромобілів', 
    771);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '78', '2206', 'C8', 'премія за довгостроковими споживчими кредитами на придбання електромобілів', 
    772);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '79', '2206', 'C9', 'премія за короткостроковими споживчими кредитами на придбання супутніх товарів до електромобілів', 
    773);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '81', '2206', 'D1', 'премія за короткостроковими кредитами за банківським продуктом "Кеш кредити"', 
    775);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '82', '2206', 'D2', 'премія за довгостроковими кредитами за банківським продуктом "Кеш кредити"', 
    776);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2205', '80', '2206', 'D0', 'премія за довгостроковими споживчими кредитами на придбання супутніх товарів до електромобілів', 
    774);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '41', '2203', 'B6', 'Прострочена заборгованість за короткострокові кредити за стандартизованим банківським продуктом на п', 
    718);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '43', '2203', 'B7', 'Прострочена заборгованість за довгострокові кредити за стандартизованим банківським продуктом на при', 
    719);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '88', '2203', 'B8', 'Прострочена заборгованість за довгострокові кредити на  будівництво та ремонт житла і будівель за не', 
    720);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '89', '2203', 'B9', 'Прострочена заборгованість за довгострокові кредити на придбання житла та будівель за нестандартизов', 
    721);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '90', '2203', 'C0', 'Прострочена заборгованість за короткострокові кредити на будівництво та ремонт  житла і будівель за ', 
    722);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '91', '2203', 'C1', 'Прострочена заборгованість за довгострокові кредити на придбання житла на вторинному ринку нерухомос', 
    723);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '92', '2203', 'C2', 'Прострочена заборгованість за короткострокові кредити під заставу майнових прав на отримання грошови', 
    724);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '93', '2203', 'C3', 'Прострочена заборгованість за довгострокові кредити під заставу майнових прав на отримання грошових ', 
    725);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '94', '2203', 'C4', 'Прострочена заборгованість за короткострокові кредити на придбання транспортних засобів, що перебува', 
    726);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '95', '2203', 'C5', 'Прострочена заборгованість за довгострокові кредити на придбання транспортних засобів, що перебували', 
    727);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'D4', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    681);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'D5', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    682);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'D6', '2203', '88', 'Прострочена заборгованість за короткострокові споживчі кредити за стандартизованими умовами "Споживч', 
    683);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'D8', '2203', '89', 'Прострочена заборгованість за за довгостроковими кредитами на споживчі потреби під заставу казначейс', 
    684);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'D9', '2203', '90', 'Прострочена заборгованість за короткострокові споживчі кредити на придбання енергозберігаючого облад', 
    685);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'E0', '2203', '91', 'Прострочена заборгованість за довгострокові споживчі кредити на придбання енергозберігаючого обладна', 
    686);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'E1', '2203', '92', 'Прострочена заборгованість за короткострокові споживчі кредити на придбання енергозберігаючого облад', 
    687);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'E2', '2203', '93', 'Прострочена заборгованість за довгострокові споживчі кредити на придбання енергозберігаючого обладна', 
    688);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'E3', '2203', '94', 'Прострочена заборгованість за короткострокові споживчі кредити на придбання енергозберігаючого облад', 
    689);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'E4', '2203', '95', 'Прострочена заборгованість за довгострокові споживчі кредити на придбання енергозберігаючого обладна', 
    690);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'A3', '2203', '78', 'Прострочена заборгованість за довгострокові кредити під заставу майнових прав на отримання банківськ', 
    654);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'A5', '2203', '79', 'Прострочена заборгованість за довгострокові  кредити за стандартизованим банківським продуктом на пр', 
    655);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'A6', '2203', '80', 'Прострочена заборгованість за короткострокові кредити на споживчі потреби під поруку (для працівникі', 
    656);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'A7', '2203', '81', 'Прострочена заборгованість за довгострокові кредити на споживчі потреби під поруку (для працівників ', 
    657);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'A8', '2203', '82', 'Прострочена заборгованість за довгострокові кредити на сплату страхових платежів за пакетом "повне К', 
    658);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'B4', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    664);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'B6', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    665);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'B7', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    666);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'B8', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    667);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'B9', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    668);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'A9', '2203', '83', 'Прострочена заборгованість за короткострокові кредити за стандартизованим банківським продуктом на п', 
    659);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'B0', '2203', '84', 'Прострочена заборгованість за довгострокові кредити за стандартизованим банківським продуктом на при', 
    660);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'B1', '2203', '85', 'Прострочена заборгованість за короткострокові кредити за стандартизованим банківським продуктом на п', 
    661);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'B2', '2203', '86', 'Прострочена заборгованість за довгострокові кредити за стандартизованим банківським продуктом на при', 
    662);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'B3', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    663);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'C1', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    669);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'C2', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    670);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'C3', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    671);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'C4', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    672);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'C5', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    673);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'C6', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    674);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'C7', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    675);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'C8', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    676);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'C9', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    677);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'D0', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    678);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'D1', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    679);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'D3', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    680);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'E5', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    691);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'E6', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    692);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'E7', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    693);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'E8', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    694);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'E9', '2203', '96', 'Прострочена заборгованість за короткострокові споживчі кредити на придбання електромобілів', 
    695);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'F0', '2203', '97', 'Прострочена заборгованість за довгострокові споживчі кредити на придбання електромобілів', 
    696);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'F1', '2203', '98', 'Прострочена заборгованість за короткострокові споживчі кредити на придбання супутніх товарів до елек', 
    697);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'F2', '2203', '99', 'Прострочена заборгованість за довгострокові споживчі кредити на придбання супутніх товарів до електр', 
    698);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'F3', '2203', 'A0', 'Прострочена заборгованість за короткострокові кредити за банківським продуктом "Кеш кредити"', 
    699);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', 'F4', '2203', 'A1', 'Прострочена заборгованість за довгострокові кредити за банківським продуктом "Кеш кредити"', 
    700);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '01', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    701);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '05', '2203', 'A2', 'Прострочена заборгованість за короткострокові кредити на придбання нового транспортного засобу безго', 
    702);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '06', '2203', 'A3', 'Прострочена заборгованість за довгострокові кредити на придбання нового транспортного засобу безготі', 
    703);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '11', '2203', 'A4', 'Прострочена заборгованість за короткострокові кредити на придбання енергозберігаючих товарів через т', 
    704);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '12', '2203', 'A5', 'Прострочена заборгованість за довгострокові кредити на придбання енергозберігаючих товарів через тор', 
    705);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '13', '2203', 'A6', 'Прострочена заборгованість за догострокові споживчі кредити за стандартизованими умовами "Споживче к', 
    706);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '14', '2203', 'A7', 'Прострочена заборгованість за довгострокові кредити на купівлю автомобілів', 
    707);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '15', '2203', 'A8', 'Прострочена заборгованість за довгострокові кредити на придбання товарів тривалого користування', 
    708);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '20', '2203', 'A9', 'Прострочена заборгованість за короткострокові кредити на споживчі потреби тільки під поруку (без умо', 
    709);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '21', '2203', 'B0', 'Прострочена заборгованість за короткострокові кредити на споживчі потреби під заставу', 
    710);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '23', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    711);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '26', '2203', 'B1', 'Прострочена заборгованість за довгострокові кредити на споживчі потреби тільки під поруку (без умови', 
    712);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '27', '2203', 'B2', 'Прострочена заборгованість за довгострокові кредити на споживчі потреби', 
    713);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '32', '2203', '87', 'Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих ка', 
    714);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '33', '2203', 'B3', 'Прострочена заборгованість за короткострокові кредити на придбання нового транспортного засобу за го', 
    715);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '34', '2203', 'B4', 'Прострочена заборгованість за довгострокові кредити на придбання нового транспортного засобу за готі', 
    716);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2207', '35', '2203', 'B5', 'Прострочена заборгованість за короткострокові кредити на сплату страхових платежів за пакетом "повне', 
    717);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'G6', '2208', 'I4', 'прострочені нараховані доходи за короткостроковими споживчими кредитами за стандартизованими умовами', 
    811);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'G8', '2208', 'I5', 'прострочені нараховані доходи за довгостроковими кредитами на споживчі потреби під заставу казначейс', 
    812);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'G9', '2208', 'I6', 'прострочені нараховані доходи за короткостроковими споживчими кредитами на придбання енергозберігаюч', 
    813);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'H0', '2208', 'I7', 'прострочені нараховані доходи за довгостроковими споживчими кредитами на придбання енергозберігаючог', 
    814);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'H1', '2208', 'I8', 'прострочені нараховані доходи за короткостроковими споживчими кредитами на придбання енергозберігаюч', 
    815);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'H2', '2208', 'I9', 'прострочені нараховані доходи за довгостроковими споживчими кредитами на придбання енергозберігаючог', 
    816);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'H3', '2208', 'J0', 'прострочені нараховані доходи за короткостроковими споживчими кредитами на придбання енергозберігаюч', 
    817);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'H4', '2208', 'J1', 'прострочені нараховані доходи за довгостроковими споживчими кредитами на придбання енергозберігаючог', 
    818);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'H5', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    819);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'H6', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    820);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'H7', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    821);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'H8', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    822);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'H9', '2208', 'J2', 'прострочені нараховані доходи за короткостроковими споживчими кредитами на придбання електромобілів', 
    823);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'I0', '2208', 'J3', 'прострочені нараховані доходи за довгостроковими споживчими кредитами на придбання електромобілів', 
    824);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'I1', '2208', 'J4', 'прострочені нараховані доходи за короткостроковими споживчими кредитами на придбання супутніх товарі', 
    825);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'I2', '2208', 'J5', 'прострочені нараховані доходи за довгостроковими споживчими кредитами на придбання супутніх товарів ', 
    826);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'I3', '2208', 'J6', 'прострочені нараховані доходи за короткостроковими кредитами за банківським продуктом "Кеш кредити"', 
    827);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'I4', '2208', 'J7', 'прострочені нараховані доходи за довгостроковими кредитами за банківським продуктом "Кеш кредити"', 
    828);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '06', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    829);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '12', '2208', 'J8', 'прострочені нараховані доходи за короткостроковими кредитами на придбання нового транспортного засоб', 
    830);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '14', '2208', 'J9', 'прострочені нараховані доходи за довгостроковими кредитами на придбання нового транспортного засобу ', 
    831);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '24', '2208', 'K0', 'прострочені нараховані доходи за короткостроковими кредитами          на придбання енергозберігаючих', 
    832);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '26', '2208', 'K1', 'прострочені нараховані доходи за довгостроковими кредитами          на придбання енергозберігаючих т', 
    833);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '28', '2208', 'K2', 'прострочені нараховані доходи за довгостроковими споживчими          кредитами за стандартизованими ', 
    834);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '30', '2208', 'K3', 'прострочені  нараховані доходи за довгостроковими кредитами на купівлю автомобілів', 
    835);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'A0', '2208', 'G9', 'прострочені нараховані доходи за довгостроковими кредитами на придбання житла на вторинному ринку не', 
    777);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'A2', '2208', 'H0', 'прострочені нараховані доходи за короткостроковими кредитами під заставу майнових прав на отримання ', 
    778);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'A4', '2208', 'H1', 'прострочені нараховані доходи за довгостроковими кредитами під заставу майнових прав на отримання гр', 
    779);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'A6', '2208', 'H2', 'прострочені нараховані доходи за короткостроковими кредитами на придбання транспортних засобів, що п', 
    780);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'A8', '2208', 'H3', 'прострочені нараховані доходи за довгостроковими кредитами на придбання транспортних засобів, що пер', 
    781);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'C8', '2208', 'H4', 'прострочені нараховані доходи за довгостроковими кредитами під заставу майнових прав на отримання ба', 
    782);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'D3', '2208', 'H5', 'прострочені нараховані доходи за довгостроковими кредитами за стандартизованим банківським продуктом', 
    783);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'D5', '2208', 'H6', 'прострочені нараховані доходи за короткостроковими кредитами на споживчі потреби під поруку (для пра', 
    784);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'D7', '2208', 'H7', 'прострочені нараховані доходи за довгостроковими кредитами на споживчі потреби під поруку (для праці', 
    785);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'D9', '2208', 'H8', 'прострочені нараховані доходи за довгостроковими кредитами на сплату страхових платежів за пакетом "', 
    786);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'E0', '2208', 'H9', 'прострочені нараховані доходи за короткостроковими кредитами за стандартизованим банківським продукт', 
    787);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'E1', '2208', 'I0', 'прострочені нараховані доходи за довгостроковими кредитами за стандартизованим банківським продуктом', 
    788);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'E2', '2208', 'I1', 'прострочені нараховані доходи за короткостроковими кредитами за стандартизованим банківським продукт', 
    789);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'E3', '2208', 'I2', 'прострочені нараховані доходи за довгостроковими кредитами за стандартизованим банківським продуктом', 
    790);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'E4', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    791);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '42', '2208', 'K5', 'прострочені нараховані доходи за короткостроковими кредитами на споживчі потреби тільки під поруку (', 
    327);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'E5', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    792);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'E7', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    793);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'E8', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    794);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'E9', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    795);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'F0', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    796);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'F1', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    797);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'F2', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    798);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'F3', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    799);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'F4', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    800);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'F5', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    801);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'F6', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    802);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'F7', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    803);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'F8', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    804);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'F9', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    805);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'G0', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    806);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'G1', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    807);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'G3', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    808);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'G4', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    809);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', 'G5', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    810);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '44', '2208', 'K6', 'прострочені нараховані доходи за короткостроковими кредитами на споживчі потреби під заставу', 
    328);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '52', '2208', 'K7', 'прострочені нараховані доходи за довгостроковими кредитами на споживчі потреби тільки під поруку (бе', 
    329);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '54', '2208', 'K8', 'прострочені нараховані доходи за довгостроковими кредитами на споживчі потреби', 
    330);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '64', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    331);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '66', '2208', 'I3', 'Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжи', 
    332);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '68', '2208', 'K9', 'прострочені нараховані доходи за короткостроковими кредитами на придбання нового транспортного засоб', 
    333);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '70', '2208', 'L0', 'прострочені нараховані доходи за довгостроковими кредитами на придбання нового транспортного засобу ', 
    334);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '72', '2208', 'L1', 'прострочені нараховані доходи за  короткостроковими кредитами на сплату страхових платежів за пакето', 
    335);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '84', '2208', 'L2', 'прострочені нараховані доходи за короткостроковими кредитами за стандартизованим банківським продукт', 
    336);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '88', '2208', 'L3', 'прострочені нараховані доходи за довгостроковими кредитами за стандартизованим банківським продуктом', 
    337);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '90', '2208', 'L4', 'прострочені нараховані доходи за короткостроковими кредитами, які надані фізичним особам на будівниц', 
    338);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '91', '2208', 'L5', 'прострочені нараховані доходи за довгостроковими кредитами, які надані фізичним особам на будівництв', 
    339);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '92', '2208', 'L6', 'прострочені нараховані доходи за довгостроковими кредитами, які надані фізичним особам на придбання ', 
    340);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '98', '2208', 'L7', 'прострочені нараховані доходи за кредитами на поточні потреби, що надані фізичним особам (сумнівні з', 
    341);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '99', '2208', 'L8', 'прострочені нараховані доходи за кредитами за нестандартизованими продуктами (інвестиційна діяльніст', 
    342);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2209', '32', '2208', 'K4', 'прострочені нараховані доходи за довгостроковими кредитами на придбання товарів тривалого користуван', 
    326);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2235', '08', '2236', '37', ' премія за довгостроковими кредитами на купівлю, будівництво та реконструкцію іншої нерухомості за с', 
    366);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2235', '07', '2236', '36', ' премія за довгостроковими кредитами на придбання житла на вторинному ринку нерухомості, шляхом пере', 
    365);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2235', '09', '2236', '38', ' премія за довгостроковими кредитами молодим сім`ям та одиноким молодим громадянам на придбання житл', 
    367);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2235', '12', '2236', '39', ' премія за довгостроковими кредитами за стандартизованим продуктом на купівлю земельної ділянки', 
    368);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2235', '13', '2236', '40', ' премія за довгостроковими кредитами на придбання житла на вторинному ринку нерухомості за нестандар', 
    369);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2235', '20', '2236', '41', ' премія за довгостроковими кредитами за програмою "Доступне житло"', 
    370);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2235', '21', '2236', '42', ' премія за довгостроковими кредитами на придбання житла на вторинному ринку нерухомості за будівельн', 
    371);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2235', '23', '2236', '43', ' премія за довгостроковими кредитами на придбання житла на первинному ринку нерухомості за будівельн', 
    372);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2235', '25', '2236', '44', ' премія за довгостроковими кредитами на придбання доступного житла в рамках програми КМУ', 
    373);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2235', '27', '2236', '45', ' премія за довгостроковими кредитами на придбання житла на первинному ринку нерухомості за будівельн', 
    374);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2235', '28', '2236', '46', ' премія за довгостроковими кредитами на придбання житла на первинному ринку нерухомості, за будівель', 
    375);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2235', '31', '2236', '49', ' премія за довгостроковими кредитами на придбання житла за банківським продуктом "Споживчий кредит п', 
    378);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2235', '30', '2236', '48', ' премія за довгостроковими кредитами на придбання житла за банківським продуктом "Кредит "Вторинний ', 
    377);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2235', '29', '2236', '47', ' премія за довгостроковими кредитами на придбання житла на вторинному ринку нерухомості, за будівель', 
    376);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2235', '01', '2236', '32', ' премія за довгостроковими кредитами на придбання житла на вторинному ринку нерухомості', 
    361);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2235', '03', '2236', '33', ' премія за довгостроковими кредитами на будівництво та реконструкцію житла', 
    362);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2235', '05', '2236', '34', ' премія за довгостроковими кредитами на купівлю, будівництво та реконструкцію іншої нерухомості за с', 
    363);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2235', '06', '2236', '35', ' премія за довгостроковими кредитами на придбання житла на первинному ринку нерухомості', 
    364);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2237', '38', '2233', '36', 'Прострочена заборгованість за довгострокові кредити на придбання житла на первинному ринку нерухомос', 
    354);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2237', '35', '2233', '34', 'Прострочена заборгованість за довгострокові кредити за програмою "Доступне житло"', 
    352);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2237', '30', '2233', '33', ' Прострочена заборгованість за довгострокові кредити на придбання житла  на вторинному ринку нерухом', 
    351);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2237', '13', '2233', '32', 'Прострочена заборгованість за довгострокові кредити за стандартизованим продуктом на купівлю земельн', 
    350);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2237', '10', '2233', '31', 'Прострочена заборгованість за довгострокові кредити молодим сім`ям та одиноким молодим громадянам на', 
    349);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2237', '08', '2233', '30', 'Прострочена заборгованість за довгострокові кредити, які надані фізичним особам на купівлю, будівниц', 
    348);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2237', '46', '2233', '42', 'Прострочена заборгованість за довгострокові кредити на придбання житла за банківським продуктом "Спо', 
    360);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2237', '45', '2233', '41', 'Прострочена заборгованість за довгострокові кредити на придбання житла за банківським продуктом "Кре', 
    359);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2237', '44', '2233', '40', 'Прострочена заборгованість за довгострокові кредити на придбання житла на вторинному ринку нерухомос', 
    358);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2237', '43', '2233', '39', 'Прострочена заборгованість за довгострокові кредити на придбання житла на первинному ринку нерухомос', 
    357);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2237', '42', '2233', '38', 'Прострочена заборгованість за довгострокові кредити на придбання житла на первинному ринку нерухомос', 
    356);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2237', '36', '2233', '35', 'Прострочена заборгованість за довгострокові кредити на придбання житла на вторинному ринку нерухомос', 
    353);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2237', '40', '2233', '37', 'Прострочена заборгованість за довгострокові кредити на придбання доступного житла в рамках програми ', 
    355);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2237', '03', '2233', '26', 'Прострочена заборгованість за довгострокові кредити, які надані фізичним особам на будівництво та ре', 
    344);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2237', '01', '2233', '25', 'Прострочена заборгованість за довгострокові кредити, які надані фізичним особам на придбання житла н', 
    343);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2237', '05', '2233', '27', 'Прострочена заборгованість за довгострокові кредити, які надані фізичним особам на купівлю, будівниц', 
    345);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2237', '06', '2233', '28', 'Прострочена заборгованість за довгострокові кредити, які надані фізичним особам на придбання житла н', 
    346);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2237', '07', '2233', '29', 'Прострочена заборгованість за довгострокові кредити, які надані фізичним особам на придбання житла н', 
    347);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2239', '19', '2238', '58', 'прострочені нараховані доходи за довгостроковими кредитами молодим сім`ям та одиноким молодим громад', 
    385);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2239', '57', '2238', '65', 'прострочені нараховані доходи за довгостроковими кредитами на придбання доступного житла в рамках пр', 
    392);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2239', '15', '2238', '57', 'прострочені нараховані доходи за довгостроковими кредитами на купівлю, будівництво та реконструкцію ', 
    384);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2239', '13', '2238', '56', 'прострочені нараховані доходи за довгостроковими кредитами, які надані фізичним особам на придбання ', 
    383);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2239', '11', '2238', '55', 'прострочені нараховані доходи за довгостроковими кредитами, які надані фізичним особам на придбання ', 
    382);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2239', '09', '2238', '54', 'прострочені нараховані доходи за довгостроковими кредитами, надані фізичним особам на купівлю, будів', 
    381);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2239', '63', '2238', '70', 'прострочені нараховані доходи за довгостроковими кредитами на придбання житла за банківським продукт', 
    397);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2239', '01', '2238', '52', 'прострочені нараховані доходи за довгостроковими кредитами, які надані фізичним особам на придбання ', 
    379);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2239', '36', '2238', '61', 'прострочені нараховані доходи за довгостроковими іпотечними кредитами, що надані фізичним особам (су', 
    388);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2239', '49', '2238', '62', 'прострочені нараховані доходи за довгостроковими кредитами за програмою "Доступне житло"', 
    389);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2239', '51', '2238', '63', 'прострочені нараховані доходи за довгостроковими кредитами на придбання житла на вторинному ринку не', 
    390);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2239', '55', '2238', '64', 'прострочені нараховані доходи за довгостроковими кредитами на придбання житла на первинному ринку не', 
    391);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2239', '25', '2238', '59', 'прострочені нараховані доходи  за довгостроковими кредитами за стандартизованим продуктом на купівлю', 
    386);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2239', '05', '2238', '53', 'прострочені нараховані доходи  за довгостроковими кредитами,         які надані фізичним особам на б', 
    380);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2239', '62', '2238', '69', 'прострочені нараховані доходи за довгостроковими кредитами на придбання житла за банківським продукт', 
    396);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2239', '61', '2238', '68', 'прострочені нараховані доходи за довгостроковими кредитами на придбання житла на вторинному ринку не', 
    395);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2239', '60', '2238', '67', 'прострочені нараховані доходи за довгостроковими кредитами на придбання житла на первинному ринку не', 
    394);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2239', '59', '2238', '66', 'прострочені нараховані доходи за довгостроковими кредитами на придбання житла на первинному ринку не', 
    393);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2239', '30', '2238', '60', 'прострочені нараховані доходи за довгостроковими кредитами на придбання житла на вторинному ринку не', 
    387);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2615', '04', '2610', '24', 'Довгострокові інвестиційні вклади іноземних інвесторів', 
    398);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2615', '08', '2610', '26', 'Довгострокоий вклад (депозит) "Максимальний"', 
    399);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2615', '09', '2610', '27', 'Довгострокоий вклад (депозит) "Накопичувальний"', 
    400);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2615', '13', '2610', '28', 'Довгострокоий вклад "Мобільний"', 
    401);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2615', '14', '2610', '29', 'Довгострокоі вклади (депозити) залучені на індивідуальних умовах', 
    402);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2615', '16', '2610', '31', 'Довгострокоий вклад (депозит) "Інвестиційний"', 
    403);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2615', '17', '2610', '32', 'Довгострокоий вклад (депозит) "Забезпечувальний"', 
    404);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2615', '18', '2610', '33', 'Довгострокоий вклад (депозит) "Депозитна лінія"', 
    405);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '55', '2630', 'F0', 'Довгостроковий вклад "Акційний"  строком на 25 місяців', 
    447);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '56', '2630', 'F1', 'Довгостроковий  вклад "Мій  депозит" строком на 18 місяців;', 
    448);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '57', '2630', 'F2', ' Довгостроковий вклад "Мій пенсійний депозит" строком на 18 місяців;', 
    449);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '58', '2630', 'F3', ' Довгостроковий вклад "Мій преміальний депозит" строком на 18 місяців', 
    450);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '14', '2630', 'B7', 'Довгострокові нерухомі вклади із залишками 1 гривня і більше, які підлягають компенсації відповідно ', 
    414);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '13', '2630', 'B6', 'Довгострокові нерухомі вклади із залишками до 1 гривні, які підлягають компенсації відповідно до Зак', 
    413);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '12', '2630', 'B5', 'Довгостроковий вклад "Шкільний  Ощадного банку"', 
    412);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '11', '2630', 'B4', 'Довгостроковий вклад "Строковий пенсійний"', 
    411);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '08', '2630', 'B3', 'Довгострокові депозити по забезпеченню операцуй з БПК МПС Master Card', 
    410);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '07', '2630', 'B2', 'Довгострокові депозити по забезпеченню операцій з БПК МПС VISA', 
    409);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '03', '2630', 'B1', 'Довгостроковий вклад "Авансовий-15"', 
    408);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '02', '2630', 'B0', 'Довгострокові цільові вклади на дітей', 
    407);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '01', '2630', 'A9', 'Довгостроковий вклад "Депозитний"  строком більше 1 року', 
    406);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '54', '2630', 'E9', 'Довгостроковий вклад "Акційний"  строком на 22 місяці', 
    446);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '53', '2630', 'E8', 'Довгостроковий вклад "Акційний"  строком на 18 місяців', 
    445);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '52', '2630', 'E7', 'Довгостроковий вклад "Мій депозит - Преміальний" без права дострокового розірвання вкладу строком на', 
    444);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '51', '2630', 'E6', 'Довгостроковий вклад "Мій депозит - Пенсійний" без права дострокового розірвання вкладу строком на 1', 
    443);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '50', '2630', 'E5', 'Довгостроковий вклад "Мій депозит" без права дострокового розірвання вкладу строком на 18 місяців', 
    442);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '49', '2630', 'E4', 'Довгостроковий вклад "Пенсійний" без права дострокового розірвання вкладу строком на 18  місяців (ра', 
    441);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '46', '2630', 'E1', 'Довгостроковий вклад "Класичний" без права дострокового розірвання вкладу строком на 36 місяців (рах', 
    438);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '47', '2630', 'E2', 'Довгостроковий вклад "Капітал" без права дострокового розірвання вкладу строком на 18 місяців (рахун', 
    439);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '48', '2630', 'E3', 'Довгостроковий вклад "Капітал" без права дострокового розірвання вкладу строком на 36 місяців (рахун', 
    440);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '45', '2630', 'E0', 'Довгостроковий вклад "Класичний" без права дострокового розірвання вкладу строком на 18 місяців (рах', 
    437);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '44', '2630', 'D9', 'Довгостроковий вклад "Пенсійний" строком на 18 місяців', 
    436);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '43', '2630', 'D8', 'Довгостроковий вклад "Гнучкий" строком на 18 місяців', 
    435);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '42', '2630', 'D7', 'Довгостроковий вклад "Капітал" строком на 36 місяців', 
    434);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '41', '2630', 'D6', 'Довгостроковий вклад "Капітал" строком на 18 місяців', 
    433);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '40', '2630', 'D5', 'Довгостроковий вклад "Класичний" строком на 18 місяців', 
    432);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '15', '2630', 'B8', 'Довгострокові нерухомі вклади із залишками до 1 гривні, які не підлягають компенсації', 
    415);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '16', '2630', 'B9', 'Довгострокові нерухомі вклади із залишками 1 гривня і більше, які не підлягають компенсації', 
    416);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '19', '2630', 'C0', 'Довгостроковий вклад "Дитячий"', 
    417);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '21', '2630', 'C1', 'Довгостроковий вклад "Депозитний Ощадного банку" (в рамках пакету "Ексклюзивний")', 
    418);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '22', '2630', 'C2', 'Довгострокові пенсійні депозитні рахунки', 
    419);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '24', '2630', 'C3', 'Довгостроковий вклад "Пенсійний +"', 
    420);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '25', '2630', 'C4', 'Довгостроковий вклад "Мобільний"', 
    421);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '26', '2630', 'C5', 'Довгостроковий вклад "Майбутнє дітям"', 
    422);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '28', '2630', 'C6', 'Довгостроковий вклад "Накопичувальний"  строком на 24 місяці', 
    423);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '29', '2630', 'C7', 'Довгостроковий вклад "Новий відсоток"', 
    424);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '30', '2630', 'C8', 'Довгостроковий вклад "Накопичувальний"  строком на 36 місяців', 
    425);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '33', '2630', 'C9', 'Довгостроковий вклад "Золотий стандарт"', 
    426);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '34', '2630', 'D0', 'Довгостроковий вклад "Строковий пенсійний Ощадного банку" (в рамках пакету "Ексклюзивний")', 
    427);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '35', '2630', 'D1', 'Довгостроковий вклад "Комбінований"', 
    428);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '37', '2630', 'D2', 'Довгостроковий вклад "Депозитний"  строком більше 1 року (застава по кредиту юр.особи)', 
    429);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '38', '2630', 'D3', 'Довгостроковий нерухомі вклади для ЦРНВ із залишками, що дорівнюють або перевищують 30 гривень або о', 
    430);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2635', '39', '2630', 'D4', 'Довгостроковий вклад "Класичний" строком на 36 місяців', 
    431);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2652', '11', '2651', '29', 'Довгостроковий вклад (депозит) "Забезпечувальний"', 
    456);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2652', '10', '2651', '28', 'Довгостроковий вклад (депозит) "Інвестиційний"', 
    455);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2652', '08', '2651', '27', 'Довгостроковий вклади (депозити) залучені на індивідуальних умовах', 
    454);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2652', '07', '2651', '26', 'Довгостроковий  вклад "Мобільний"', 
    453);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2652', '05', '2651', '25', 'Довгостроковий вклад (депозит) "Накопичувальний"', 
    452);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2652', '04', '2651', '24', 'Довгостроковий вклад (депозит) "Максимальний"', 
    451);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2652', '12', '2651', '30', 'Довгостроковий вклад (депозит)  "Депозитна лінія"', 
    457);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2700', '01', '2701', '02', 'Короткострокові кредити, що отримані від міжнародних та інших організацій', 
    458);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('2707', '00', '2706', '03', 'Неамортизована премiя за кредитами, що отриманi вiд мiжнародних та iнших органiзацiй', 
    459);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3116', '00', '3116', '01', 'Неамортизована дисконт за борговими цінними паперами, які обліковуються за справедливою вартістю чер', 
    460);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3117', '00', '3116', '02', 'Неамортизована премія за борговими цінними паперами, які обліковуються за справедливою вартістю чере', 
    461);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3119', '01', '3118', '04', 'прострочені нараховані доходи за борговими цінними паперами (крім доходів за державними цінними папе', 
    462);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3119', '04', '3118', '05', 'прострочені інші нараховані доходи за борговими цінними паперами', 
    463);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3216', '00', '3216', '01', 'Неамортизована дисконт за борговими цінними паперами, які обліковуються за амортизованою собівартіст', 
    464);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3217', '00', '3216', '02', 'Неамортизована премія за борговими цінними паперами, які обліковуються за амортизованою собівартістю', 
    465);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3340', '01', '3320', '08', 'ощадні сертифікати, термін погашення яких минув', 
    466);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3348', '01', '3328', '05', 'Нараховані витрати за ощадними (депозитними) сертифікатами на вимогу', 
    467);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3570', '21', '3570', '19', 'нараховані доходи за рахунками фізичних осіб в системі WAY4', 
    1421);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3570', '22', '3570', '19', 'нараховані доходи за рахунками фізичних осіб в системі WAY4', 
    1422);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3570', '23', '3570', '19', 'нараховані доходи за рахунками фізичних осіб в системі WAY4', 
    1423);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3570', '24', '3570', '19', 'нараховані доходи за рахунками фізичних осіб в системі WAY4', 
    1424);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3570', '25', '3570', '19', 'нараховані доходи за рахунками фізичних осіб в системі WAY4', 
    1425);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3570', '31', '3570', '19', 'нараховані доходи за рахунками фізичних осіб в системі WAY4', 
    1426);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3570', '32', '3570', '19', 'нараховані доходи за рахунками фізичних осіб в системі WAY4', 
    1427);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3570', '36', '3570', '19', 'нараховані доходи за рахунками фізичних осіб в системі WAY4', 
    1428);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3570', '13', '3570', '19', 'нараховані доходи за рахунками фізичних осіб в системі WAY4', 
    1413);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3570', '14', '3570', '19', 'нараховані доходи за рахунками фізичних осіб в системі WAY4', 
    1414);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3570', '15', '3570', '19', 'нараховані доходи за рахунками фізичних осіб в системі WAY4', 
    1415);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3570', '16', '3570', '19', 'нараховані доходи за рахунками фізичних осіб в системі WAY4', 
    1416);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3570', '17', '3570', '19', 'нараховані доходи за рахунками фізичних осіб в системі WAY4', 
    1417);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3570', '18', '3570', '19', 'нараховані доходи за рахунками фізичних осіб в системі WAY4', 
    1418);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3570', '19', '3570', '19', 'нараховані доходи за рахунками фізичних осіб в системі WAY4', 
    1419);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3570', '20', '3570', '19', 'нараховані доходи за рахунками фізичних осіб в системі WAY4', 
    1420);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '07', '3570', '37', 'прострочені нараховані доходи за обслуговування суб`єктів господарювання', 
    468);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '96', '3570', '50', 'прострочені нараховані доходи за зарахування коштів на рахунки акредитованих нотаріусів', 
    515);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '09', '3578', '40', 'прострочені нараховані доходи за лізинговими (орендними) платежами, що неотримані від суб`єктів госп', 
    470);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '19', '3578', '41', 'прострочені нараховані доходи за послуги з інкасації готівки та перевезення цінностей, що надані суб', 
    471);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '23', '3570', '51', 'прострочені нараховані доходи за поточними рахункам фізичних осіб з використаням платіжих карток в с', 
    472);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '24', '3570', '38', 'прострочені нараховані доходи за обслуговування  суб"єктів господарювання через системи дистанційног', 
    473);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '31', '3570', '39', 'прострочені нараховані доходи, що неотримані за обслуговування фізичних осіб', 
    474);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '33', '3570', '52', 'прострочені нараховані доходи за послугами по БПК МПС, що надані суб`єктам господарювання', 
    475);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '35', '3578', '44', 'прострочені інші нараховані доходи, що неотримані від фізичних осіб', 
    476);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '37', '3570', '40', 'прострочені нараховані доходи за прийняті платежі', 
    477);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '39', '3578', '45', 'прострочені нараховані доходи за послуги з інкасації готівки та перевезення цінностей, що надаються ', 
    478);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '47', '3578', '46', 'прострочені нараховані доходи за резервування коштів на невикористану частину кредитної лінії, що не', 
    479);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '50', '3578', '47', 'прострочені нараховані доходи за резервування коштів на невикористану частину кредитної лінії, що не', 
    480);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '54', '3578', '48', 'прострочені нараховані доходи за наданими гарантіями, що неотримані від суб`єктів господарювання', 
    481);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '57', '3578', '49', 'прострочені нараховані доходи за нарахованими доходами за агентськими договорами, укладеними зі стра', 
    482);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '60', '3578', '50', 'прострочені інші нараховані доходи за кредитними операціями, що неотримані від фізичних осіб', 
    483);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '63', '3578', '51', 'прострочені інші нараховані доходи за кредитними операціями, що неотримані від суб`єктів господарюва', 
    484);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '66', '3570', '41', 'прострочені нараховані доходи за поточними рахункам фізичних осіб з використаням платіжих карток в с', 
    485);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '67', '3570', '41', 'прострочені нараховані доходи за поточними рахункам фізичних осіб з використаням платіжих карток в с', 
    486);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '68', '3570', '41', 'прострочені нараховані доходи за поточними рахункам фізичних осіб з використаням платіжих карток в с', 
    487);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '69', '3570', '41', 'прострочені нараховані доходи за поточними рахункам фізичних осіб з використаням платіжих карток в с', 
    488);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '70', '3570', '41', 'прострочені нараховані доходи за поточними рахункам фізичних осіб з використаням платіжих карток в с', 
    489);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '71', '3570', '41', 'прострочені нараховані доходи за поточними рахункам фізичних осіб з використаням платіжих карток в с', 
    490);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '72', '3570', '41', 'прострочені нараховані доходи за поточними рахункам фізичних осіб з використаням платіжих карток в с', 
    491);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '73', '3570', '41', 'прострочені нараховані доходи за поточними рахункам фізичних осіб з використаням платіжих карток в с', 
    492);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '74', '3570', '41', 'прострочені нараховані доходи за поточними рахункам фізичних осіб з використаням платіжих карток в с', 
    493);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '75', '3570', '41', 'прострочені нараховані доходи за поточними рахункам фізичних осіб з використаням платіжих карток в с', 
    494);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '76', '3570', '41', 'прострочені нараховані доходи за поточними рахункам фізичних осіб з використаням платіжих карток в с', 
    495);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '77', '3570', '41', 'прострочені нараховані доходи за поточними рахункам фізичних осіб з використаням платіжих карток в с', 
    496);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '78', '3570', '41', 'прострочені нараховані доходи за поточними рахункам фізичних осіб з використаням платіжих карток в с', 
    497);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '79', '3570', '42', 'прострочені нараховані доходи за банківським продуктом ` Корпоративні платіжні картки клієнтів-суб`є', 
    498);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '80', '3570', '43', 'прострочені нараховані доходи за банківським продуктом " Корпоративні платіжні картки клієнтів-фізич', 
    499);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '81', '3570', '44', 'прострочені нараховані доходи за банківським продуктом " Корпоративні платіжні картки клієнтів-небан', 
    500);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '82', '3570', '45', 'прострочені нараховані доходи за банківським продуктом " Корпоративні платіжні картки клієнтів-бюдже', 
    501);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '83', '3578', '58', 'прострочені нараховані доходи за депозитарними операціями, що неотримані від фізичних осіб', 
    502);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '84', '3578', '52', 'прострочені нараховані доходи за депозитарними операціями, що неотримані від суб"єктів господарюванн', 
    503);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '85', '3578', '53', 'прострочені нараховані доходи за депозитарними операціями, що неотримані від недержавних пенсійних ф', 
    504);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '86', '3570', '41', 'прострочені нараховані доходи за поточними рахункам фізичних осіб з використаням платіжих карток в с', 
    505);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '87', '3570', '41', 'прострочені нараховані доходи за поточними рахункам фізичних осіб з використаням платіжих карток в с', 
    506);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '88', '3570', '47', 'прострочені нараховані доходи за надання виписок в електронному вигляді шляхом SMS-повідомлень суб"є', 
    507);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '89', '3578', '54', 'прострочені  нараховані доходи за наданими гарантіями, що неотримані від банків', 
    508);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '90', '3570', '48', 'прострочені нараховані доходи за РКО по виплаті з/пл., тощо', 
    509);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '91', '3578', '55', 'прострочені нараховані доходи за кредитами овердрафт, що неотримані від суб"єктів господарювання', 
    510);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '92', '3570', '49', 'прострочені нараховані доходи за продуктом торгового еквайрингу "Все включено" в системі WAY4', 
    511);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '93', '3578', '56', 'за простроченими нарахованими доходами за авальованими векселями, що неотримані від клієнтів ММСБ', 
    512);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '94', '3578', '57', 'прострочені нараховані доходи за депозитарними операціями, що неотримані від банків', 
    513);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '95', '3570', '41', 'прострочені нараховані доходи за поточними рахункам фізичних осіб з використаням платіжих карток в с', 
    514);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('3579', '08', '3578', '39', 'прострочені інші нараховані доходи суб"єктів господарювання (за зберігання цінностей, відшкодування ', 
    469);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6016', '04', '6013', '04', 'за короткостроковими кредитами, що надані іншим банкам в іноземній валюті ', 
    517);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6016', '02', '6013', '03', 'за короткостроковими кредитами, що надані іншим банкам в національній валюті ', 
    516);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6017', '02', '6013', '02', 'за довгостроковими кредитами, що надані іншим банкам в іноземній валюті', 
    525);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6017', '01', '6013', '01', 'за довгостроковими кредитами, що надані іншим банкам в національній валюті', 
    524);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6022', '03', '6023', '03', 'за врахованими векселями', 
    527);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6022', '02', '6023', '03', 'за врахованими векселями', 
    526);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6023', '01', '6024', '03', 'за рахунками клієнтів банку за факторинговими операціями (рахунок 2030)', 
    528);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '18', '6025', '18', 'за короткостроковими кредитами в поточну діяльність, що надані суб`єктам  господарювання в іноземній', 
    530);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '19', '6025', '19', 'за довгостроковими кредитами в поточну діяльність, що надані суб`єктам  господарювання у національні', 
    531);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '20', '6025', '20', 'за довгостроковими кредитами в поточну діяльність, що надані суб`єктам  господарювання в іноземній в', 
    532);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '23', '6025', '23', 'за короткостроковими кредитами клієнтів банку за внутрішніми торговельними операціями у національній', 
    533);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '24', '6025', '24', 'за короткостроковими кредитами клієнтів банку за внутрішніми торговельними операціями в іноземній ва', 
    534);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '25', '6025', '25', 'за довгостроковими кредитами клієнтів банку за внутрішніми торговельними операціями у національній в', 
    535);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '26', '6025', '26', 'за довгостроковими кредитами клієнтів банку за внутрішніми торговельними операціями в іноземній валю', 
    536);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '27', '6025', '27', 'за короткостроковими кредитами клієнтів банку за експортно-імпортними операціями у національній валю', 
    537);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '28', '6025', '28', 'за короткостроковими кредитами клієнтів банку за експортно-імпортними операціями в іноземній валюті ', 
    538);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '29', '6025', '29', 'за довгостроковими кредитами клієнтів банку за експортно-імпортними операціями у національній валюті', 
    539);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '30', '6025', '30', 'за довгостроковими кредитами клієнтів банку за експортно-імпортними операціями в іноземній валюті (р', 
    540);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '38', '6025', '38', 'за короткостроковими кредитами під заставу грошових коштів, розміщених на депозит у національній вал', 
    541);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '39', '6025', '39', 'за короткостроковими кредитами під заставу грошових коштів, розміщених на депозит в іноземній валюті', 
    542);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '40', '6025', '40', 'за довгостроковими кредитами під заставу грошових коштів, розміщених на депозит в національній валют', 
    543);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '17', '6025', '17', 'за короткостроковими кредитами в поточну діяльність, що надані суб`єктам  господарювання у національ', 
    529);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '69', '6025', '69', 'за короткостроковими кредитами, що надані клієнтам ММСБ в рамках акційної програми в національній ва', 
    570);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '70', '6025', '70', 'за довгостроковими кредитами, що надані клієнтам ММСБ в рамках акційної програми в національній валю', 
    571);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '73', '6025', '73', 'за короткостроковими кредитами, що надані клієнтам ММБ в рамках програми НУФ з підтримки підприємств', 
    574);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '72', '6025', '72', 'за довгостроковими кредитами, що надані клієнтам ММСБ в рамках  програми "соціальне підприємництво" ', 
    573);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '71', '6025', '71', 'за короткостроковими кредитами, що надані клієнтам ММСБ в рамках  програми "соціальне підприємництво', 
    572);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '74', '6025', '74', 'за довгостроковими кредитами, що надані клієнтам ММБ в рамках програми НУФ з підтримки підприємств М', 
    575);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '41', '6025', '41', 'за довгостроковими кредитами під заставу грошових коштів, розміщених на депозит в іноземній валюті (', 
    544);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '68', '6025', '68', 'за довгостроковими кредитами, що надані клієнтам ММСБ за операціями з авалювання векселів (рахунок 2', 
    569);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '67', '6025', '67', 'за короткостроковими кредитами, що надані клієнтам ММСБ за операціями з авалювання векселів (рахунок', 
    568);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '42', '6025', '42', 'за короткостроковими кредитами під інвестиційні проекти на будівництво та освоєння землі у національ', 
    545);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '43', '6025', '43', 'за короткостроковими кредитами під інвестиційні проекти на будівництво та освоєння землі в іноземній', 
    546);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '44', '6025', '44', 'за короткостроковими кредитами під інвестиційні проекти на купівлю будівель, споруд, обладнання та з', 
    547);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '45', '6025', '45', 'за короткостроковими кредитами під інвестиційні проекти на купівлю будівель, споруд, обладнання та з', 
    548);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '46', '6025', '46', 'за довгостроковими кредитами під інвестиційні проекти на будівництво та освоєння землі у національні', 
    549);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '47', '6025', '47', 'за довгостроковими кредитами під інвестиційні проекти на будівництво та освоєння землі в іноземній в', 
    550);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '48', '6025', '48', 'за довгостроковими кредитами під інвестиційні проекти на купівлю будівель, споруд, обладнання та зем', 
    551);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '49', '6025', '49', 'за довгостроковими кредитами під інвестиційні проекти на купівлю будівель, споруд, обладнання та зем', 
    552);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '50', '6025', '50', 'за короткостроковими кредитами під інвестиційні проекти на придбання нових механічних транспортних з', 
    553);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '51', '6025', '51', 'за короткостроковими кредитами під інвестиційні проекти на придбання нових механічних транспортних з', 
    554);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '52', '6025', '52', 'за довгостроковими кредитами під інвестиційні проекти на придбання нових механічних транспортних зас', 
    555);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '53', '6025', '53', 'за довгостроковими кредитами під інвестиційні проекти на придбання нових механічних транспортних зас', 
    556);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '54', '6025', '54', 'за довгостроковими кредитами в іншу інвестиційну діяльність у національній  валюті (рахунок 2063)', 
    557);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '55', '6025', '55', 'за довгостроковими кредитами в іншу інвестиційну діяльність в іноземній валюті (рахунок 2063)', 
    558);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '56', '6025', '56', 'за короткостроковими кредитами в іншу інвестиційну діяльність у національній  валюті (рахунок 2062)', 
    559);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '59', '6025', '59', 'за короткостроковими кредитами, що надані об"єднанням співвласників багатоквартирних будинків у наці', 
    560);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '60', '6025', '60', 'за довгостроковими кредитами, що надані об"єднанням співвласників багатоквартирних будинків у націон', 
    561);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '61', '6025', '61', 'за короткостроковими кредитами, що надані об"єднанням співвласників багатоквартирних будинків у наці', 
    562);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '62', '6025', '62', 'за довгостроковими кредитами, що надані об"єднанням співвласників багатоквартирних будинків у націон', 
    563);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '63', '6025', '63', 'за короткостроковими кредитами, що надані клієнтам ММСБ на придбання транспортних засобів та обладна', 
    564);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '64', '6025', '64', 'за довгостроковими кредитами, що надані клієнтам ММСБ на придбання транспортних засобів та обладнанн', 
    565);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '65', '6025', '65', 'за короткостроковими кредитами, що надані клієнтам ММСБ на придбання транспортних засобів та обладна', 
    566);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6026', '66', '6025', '66', 'за довгостроковими кредитами, що надані клієнтам ММСБ на придбання транспортних засобів та обладнанн', 
    567);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6028', '01', '6026', '75', 'за фінансовим лізингом (орендою) (рахунок 2071)', 
    576);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6028', '02', '6026', '76', ' за будівлями і спорудами, наданими у фінансовий лізинг (оренду);', 
    577);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6028', '03', '6026', '77', 'за земельними ділянками, наданими у фінансовий лізинг (оренду)', 
    578);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '32', '6027', '50', 'за короткостроковими кредитами на купівлю об`єктів іншого призначення в іноземній валюті', 
    590);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '33', '6027', '51', 'за короткостроковими кредитами на купівлю землі в національній валюті', 
    1246);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '34', '6027', '52', 'за короткостроковими кредитами на купівлю землі в іноземній валюті', 
    1247);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '35', '6027', '53', 'за довгостроковими кредитами на будівництво об`єктів виробничого призначення в національній валюті', 
    1248);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '36', '6027', '54', 'за довгостроковими кредитами на будівництво об`єктів виробничого призначення в іноземній валюті', 
    1249);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '37', '6027', '55', 'за довгостроковими кредитами на будівництво об`єктів житлового призначення в національній валюті', 
    1250);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '38', '6027', '56', 'за довгостроковими кредитами на будівництво об`єктів житлового призначення в іноземній валюті', 
    1251);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '39', '6027', '57', 'за довгостроковими кредитами на будівництво об`єктів іншого призначення в національній валюті', 
    1252);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '40', '6027', '58', 'за довгостроковими кредитами на будівництво об`єктів іншого призначення в іноземній валюті', 
    1253);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '41', '6027', '59', 'за довгостроковими кредитами на купівлю об`єктів виробничого призначення в національній валюті', 
    1254);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '42', '6027', '60', 'за довгостроковими кредитами на купівлю об`єктів виробничого призначення в іноземній валюті', 
    1255);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '43', '6027', '61', 'за довгостроковими кредитами на купівлю об`єктів житлового призначення в національній валюті', 
    1256);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '44', '6027', '62', 'за довгостроковими кредитами на купівлю об`єктів житлового призначення в іноземній валюті', 
    1257);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '45', '6027', '63', 'за довгостроковими кредитами на купівлю об`єктів іншого призначення в національній валюті', 
    1258);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '46', '6027', '64', 'за довгостроковими кредитами на купівлю об`єктів іншого призначення в іноземній валюті', 
    1259);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '47', '6027', '65', 'за довгостроковими кредитами на купівлю землі в національній валюті', 
    1260);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '48', '6027', '66', 'за довгостроковими кредитами на купівлю землі в іноземній валюті', 
    1261);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '21', '6027', '39', 'за короткостроковими кредитами на будівництво об`єктів виробничого призначення в національній валюті', 
    579);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '22', '6027', '40', 'за короткостроковими кредитами на будівництво об`єктів виробничого призначення в іноземній валюті', 
    580);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '23', '6027', '41', 'за короткостроковими кредитами на будівництво об`єктів житлового призначення в національній валюті', 
    581);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '24', '6027', '42', 'за короткостроковими кредитами на будівництво об`єктів житлового призначення в іноземній валюті', 
    582);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '25', '6027', '43', 'за короткостроковими кредитами на будівництво об`єктів іншого призначення в національній валюті', 
    583);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '26', '6027', '44', 'за короткостроковими кредитами на будівництво об`єктів іншого призначення в іноземній валюті', 
    584);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '27', '6027', '45', 'за короткостроковими кредитами на купівлю об`єктів виробничого  призначення в національній валюті', 
    585);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '28', '6027', '46', 'за короткостроковими кредитами на купівлю об`єктів виробничого  призначення в іноземній валюті', 
    586);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '29', '6027', '47', 'за короткостроковими кредитами на купівлю об`єктів житлового призначення в національній валюті', 
    587);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '30', '6027', '48', 'за короткостроковими кредитами на купівлю об`єктів житлового призначення в іноземній валюті', 
    588);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6029', '31', '6027', '49', 'за короткостроковими кредитами на купівлю об`єктів іншого призначення в національній валюті', 
    589);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6030', '16', '6040', '32', 'за довгостроковими кредитами під заставу грошових коштів, розміщених на депозит в іноземній валюті (', 
    1267);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6030', '13', '6040', '29', 'за короткостроковими кредитами під заставу грошових коштів, розміщених на депозит в національній вал', 
    1264);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6030', '14', '6040', '30', 'за короткостроковими кредитами під заставу грошових коштів, розміщених на депозит в іноземній валюті', 
    1265);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6030', '15', '6040', '31', 'за довгостроковими кредитами під заставу грошових коштів, розміщених на депозит в національній валют', 
    1266);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6030', '04', '6040', '28', 'за  довгостроковими кредитами на придбання нових механічних транспортних засобів в національній валю', 
    1263);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6030', '17', '6040', '33', 'за довгостроковими кредитами за іншими операціями в національній валюті (рах.2103)', 
    1268);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6030', '18', '6040', '34', 'за короткостроковими кредитами під державні гарантії в рамках програми КМУ в нац.валюті (рах.2102)', 
    1269);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6030', '19', '6040', '35', 'за довгостроковими кредитами під державні гарантії  в рамках програми КМУ в нац.валюті (рах.2103)', 
    1270);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6030', '03', '6040', '27', 'за  короткостроковими кредитами на придбання нових механічних транспортних засобів в національній ва', 
    1262);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6031', '18', '6041', '14', 'за довгостроковими іншими кредитами в поточну діяльність  у національній  валюті (рахунок 2113)', 
    1281);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6031', '15', '6041', '11', 'за короткостроковими кредитами під заставу грошових коштів, розміщених на депозит в іноземній валюті', 
    1278);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6031', '16', '6041', '12', 'за довгостроковими кредитами під заставу грошових коштів, розміщених на депозит в національній валют', 
    1279);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6031', '01', '6041', '04', 'за  іншими короткостроковими кредитами в поточну діяльність в національній валюті (рах.2112)', 
    1271);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6031', '03', '6041', '05', 'за короткостроковими кредитами на придбання нових механічних транспортних засобів в національній вал', 
    1272);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6031', '10', '6041', '09', 'за довгостроковими кредитами на придбання нових механічних транспортних засобів в іноземній валюті (', 
    1276);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6031', '08', '6041', '07', 'за іншими короткостроковими кредитами в поточну діяльність в іноземній валюті (рахунок 2112)', 
    1274);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6031', '09', '6041', '08', 'за короткостроковими кредитами на придбання нових механічних транспортних засобів в іноземній валюті', 
    1275);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6031', '17', '6041', '13', 'за довгостроковими кредитами під заставу грошових коштів, розміщених на депозит в іноземній валюті (', 
    1280);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6031', '14', '6041', '10', 'за короткостроковими кредитами під заставу грошових коштів, розміщених на депозит в національній вал', 
    1277);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6031', '04', '6041', '06', 'за довгостроковими кредитами на придбання нових механічних транспортних засобів в національній валют', 
    1273);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '26', '6042', 'J4', 'за короткостроковими кредитами на купівлю об`єктів іншого призначення в іноземній валюті', 
    1301);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '34', '6042', 'K2', 'за довгостроковими кредитами на купівлю землі в іноземній валюті', 
    837);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '28', '6042', 'J6', 'за довгостроковими кредитами на будівництво об`єктів виробничого призначення в іноземній валюті', 
    1303);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '29', '6042', 'J7', 'за довгостроковими кредитами на будівництво об`єктів житлового призначення в іноземній валюті', 
    1304);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '30', '6042', 'J8', 'за довгостроковими кредитами на будівництво об`єктів іншого призначення в іноземній валюті', 
    1305);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '31', '6042', 'J9', 'за довгостроковими кредитами на купівлю об`єктів виробничого призначення в іноземній валюті', 
    1306);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '32', '6042', 'K0', 'за довгостроковими кредитами на купівлю об`єктів житлового призначення в іноземній валюті', 
    1307);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '25', '6042', 'J3', 'за короткостроковими кредитами на купівлю об`єктів житлового призначення в іноземній валюті', 
    1300);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '24', '6042', 'J2', 'за короткостроковими кредитами на купівлю об`єктів виробничого призначення в іноземній валюті', 
    1299);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '23', '6042', 'J1', 'за короткостроковими кредитами на будівництво об`єктів іншого призначення в іноземній валюті', 
    1298);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '22', '6042', 'J0', 'за короткостроковими кредитами на будівництво об`єктів житлового призначення в іноземній валюті', 
    1297);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '21', '6042', 'I9', 'за короткостроковими кредитами на будівництво об`єктів виробничого призначення в іноземній валюті', 
    1296);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '14', '6042', 'I8', 'за довгостроковими кредитами на купівлю землі в національній валюті', 
    1295);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '13', '6042', 'I7', 'за довгостроковими кредитами на купівлю об`єктів іншого призначення  в національній валюті', 
    1294);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '12', '6042', 'I6', 'за довгостроковими кредитами на купівлю об`єктів житлового призначення  в національній валюті', 
    1293);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '11', '6042', 'I5', 'за довгостроковими кредитами на купівлю об`єктів виробничого призначення  в національній валюті', 
    1292);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '10', '6042', 'I4', 'за довгостроковими кредитами на будівництво об`єктів іншого призначення  в національній валюті', 
    1291);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '09', '6042', 'I3', 'за довгостроковими кредитами на будівництво об`єктів житлового  призначення  в національній валюті', 
    1290);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '08', '6042', 'I2', 'за довгостроковими кредитами на будівництво об`єктів виробничого призначення  в національній валюті', 
    1289);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '07', '6042', 'I1', 'за короткостроковими кредитами на купівлю землі в національній валюті', 
    1288);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '06', '6042', 'I0', 'за короткостроковими кредитами на купівлю об`єктів іншого призначення в національній валюті', 
    1287);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '05', '6042', 'H9', 'за короткостроковими кредитами на купівлю об`єктів житлового призначення в національній валюті', 
    1286);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '04', '6042', 'H8', 'за короткостроковими кредитами на купівлю об`єктів іншого виробничого призначення в національній вал', 
    1285);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '03', '6042', 'H7', 'за короткостроковими кредитами на будівництво об`єктів іншого призначення в національній валюті', 
    1284);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '02', '6042', 'H6', 'за короткостроковими кредитами на будівництво об`єктів житлового призначення в національній валюті', 
    1283);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '01', '6042', 'H5', 'за короткостроковими кредитами на будівництво об`єктів виробничого призначення в національній валюті', 
    1282);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '33', '6042', 'K1', 'за довгостроковими кредитами на купівлю об`єктів іншого призначення в іноземній валюті', 
    836);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6032', '27', '6042', 'J5', 'за короткостроковими кредитами на купівлю землі в іноземній валюті', 
    1302);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '23', '6043', '35', 'за короткостроковими кредитами на будівництво об`єктів іншого призначення в іноземній валюті', 
    854);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '34', '6043', '46', 'за довгостроковими кредитами на купівлю землі в іноземній валюті', 
    865);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '25', '6043', '37', 'за короткостроковими кредитами на купівлю об`єктів житлового призначення в іноземній валюті', 
    856);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '26', '6043', '38', 'за короткостроковими кредитами на купівлю об`єктів іншого призначення в іноземній валюті', 
    857);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '27', '6043', '39', 'за короткостроковими кредитами на купівлю землі в іноземній валюті', 
    858);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '28', '6043', '40', 'за довгостроковими кредитами на будівництво об`єктів виробничого призначення в іноземній валюті', 
    859);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '29', '6043', '41', 'за довгостроковими кредитами на будівництво об`єктів житлового призначення в іноземній валюті', 
    860);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '30', '6043', '42', 'за довгостроковими кредитами на будівництво об`єктів іншого призначення в іноземній валюті', 
    861);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '01', '6043', '19', 'за короткостроковими кредитами на будівництво об`єктів виробничого призначення в національній валюті', 
    838);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '02', '6043', '20', 'за короткостроковими кредитами на будівництво об`єктів житлового призначення в національній валюті', 
    839);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '03', '6043', '21', 'за короткостроковими кредитами на будівництво об`єктів іншого призначення в національній валюті', 
    840);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '04', '6043', '22', 'за короткостроковими кредитами на купівлю об`єктів виробничого  призначення в національній валюті', 
    841);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '05', '6043', '23', 'за короткостроковими кредитами на купівлю об`єктів житлового призначення в національній валюті', 
    842);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '06', '6043', '24', 'за короткостроковими кредитами на купівлю об`єктів іншого призначення в національній валюті', 
    843);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '07', '6043', '25', 'за короткостроковими кредитами на купівлю землі призначення в національній валюті', 
    844);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '08', '6043', '26', 'за довгостроковими кредитами на будівництво об`єктів виробничого призначення в національній валюті', 
    845);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '09', '6043', '27', 'за довгостроковими кредитами на будівництво об`єктів житлового призначення в національній валюті', 
    846);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '10', '6043', '28', 'за довгостроковими кредитами на будівництво об`єктів іншого призначення в національній валюті', 
    847);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '11', '6043', '29', 'за довгостроковими кредитами на купівлю об`єктів виробничого призначення в національній валюті', 
    848);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '12', '6043', '30', 'за довгостроковими кредитами на купівлю об`єктів житлового призначення в національній валюті', 
    849);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '13', '6043', '31', 'за довгостроковими кредитами на купівлю об`єктів іншого призначення в національній валюті', 
    850);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '14', '6043', '32', 'за довгостроковими кредитами на купівлю землі в національній валюті', 
    851);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '21', '6043', '33', 'за короткостроковими кредитами на будівництво об`єктів виробничого призначення в іноземній валюті', 
    852);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '22', '6043', '34', 'за короткостроковими кредитами на будівництво об`єктів житлового призначення в іноземній валюті', 
    853);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '31', '6043', '43', 'за довгостроковими кредитами на купівлю об`єктів виробничого призначення в іноземній валюті', 
    862);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '32', '6043', '44', 'за довгостроковими кредитами на купівлю об`єктів житлового призначення в іноземній валюті', 
    863);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '33', '6043', '45', 'за довгостроковими кредитами на купівлю об`єктів іншого призначення в іноземній валюті', 
    864);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6033', '24', '6043', '36', 'за короткостроковими кредитами на купівлю об`єктів виробничого  призначення в іноземній валюті', 
    855);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6040', '12', '6050', '12', 'за банківським продуктом "Національна картка" в національній валюті в системі  WAY4', 
    866);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6040', '13', '6050', '13', 'за банківським продуктом "Соціальний служби зайнятості" в національній валюті в системі WAY4', 
    867);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6040', '14', '6050', '14', 'за банківським продуктом `Зарплатний` для працівників суб`єктів господарювання в національній валюті', 
    868);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6040', '15', '6050', '15', 'за банківським продуктом "Економний" в національній валюті в системі WAY4', 
    869);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6040', '16', '6050', '16', 'за банківським продуктом "Стандартний" в національній валюті в системі WAY4', 
    870);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6040', '17', '6050', '17', 'за банківським продуктом "Зарплатний" для працівників банку в національній валюті в системі WAY4', 
    871);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6040', '18', '6050', '18', 'за банківським продуктом "Преміум" в національній валюті в системі WAY4', 
    872);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6040', '19', '6050', '19', 'за банківським продуктом "Пенсійний" в національній валюті в системі WAY4', 
    873);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6040', '20', '6050', '20', ' за банківським продуктом "Арсенал"  в національній валюті в системі WAY4', 
    874);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6040', '21', '6050', '21', 'за банківським продуктом " Зарплатний бюджетний " в національній валюті в системі WAY4;', 
    875);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6040', '22', '6050', '22', 'за банківським продуктом " Зарплатний студентський" в національній валюті в системі WAY4;', 
    876);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6040', '23', '6050', '23', 'за банківським продуктом " Соціальний мінсоцполітики " в національній валюті в системі WAY4;', 
    877);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6040', '24', '6050', '24', 'за банківським продуктом  "Віртуальна картка " в національній валюті в системі WAY4', 
    878);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6040', '25', '6050', '25', 'за рахунками  для окремих категорій клієнтів за банківським продуктом "Стандартний " в системі WAY4 ', 
    879);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6040', '26', '6050', '26', 'за рахунками  для окремих категорій клієнтів за банківським продуктом "Економний " в системі WAY4 у ', 
    880);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'D9', '6052', 'D9', 'за довгостроковими кредитами за банківським продуктом "Економний"  в національній валюті в системі W', 
    1051);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'E0', '6052', 'E0', 'за короткостроковими кредитами за банківським продуктом "Стандартний" в національній валюті в систем', 
    1052);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'E1', '6052', 'E1', 'за довгостроковими кредитами за банківським продуктом "Стандартний" в національній валюті в системі ', 
    1053);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'E2', '6052', 'E2', 'за короткостроковими кредитами за банківським продуктом `Зарплатний` для працівників суб`єктів госпо', 
    1054);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'E3', '6052', 'E3', 'за короткостроковими кредитами за банківським продуктом "Зарплатний" для працівників банку в націона', 
    1055);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'E4', '6052', 'E4', 'за довгостроковими кредитами за банківським продуктом "Зарплатний" для працівників банку в національ', 
    1056);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'E5', '6052', 'E5', 'за короткостроковими кредитами за банківським продуктом "Преміум" в національній валюті в системі WA', 
    1057);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'E6', '6052', 'E6', 'за довгостроковими кредитами за банківським продуктом "Преміум" в національній валюті в системі WAY4', 
    1058);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'E7', '6052', 'E7', 'за короткостроковими кредитами за банківським продуктом "Пенсійний" в національній валюті в системі ', 
    1059);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'E8', '6052', 'E8', 'за довгостроковими кредитами за банківським продуктом "Пенсійний" в національній валюті в системі WA', 
    1060);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'E9', '6052', 'E9', 'за короткостроковими  кредитами за банківським продуктом "Арсенал"  в національній валюті в системі ', 
    1061);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'F0', '6052', 'F0', ' за довгостроковими кредитами за банківським продуктом "Арсенал"  в національній валюті в системі WA', 
    1062);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'F1', '6052', 'F1', 'за короткостроковими кредитами за банківським продуктом " Зарплатний бюджетний "  в національній вал', 
    1063);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'F2', '6052', 'F2', 'за довгостроковими кредитами за банківським продуктом " Зарплатний бюджетний "  в національній валют', 
    1064);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'F4', '6052', 'F4', 'за довгостроковими кредитами за банківським продуктом " Зарплатний студентський " в національній вал', 
    1065);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'F6', '6052', 'F6', 'за короткостроковими споживчими кредитами за стандартизованими умовами "Споживче кредитування, забез', 
    1066);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'F8', '6052', 'F8', 'за довгостроковими кредитами на споживчі потреби під заставу казначейських зобовязань в національній', 
    1067);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'F9', '6052', 'F9', 'за короткостроковими споживчими кредитами на придбання енергозберігаючого обладнання та матеріалів у', 
    1068);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'G0', '6052', 'G0', 'за довгостроковими споживчими кредитами на придбання енергозберігаючого обладнання та матеріалів у н', 
    1069);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'G1', '6052', 'G1', 'за короткостроковими споживчими кредитами на придбання енергозберігаючого обладнання та матеріалів в', 
    1070);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'G2', '6052', 'G2', 'за довгостроковими споживчими кредитами на придбання енергозберігаючого обладнання та матеріалів в р', 
    1071);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'G3', '6052', 'G3', 'за короткостроковими споживчими кредитами на придбання енергозберігаючого обладнання та матеріалів в', 
    1072);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'G4', '6052', 'G4', 'за довгостроковими споживчими кредитами на придбання енергозберігаючого обладнання та матеріалів в р', 
    1073);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'G5', '6052', 'G5', 'за короткостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "С', 
    1074);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'G6', '6052', 'G6', 'за довгостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Ста', 
    1075);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'G7', '6052', 'G7', 'за короткостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Е', 
    1076);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'G8', '6052', 'G8', 'за довгостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Еко', 
    1077);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'G9', '6052', 'G9', ' за короткостроковими споживчими кредитами на придбання електромобілів', 
    1078);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '20', '6052', '20', 'за довгостроковими кредитами на придбання енергозберігаючих товарів через торговельну мережу в націо', 
    1087);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '26', '6052', '26', 'за довгостроковими кредитами на споживчі потреби тільки під поруку  в національній валюті (без умови', 
    1088);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '32', '6052', '32', 'за короткостроковими кредитами під платіжні картки MasterCard по програмі "Арсенал" в національній в', 
    1089);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '33', '6052', '33', 'за довгостроковими кредитами під платіжні картки MasterCard по програмі "Арсенал" в національній вал', 
    1090);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '44', '6052', '44', 'за короткостроковими кредитами на споживчі потреби під заставу в національній валюті', 
    1091);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '45', '6052', '45', 'за короткостроковими кредитами на споживчі потреби під заставу в іноземній валюті', 
    1092);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '50', '6052', '50', 'за довгостроковими кредитами на купівлю автомобілів в національній валюті', 
    1093);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '51', '6052', '51', 'за довгостроковими кредитами на купівлю автомобілів в іноземній валюті', 
    1094);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '52', '6052', '52', 'за довгостроковими кредитами на придбання товарів тривалого користування в національній валюті', 
    1095);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '67', '6052', '67', 'за довгостроковими споживчими кредитами за стандартизованими умовами "Споживче кредитування, забезпе', 
    1104);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '72', '6052', '72', 'за довгостроковими кредитами на споживчі потреби в національній валюті', 
    1105);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '73', '6052', '73', 'за довгостроковими кредитами на споживчі потреби в іноземній валюті', 
    1106);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '91', '6052', '91', 'за короткостроковими кредитами на сплату страхових платежів за пакетом "повне КАСКО" за банківським ', 
    1107);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '97', '6052', '97', 'за короткостроковими кредитами за стандартизованим банківським продуктом на придбання нового транспо', 
    1108);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '99', '6052', '99', 'за довгостроковими кредитами за стандартизованим банківським продуктом на придбання нового транспорт', 
    1109);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'A1', '6052', 'A1', 'за короткостроковими кредитами на будівництво та ремонт житла та будівель за нестандартизованими умо', 
    882);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'A2', '6052', 'A2', 'за довгостроковими кредитами на будівництво та ремонт житла та будівель за нестандартизованими умова', 
    883);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'A3', '6052', 'A3', 'за довгостроковими кредитами на будівництво та ремонт житла та будівель за нестандартизованими умова', 
    884);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'A4', '6052', 'A4', 'за довгостроковими кредитами на придбання житла та будівель за нестандартизованими умовами та продук', 
    885);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'A5', '6052', 'A5', 'за довгостроковими кредитами на придбання житла та будівель за нестандартизованими умовами та продук', 
    886);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'A6', '6052', 'A6', 'за довгостроковими кредитами на придбання житла на вторинному ринку нерухомості за нестандартизовани', 
    887);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'A7', '6052', 'A7', 'за довгостроковими кредитами на придбання житла на вторинному ринку нерухомості за нестандартизовани', 
    888);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'A8', '6052', 'A8', 'за короткостроковими кредитами під заставу майнових прав на отримання грошових коштів, розміщених на', 
    889);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'A9', '6052', 'A9', 'за короткостроковими кредитами під заставу майнових прав на отримання грошових коштів, розміщених на', 
    890);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'B0', '6052', 'B0', 'за довгостроковими кредитами під заставу майнових прав на отримання грошових коштів, розміщених на в', 
    891);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'B1', '6052', 'B1', 'за довгостроковими кредитами під заставу майнових прав на отримання грошових коштів, розміщених на в', 
    892);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'B2', '6052', 'B2', 'за короткостроковими кредитами на придбання транспортних засобів, що перебували у користуванні у нац', 
    893);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'B3', '6052', 'B3', 'за короткостроковими кредитами на придбання транспортних засобів, що перебували у користуванні в іно', 
    894);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'H0', '6052', 'H0', ' за довгостроковими споживчими кредитами на придбання електромобілів', 
    1079);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'H1', '6052', 'H1', ' за короткостроковими споживчими кредитами на придбання супутніх товарів до електромобілів', 
    1080);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'H2', '6052', 'H2', ' за довгостроковими споживчими кредитами на придбання супутніх товарів до  електромобілів', 
    1081);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'H3', '6052', 'H3', 'за короткостроковими кредитами за банківським продуктом "Кеш кредити" у національній валюті', 
    1082);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'H4', '6052', 'H4', 'за довгостроковими кредитами за банківським продуктом "Кеш кредити" у національній валюті', 
    1083);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '01', '6052', '09', 'за короткостроковими кредитами на споживчі потреби тільки під поруку  в національній валюті (без умо', 
    1084);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '08', '6052', '08', 'за короткостроковими кредитами на споживчі потреби під заклад виробів та лому із дорогоцінних металі', 
    1085);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '19', '6052', '19', 'за короткостроковими кредитами на придбання енергозберігаючих товарів через торговельну мережу в нац', 
    1086);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'B4', '6052', 'B4', 'за довгостроковими кредитами на придбання транспортних засобів, що перебували у користуванні у націо', 
    895);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'B5', '6052', 'B5', 'за довгостроковими кредитами на придбання транспортних засобів, що перебували у користуванні в інозе', 
    896);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'C2', '6052', 'C2', 'за довгостроковими кредитами під платіжні картки MasterCard  в національній валюті', 
    897);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'C3', '6052', 'C3', 'за довгостроковими кредитами під платіжні картки  Visa в національній валюті', 
    898);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'C6', '6052', 'C6', 'за довгостроковими кредитами  під заставу майнових прав на отримання банківських металів, розміщених', 
    899);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'A0', '6052', 'A0', 'за короткостроковими кредитами на будівництво та ремонт житла та будівель за нестандартизованими умо', 
    881);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'C8', '6052', 'C8', 'за довгостроковими кредитами за стандартизованим банківським продуктом на придбання нового транспорт', 
    1041);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'C9', '6052', 'C9', 'за короткостроковими кредитами на споживчі потреби під поруку (для працівників підприємств, які мают', 
    1042);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'D0', '6052', 'D0', 'за довгостроковими кредитами на споживчі потреби під поруку (для працівників підприємств, які мають ', 
    1043);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'D1', '6052', 'D1', 'за довгостроковими кредитами на сплату страхових платежів за пакетом "повне КАСКО" за банківським пр', 
    1044);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'D2', '6052', 'D2', 'за короткостроковими кредитами за стандартизованим банківським продуктом на придбання нового транспо', 
    1045);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'D3', '6052', 'D3', 'за довгостроковими кредитами за стандартизованим банківським продуктом на придбання нового транспорт', 
    1046);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'D4', '6052', 'D4', 'за короткостроковими кредитами за стандартизованим банківським продуктом на придбання нового транспо', 
    1047);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'D5', '6052', 'D5', 'за довгостроковими кредитами за стандартизованим банківським продуктом на придбання нового транспорт', 
    1048);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'D6', '6052', 'D6', 'за довгостроковими кредитами за банківським продуктом `Зарплатний` для працівників суб`єктів господа', 
    1049);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', 'D8', '6052', 'D8', 'за короткостроковими кредитами за банківським продуктом "Економний"  в національній валюті в системі', 
    1050);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '53', '6052', '53', 'за довгостроковими кредитами на придбання товарів тривалого користування в іноземній валюті', 
    1096);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '54', '6052', '54', 'за короткостроковими кредитами на придбання нового транспортного засобу  в національній валюті', 
    1097);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '55', '6052', '55', 'за короткостроковими кредитами на придбання нового транспортного засобу  в іноземній валюті', 
    1098);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '56', '6052', '56', 'за довгостроковими кредитами на придбання нового транспортного засобу  в національній валюті', 
    1099);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '57', '6052', '57', 'за довгостроковими кредитами на придбання нового транспортного засобу  в іноземній валюті', 
    1100);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '58', '6052', '58', 'за короткостроковими кредитами під платіжні картки МПС MasterCard в національній валюті, крім банків', 
    1101);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '60', '6052', '60', 'за короткостроковими кредитами під платіжні картки МПС VISA в національній валюті, крім банківських ', 
    1102);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6042', '66', '6052', '66', 'за довгостроковими споживчими кредитами за стандартизованими умовами "Споживче кредитування, забезпе', 
    1103);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '35', '6055', '35', 'за довгостроковими кредитами, які надані фізичним особам на купівлю, будівництво, реконструкцію іншо', 
    1123);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '38', '6055', '38', 'за довгостроковими кредитами молодим сім`ям та одиноким молодим громадянам на придбання житла на вто', 
    1124);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '16', '6055', '16', 'за довгостроковими кредитами за стандартизованим продуктом на купівлю земельної ділянки в національн', 
    1110);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '17', '6055', '17', 'за довгостроковими кредитами за стандартизованим продуктом на купівлю земельної ділянки в іноземній ', 
    1111);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '20', '6055', '20', 'за довгостроковими кредитами, які надані фізичним особам на придбання житла на вторинному ринку неру', 
    1112);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '21', '6055', '21', 'за довгостроковими кредитами, які надані фізичним особам на придбання житла на вторинному ринку неру', 
    1113);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '24', '6055', '24', 'за довгостроковими кредитами, які надані фізичним особам на будівництво та реконструкцію житла в нац', 
    1114);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '25', '6055', '25', 'за довгостроковими кредитами, які надані фізичним особам на будівництво та реконструкцію житла в іно', 
    1115);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '28', '6055', '28', 'за довгостроковими кредитами, які надані фізичним особам на купівлю, будівництво та реконструкцію ін', 
    1116);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '29', '6055', '29', 'за довгостроковими кредитами, які надані фізичним особам на купівлю, будівництво та реконструкцію ін', 
    1117);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '30', '6055', '30', 'за довгостроковими кредитами, які надані фізичним особам на придбання житла на первинному ринку неру', 
    1118);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '31', '6055', '31', 'за довгостроковими кредитами, які надані фізичним особам на придбання житла на первинному ринку неру', 
    1119);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '32', '6055', '32', 'за довгостроковими кредитами, які надані фізичним особам на придбання житла на вторинному ринку неру', 
    1120);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '33', '6055', '33', 'за довгостроковими кредитами, які надані фізичним особам на придбання житла на вторинному ринку неру', 
    1121);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '34', '6055', '34', 'за довгостроковими кредитами, які надані фізичним особам на купівлю, будівництво, реконструкцію іншо', 
    1122);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '39', '6055', '39', 'за довгостроковими кредитами молодим сім`ям та одиноким молодим громадянам на придбання житла на вто', 
    1125);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '47', '6055', '47', 'за довгостроковими кредитами на придбання житла на вторинному ринку нерухомості за нестандартизовани', 
    1126);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '48', '6055', '48', 'за довгостроковими кредитами на придбання житла на вторинному ринку нерухомості за нестандартизовани', 
    1127);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '55', '6055', '55', 'за довгостроковими кредитами за програмою "Доступне житло" в національній валюті', 
    1128);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '56', '6055', '56', 'за довгостроковими кредитами на придбання житла на вторинному ринку нерухомості за будівельними об`є', 
    1129);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '58', '6055', '58', 'за довгостроковими кредитами на придбання житла на первинному ринку нерухомості за будівельними об`є', 
    1130);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '60', '6055', '60', 'за довгостроковими кредитами на придбання доступного житла в рамках програми КМУ в національній валю', 
    1131);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '62', '6055', '62', 'за довгостроковими кредитами на придбання житла на первинному ринку нерухомості за будівельними об`є', 
    1132);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '63', '6055', '63', 'за довгостроковими кредитами на придбання житла на первинному ринку нерухомості, за будівельними  об', 
    1133);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '64', '6055', '64', 'за довгостроковими кредитами на придбання житла на вторинному ринку нерухомості, за будівельними  об', 
    1134);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '66', '6055', '66', 'за довгостроковими кредитами на придбання житла за банківським продуктом "Кредит "Вторинний ринок та', 
    1135);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6046', '67', '6055', '67', 'за довгостроковими кредитами на придбання житла за банківським продуктом "Споживчий кредит під іпоте', 
    1136);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6050', '02', '6121', '02', 'за боргові цінні папери органів державної влади та місцевого самоврядування (рахунок 1412)', 
    1137);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6050', '04', '6121', '04', 'за боргові цінні папери нефінансових підприємств, що рефінансуються Національним банком України, у п', 
    1138);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6050', '05', '6121', '05', 'за боргові цінні папери , випущені банками та небанківськими фінансовими установами, що рефінансують', 
    1139);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6050', '06', '6121', '06', 'за облігаціями внутрішньої державної позики у національній валюті (рахунок 1410)', 
    1140);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6050', '07', '6121', '07', 'за облігаціями внутрішньої державної позики в іноземній валюті (рахунок 1410)', 
    1141);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6051', '01', '6122', '01', 'за облігації внутрішньої державної позики (рахунок 1420)', 
    1142);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6051', '02', '6122', '02', 'за боргові цінні папери органів державної влади та місцевого самоврядування, що рефінансуються Націо', 
    1143);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6051', '04', '6122', '04', 'за боргові цінні папери нефінансових підприємств, що рефінансуються Національним банком України, у п', 
    1144);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6051', '05', '6122', '05', 'за борговими цінними паперами банків та небанківських фінансових установ, що рефінансуються Націонал', 
    1145);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6052', '03', '6124', '03', 'за борговими цінними паперами органів державної влади (рахунок 3110)', 
    1146);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6052', '04', '6124', '04', 'за борговими цінними паперами органів місцевого самоврядування (рахунок 3111)', 
    1147);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6052', '05', '6124', '05', 'за борговими цінними паперами, які випущені банками', 
    1148);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6052', '06', '6124', '06', 'за борговими цінними паперами, які випущені небанківськими фінансовими установами', 
    1149);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6052', '07', '6124', '07', 'за борговими цінними паперами, які випущені нефінансовими підприємствами', 
    1150);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6053', '03', '6125', '03', 'за борговими цінними паперами органів державної влади', 
    1151);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6053', '06', '6125', '06', 'за борговими цінними паперами, які випущені небанківськими фінансовими установами', 
    1154);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6053', '07', '6125', '07', 'за борговими цінними паперами, які випущені нефінансовими підприємствами', 
    1155);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6053', '05', '6125', '05', 'за борговими цінними паперами, які випущені банками', 
    1153);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6053', '04', '6125', '04', 'за борговими цінними паперами органів місцевого самоврядування', 
    1152);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6054', '01', '6127', '01', 'за депозитними сертифікатами, емітованими НБУ', 
    1156);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6055', '01', '6128', '01', 'за депозитними сертифікатами, емітованими НБУ', 
    1157);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6056', '01', '6120', '01', 'за облігаціями внутрішньої державної позики (рахунок 1400)', 
    1158);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6056', '02', '6120', '02', 'за борговими цінними паперами органів державної влади та місцевого самоврядування (рахунок 1402)', 
    1159);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6057', '06', '6126', '06', 'за борговими цінними паперами, випущеними банками (рахунок 3012)', 
    1162);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6057', '07', '6126', '07', 'за борговими цінними паперами, випущеними небанківськими фінансовими установами (рахунок 3013)', 
    1163);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6057', '08', '6126', '08', 'за борговими цінними паперами, випущеними  нефінансовими підприємствами (рахунок 3014)', 
    1164);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6057', '04', '6126', '04', 'за борговими цінними паперами органів державної влади  (рахунок 3010)', 
    1160);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6057', '05', '6126', '05', 'за борговими цінними паперами органів місцевого самоврядування  (рахунок 3011)', 
    1161);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6080', '01', '6130', '01', 'за коштами, переданими в централізований фонд кредитних ресурсів Правління', 
    1165);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6080', '02', '6130', '02', 'за міжрегіональні розрахунки з передачі коштів за домовленістю сторін', 
    1166);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6080', '03', '6130', '03', 'за передані ресурси, розміщені в МБК (централізована заборгованість)', 
    1167);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6080', '05', '6130', '05', 'за коштами, розміщеними в цільові програми', 
    1168);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6080', '06', '6130', '06', 'за коштами, переданими в централізований фонд кредитних ресурсів регіонального управління', 
    1169);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6080', '07', '6130', '07', 'за коштами по інших розрахунках', 
    1170);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6080', '10', '6130', '10', 'за міжрегіональні розрахунки з передачі коштів на пільгових умовах', 
    1171);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6080', '11', '6130', '11', 'за залишки по внутрішніх рахунках', 
    1172);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6080', '12', '6130', '12', 'за міжрегіональні розрахунки з передачі коштів в іноземній валюті за домовленістю сторін', 
    1173);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6099', '01', '6141', '01', 'за коштами банків', 
    1174);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6099', '03', '6141', '03', 'інші процентні доходи', 
    1175);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6099', '06', '6141', '06', 'за коштами суб`єктів господарювання', 
    1176);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6099', '07', '6141', '07', 'за коштами органів державної влади', 
    1177);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6099', '08', '6141', '08', 'за коштами фізичних осіб', 
    1178);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6100', '09', '6500', '09', 'за надання дублікатів виписок та авізо по телексу, S.W.I.F.T банкам-резидентам', 
    1186);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6100', '08', '6500', '08', 'за переоформлення документів у зв`язку із змінами реквізитів (внесенням змін до юридичної справи) ба', 
    1185);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6100', '06', '6500', '06', 'за надання дублікатів виписок та авізо по телексу, S.W.I.F.T банкам-нерезидентам', 
    1183);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6100', '07', '6500', '07', 'за блокування рахунку за дорученням банків-нерезидентів', 
    1184);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6100', '10', '6500', '10', 'за операціями купівлі-продажу готівкової іноземної валюти', 
    1187);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6100', '05', '6500', '05', 'за переоформлення документів у зв`язку із змінами реквізитів (внесення змін до юридичної справи) бан', 
    1182);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6100', '04', '6500', '04', 'за блокування рахунку за дорученням банків-резидентів', 
    1181);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6100', '02', '6500', '02', 'за видачу (передавання) готівкової національної валюти іншим банкам', 
    1180);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6100', '01', '6500', '01', 'за розрахунково-касове обслуговування банків', 
    1179);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6101', '01', '6501', '01', 'за кредитне обслуговування банків', 
    1188);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6103', '01', '6503', '01', 'за операціями з цінними паперами для банків', 
    1189);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6104', '01', '6504', '01', 'за операціями купівлі-продажу безготівкової іноземної валюти', 
    1190);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6108', '03', '6508', '03', 'інші доходи', 
    1192);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6108', '01', '6508', '01', 'за наданими гарантіями', 
    1191);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6109', '04', '6509', '04', 'за операціями з дорожніми чеками', 
    1195);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6109', '01', '6509', '01', 'інші комісійні доходи', 
    1193);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6109', '06', '6509', '06', 'за послуги служби інкасації та перевезення цінностей, що надаються банкам', 
    1197);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6109', '03', '6509', '03', 'за операціями з обслуговування платіжних карток НСМЕП', 
    1194);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6109', '05', '6509', '05', 'за транзитні перекази на користь інших банків', 
    1196);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'B4', '6510', 'B4', 'за операціями фізичних осіб по системі "RIA"', 
    1208);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'B5', '6510', 'B5', 'за обслуговування клієнтів - фізичних осіб через системи дистанційного обслуговування', 
    1209);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'B7', '6510', 'B7', 'за операціями фізичних осіб по системі "MoneyGram"', 
    1210);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'B9', '6510', 'B9', ' за поповнення та видачу готівки через АТМ в системі WAY4 за операціями з БПК інших банків (від банк', 
    1211);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '65', '6510', '65', 'за виконання протягом року операцій за розрахунками по БПК МПС  VISA фізичних осіб', 
    947);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '66', '6510', '66', 'за  виконання протягом року операцій за розрахунками по БПК МПС Visa суб`єктів господарювання', 
    948);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '97', '6510', '97', 'за відкриття та ведення поточних рахунків у банківських металах промислових споживачів', 
    970);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '98', '6510', '98', 'за відкриття та ведення поточних рахунків у банківських металах фізичних осіб', 
    971);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '99', '6510', '99', 'за обслуговування енергопостачальних компаній та оптового постачальника електроенергії', 
    972);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'F8', '6510', 'F8', 'за прийняті від населення платежі за централізоване опалення або гаряче водопостачання на користь су', 
    900);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'F9', '6510', 'F9', 'за прийняті від населення платежі за постачання холодної води та водовідведення на користь суб''єктів', 
    901);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'G0', '6510', 'G0', 'за прийняті від населення платежі за телекомунікаційні послуги/послуги зв''язку на користь суб''єктів ', 
    902);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'G1', '6510', 'G1', 'за прийняті від населення платежі за житлово-комунальні, телекомунікаційні послуги/послуги зв''язку н', 
    903);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'G2', '6510', 'G2', 'за операціями з БПК, що отримані від ТСП за банківським продуктом "Все включено"', 
    904);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'G3', '6510', 'G3', 'за операціями здійсненими з використанням платіжних карток в мережі Інтернет за послугою інтернет-ек', 
    905);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'G4', '6510', 'G4', 'за прийняті від населення платежі за "єдиною квитанцією" за житлово-комунальні послуги на користь су', 
    906);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'G5', '6510', 'G5', 'за операціями за банківським продуктом " Мій кредит "в системі WAY4', 
    907);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'G6', '6510', 'G6', 'за операціями  розповсюдження  наперед оплачених карток "Prepaid" суб"єктами господарювання', 
    908);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '01', '6510', '01', 'за відкриття, ведення та закриття рахунків суб`єктів господарювання, крім корпоративних клієнтів', 
    909);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '06', '6510', '06', 'за обробку ,документів суб`єктів господарювання (в т.ч. телекс, телефакс),  крім корпоративних клієн', 
    910);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '09', '6510', '09', 'за переказ вкладів фізичних осіб', 
    911);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '10', '6510', '10', 'за безготівкові списання з рахунків фізичних осіб (за товари, комунальні послуги тощо)', 
    912);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '12', '6510', '12', 'за виконання операцій за приватизаційними рахунками фізичних осіб', 
    913);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '17', '6510', '17', ' за зарахування інших доходів населенню (за здану сільгосппродукцію; виплату           дивідендів; с', 
    914);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '19', '6510', '19', 'за поповнення картрахунку та видачу готівки по БПК ', 
    915);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '20', '6510', '20', 'за операціями по БПК від торгових та сервісних точок', 
    916);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '22', '6510', '22', 'за переказ готівки фізичних осіб', 
    917);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'C5', '6510', 'C5', 'за операціями фізичних осіб по системі "ХАЗРИ"', 
    1215);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'C6', '6510', 'C6', 'за операціями фізичних осіб по системі "ИНТЕЛЭКСПРЕСС"', 
    1216);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'C7', '6510', 'C7', 'за операціями з банківським продуктом `Зарплатний` для працівників суб`єктів господарювання в систем', 
    1217);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'C8', '6510', 'C8', 'за операціями за банківським продуктом  "Економний" в системі WAY4', 
    1218);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'C9', '6510', 'C9', 'за операціями за банківським продуктом "Стандартний" в системі WAY4', 
    1219);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'D0', '6510', 'D0', 'за операціями за банківським продуктом "Зарплатний" для працівників банку в системі WAY4', 
    1220);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'D1', '6510', 'D1', 'за операціями за банківським продуктом "Преміум" в системі WAY4', 
    1221);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'D2', '6510', 'D2', 'за операціями за банківським продуктом "Пенсійний"  в системі WAY4', 
    1222);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'D3', '6510', 'D3', 'за операціями за банківським продуктом "Арсенал"  в системі WAY4', 
    1223);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'D4', '6510', 'D4', 'за операціями за банківським продуктом " Зарплатний бюджетний " в системі WAY4;', 
    1224);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'D5', '6510', 'D5', 'за операціями за банківським продуктом " Зарплатний студентський "  в системі WAY4;', 
    1225);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'D6', '6510', 'D6', 'за операціями за банківським продуктом " Соціальний мінсоцполітики "  в системі WAY4.', 
    1226);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'D7', '6510', 'D7', 'за операціями за банківським продуктом  "Віртуальна картка " в системі WAY4', 
    1227);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'D8', '6510', 'D8', 'доходи, отримані  по СТП `Швидка копійка` від суб`єктів господарювання', 
    1228);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'D9', '6510', 'D9', ' за банківським продуктом ` Корпоративні платіжні картки клієнтів-суб`єктів господарської діяльності', 
    1229);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'E0', '6510', 'E0', ' за банківським продуктом " Корпоративні платіжні картки клієнтів-фізичних осіб-підприємців" в систе', 
    1230);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'E1', '6510', 'E1', 'за банківським продуктом " Корпоративні платіжні картки клієнтів-небанківських фінансових установ" в', 
    1231);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'E3', '6510', 'E3', 'від обслуговування підприємств, що підпорядковані Державній адміністрації залізничного транспорту та', 
    1232);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'E4', '6510', 'E4', 'за операціями фізичних осіб по системі "Money Send"', 
    1233);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'E6', '6510', 'E6', 'за операціями з БПК для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі ', 
    1234);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'E7', '6510', 'E7', 'за операціями з БПК для окремих категорій клієнтів за банківським продуктом "Економний " в системі W', 
    1235);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'E8', '6510', 'E8', 'за надання виписок в електронному вигляді шляхом SMS-повідомлень суб"єктам господарювання', 
    1236);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'E9', '6510', 'E9', 'за операціями фізичних осіб за наперед оплачені картки', 
    1237);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'F0', '6510', 'F0', 'за відкриття поточних рахунків фізичних осіб', 
    1238);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'F1', '6510', 'F1', 'за обслуговування неактивних поточних рахунків фізичних осіб', 
    1239);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'F2', '6510', 'F2', 'за зарахування коштів, отриманих  від  суб"єктів господарювання на поточний рахунок акредитованих но', 
    1240);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'F3', '6510', 'F3', 'за зарахування коштів, отриманих від фізичних осіб на поточний рахунок акредитованих нотаріусів у на', 
    1241);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'F4', '6510', 'F4', 'за проведеними операціями через  WEB-банкінг "Ощад24/7"', 
    1242);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'F5', '6510', 'F5', 'за прийняті від населення  платежі за електроенергію на користь суб''єктів господарювання, з якими ук', 
    1243);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'F6', '6510', 'F6', 'за прийняті від населення платежі за житлово-комунальні послуги за договорами, що укладені на рівні ', 
    1244);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'F7', '6510', 'F7', 'за прийняті від населення платежі за газ на користь суб''єктів господарювання, з якими укладені догов', 
    1245);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'A1', '6510', 'A1', 'за зарахування інших доходів на карткові рахунки фізичних осіб', 
    1198);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'A3', '6510', 'A3', 'за видачу готівки підприємствам поштового зв`язку `Укрпошта` на інші потреби, крім виплати пенсії', 
    1199);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'A4', '6510', 'A4', 'від обслуговування підприємств ПЕК (енергогенеруючі компанії, вугледобувні  підприємства та інші під', 
    1200);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'A5', '6510', 'A5', 'за операціями фізичних осіб по СТП "Швидка копійка"', 
    1201);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'A6', '6510', 'A6', 'від обслуговування газопостачальних підприємств та їх структурних підрозділів, а також ДК "Газ Украї', 
    1202);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'A7', '6510', 'A7', 'від обслуговування підприємств теплоенергетики', 
    1203);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'A8', '6510', 'A8', 'за оформлення дорожніх чеків фізичним особам', 
    1204);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'A9', '6510', 'A9', 'за купівлю (сплату) дорожніх чеків у фізичних осіб', 
    1205);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'B0', '6510', 'B0', 'за приймання іменних чеків до сплати на інкасо від фізичних осіб', 
    1206);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'B1', '6510', 'B1', 'за приймання іменних чеків до сплати на інкасо від суб`єктів господарювання', 
    1207);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '68', '6510', '68', 'за  виплату заробітної плати згідно з договорами суб`єктів господарювання з використанням БПК МПС Vi', 
    950);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '69', '6510', '69', 'за виплату заробітної плати згідно з договорами клієнтів,що утримуються з бюджетів  з використанням ', 
    951);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '73', '6510', '73', 'від обслуговування органів Пенсійного фонду України', 
    952);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '74', '6510', '74', 'за  прийняті платежі від фізичних осіб на користь суб`єктів господарювання, з якими укладено генерал', 
    953);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '75', '6510', '75', 'за  операціями фізичних осіб по системі Western Union', 
    954);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '77', '6510', '77', 'за розрахункове обслуговування підприємства поштового зв`язку `Укрпошта`', 
    955);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '78', '6510', '78', 'за касове обслуговування підприємства поштового зв`язку `Укрпошта`', 
    956);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '80', '6510', '80', 'за приймання готівкової виручки від клієнтів, крім корпоративних', 
    957);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '84', '6510', '84', 'відшкодування суми коштів, пов"язаних з витратами на придбання готівки для підприємства поштового зв', 
    958);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'C1', '6510', 'C1', 'за  поповнення та видачу готівки через касу установи банку (POS-термінали тощо) в системі WAY4 за оп', 
    1212);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'C2', '6510', 'C2', 'за операціями з банківським продуктом "Національна картка" в системі WAY4', 
    1213);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', 'C3', '6510', 'C3', 'за операціями з банківським продуктом "Соціальний служби зайнятості" в системі WAY4', 
    1214);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '85', '6510', '85', 'за операціями фізичних осіб по системі "Coinstar"', 
    959);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '86', '6510', '86', 'за дострокове погашення кредитів (або частини), наданих юридичним особам та іншим суб`єктам підприєм', 
    960);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '87', '6510', '87', 'за дострокове погашення кредитів (або частини) за стандартизованим продуктом на придбання нового тра', 
    961);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '88', '6510', '88', 'за дострокове погашення кредитів (або частини) за стандартизованим продуктом на придбання промислови', 
    962);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '89', '6510', '89', 'за дострокове погашення кредитів (або частини) на придбання житла  фізичними особами', 
    963);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '90', '6510', '90', 'за дострокове погашення кредитів (або частини), наданих під іпотеку (крім кредитів на придбання житл', 
    964);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '91', '6510', '91', 'за дострокове погашення інших кредитів, наданих фізичним особам', 
    965);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '92', '6510', '92', 'за переказ коштів з використанням БПК через АТМ', 
    966);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '93', '6510', '93', 'від обслуговування ВАТ "Укртелеком" та його філій', 
    967);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '95', '6510', '95', 'за виплату коштів готівкою фізичним особам згідно з договорами суб`єктів господарювання', 
    968);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '96', '6510', '96', 'за видачу готівки в іноземній валюті з поточних рахунків фізичних осіб', 
    969);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '24', '6510', '24', 'за прийняті платежі на користь бюджетних установ', 
    918);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '26', '6510', '26', 'за  прийняті платежі на користь інших суб`єктів господарювання (крім генеральних угод)', 
    919);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '28', '6510', '28', 'інші доходи від операцій з фізичними особами', 
    920);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '29', '6510', '29', 'інші доходи від операцій з суб`єктами господарювання,  крім корпоративних клієнтів', 
    921);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '33', '6510', '33', 'від обслуговування позабюджетних фондів (крім органів Пенсійного фонду України)', 
    922);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '36', '6510', '36', 'за операціями з БПК  МПС MasterCard Ощадбанку, що здійснені в торговельно-сервісних підприємствах (в', 
    923);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '37', '6510', '37', 'за операціями з БПК  МПС MasterCard  інших банків в частині видачі готівки (від банків-емітентів)', 
    924);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '39', '6510', '39', 'за виплату допомоги по безробіттю згідно договору з суб`єктом господарювання', 
    925);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '41', '6510', '41', 'за продаж суб`єктам господарювання бланків векселів,  крім корпоративних клієнтів', 
    926);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '42', '6510', '42', 'за обслуговування клієнтів - суб`єктів господарювання через системи дистанційного обслуговування, кр', 
    927);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '43', '6510', '43', 'за касове обслуговування суб`єктів господарювання,  крім корпоративних клієнтів', 
    928);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '44', '6510', '44', 'за касове обслуговування клієнтів, що утримуються з бюджетів', 
    929);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '45', '6510', '45', 'за оформлення нових ощадних книжок фізичним особам у разі втрати, пошкодження або в інших випадках', 
    930);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '46', '6510', '46', 'за оформлення грошових чекових книжок, розрахункових чеків при відкритті (переоформленні) , веденні ', 
    931);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '47', '6510', '47', 'за оформлення грошових чекових книжок, розрахункових чеків при відкритті (переоформленні) веденні ра', 
    932);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '48', '6510', '48', 'за надання довідок, дублікатів довідок, виписок з рахунків фізичних осіб', 
    933);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '49', '6510', '49', 'за надання довідок, дублікатів довідок, виписок з рахунків суб`єктів господарювання, крім корпоратив', 
    934);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '50', '6510', '50', 'за надання довідок, дублікатів довідок, виписок з рахунків клієнтів, що утримуються з бюджетів', 
    935);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '51', '6510', '51', 'за виконання протягом року операцій за розрахунками по БПК МПС  MasterCard фізичних осіб', 
    936);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '52', '6510', '52', 'за виконання протягом року операцій за розрахунками по БПК МПС MasterCard суб`єктів господарювання, ', 
    937);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '53', '6510', '53', 'за виконання протягом року операцій за розрахунками по БПК МПС  MasterCard клієнтів, що утримуються ', 
    938);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '54', '6510', '54', 'за  виплату заробітної плати згідно з договорами суб`єктів господарювання', 
    939);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '55', '6510', '55', 'за  виплату заробітної плати згідно з договорами суб`єктів господарювання з використанням БПК МПС Ma', 
    940);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '56', '6510', '56', 'за виплату заробітної плати згідно з договорами клієнтів, що утримуються з бюджетів', 
    941);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '57', '6510', '57', 'за виплату заробітної плати згідно з договорами клієнтів, що утримуються з бюджетів з використанням ', 
    942);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '60', '6510', '60', 'за надані послуги з розповсюдження лотерей', 
    943);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '61', '6510', '61', 'за поповнення картрахунку та видачу готівки по БПК ', 
    944);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '63', '6510', '63', 'за операціями з БПК МПС VISA Ощадбанку, що здійснені в торговельно-сервісних підприємствах (від банк', 
    945);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '64', '6510', '64', 'за операціями з БПК МПС VISA інших банків в частині видачі готівки (від банків-емітентів)', 
    946);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6110', '67', '6510', '67', 'за виконання протягом року операцій за розрахунками по БПК МПС  VISA клієнтів, що утримуються з бюдж', 
    949);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '03', '6511', '03', 'за надання послуг фізичним особам з ведення Державного реєстру обтяжень рухомого майна', 
    973);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '34', '6511', '34', 'за операціями за банківським продуктом "Арсенал"  в системі WAY4', 
    992);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '39', '6511', '39', 'доходи, отримані від суб`єктів господарювання для відшкодування вартості державної реєстрації прав н', 
    996);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '38', '6511', '38', 'доходи, отримані від фізичних осіб для відшкодування вартості державної реєстрації прав на нерухоме ', 
    995);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '36', '6511', '36', 'за операціями за банківським продуктом " Зарплатний студентський " в системі WAY4;', 
    994);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '35', '6511', '35', 'за операціями за банківським продуктом  " Зарплатний бюджетний " в системі WAY4;', 
    993);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '06', '6511', '06', 'за зміну умов кредитного договору за ініціативою позичальників - юридичних осіб та інших суб`єктів п', 
    975);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '12', '6511', '12', 'за обслуговування кредитів, наданих за стандартизованим продуктом на придбання нового транспортного ', 
    976);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '13', '6511', '13', 'за обслуговування кредитів, наданих за стандартизованим продуктом на придбання промислових товарів ч', 
    977);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '14', '6511', '14', 'за обслуговування кредитів, наданих на придбання житла фізичним особам', 
    978);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '15', '6511', '15', 'за обслуговування кредитів, забезпечених іпотекою (крім кредитів на придбання житла) фізичним особам', 
    979);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '16', '6511', '16', 'за обслуговування інших кредитів фізичним особам', 
    980);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '17', '6511', '17', 'за зміну умов кредитного договору фізичними особами', 
    981);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '22', '6511', '22', 'за надання послуг суб`єктам господарювання з ведення Державного реєстру обтяжень рухомого майна', 
    982);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '24', '6511', '24', 'за обслуговування кредитів, наданих фізичним особам на придбання енергозберігаючих товарів через тор', 
    983);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '26', '6511', '26', 'за надання фізичним особам довідок та дублікатів довідок щодо виконання кредитних зобов`язань та роз', 
    984);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '27', '6511', '27', 'за обслуговування кредитної лінії по БПК фізичних осіб', 
    985);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '28', '6511', '28', 'за операціями з банківським продуктом `Зарплатний` для працівників суб`єктів господарювання в систем', 
    986);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '29', '6511', '29', 'за операціями за банківським продуктом  "Економний" в системі WAY4', 
    987);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '30', '6511', '30', 'за операціями за банківським продуктом "Стандартний" в системі WAY4', 
    988);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '31', '6511', '31', 'за операціями за банківським продуктом "Зарплатний" для працівників банку  в системі WAY4', 
    989);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '32', '6511', '32', 'за операціями за банківським продуктом "Преміум" в системі WAY4', 
    990);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '33', '6511', '33', 'за операціями за банківським продуктом "Пенсійний" в системі WAY4', 
    991);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6111', '05', '6511', '05', 'за супроводження кредитів, наданих юридичним особам та іншим суб`єктам підприємницької діяльності', 
    974);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6113', '08', '6513', '08', 'за депозитарними операціями з суб"єктами господарювання', 
    1000);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6113', '07', '6513', '07', 'за депозитарними операціями з фізичними особами', 
    999);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6113', '09', '6513', '09', 'за депозитарними операціями з недержавними пенсійними фондами', 
    1001);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6113', '06', '6513', '06', 'за операціями з казначейськими зобов`язаннями', 
    998);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6113', '03', '6513', '03', 'за операціями з іншими цінними паперами для клієнтів', 
    997);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '39', '6514', '39', 'за операціями обміну зливків банківського металу на зливки іншої маси фізичним особам', 
    1023);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '40', '6514', '40', 'за операціями обміну зливків банківського металу на зливки іншої маси промисловим споживачам', 
    1024);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '38', '6514', '38', 'за конвертаційними операціями ВАТ "Укртелеком" та його філій', 
    1022);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '37', '6514', '37', 'за зовнішньо-економічними та іншими переказами за дорученням ВАТ "Укртелеком" та його філій', 
    1021);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '36', '6514', '36', 'за операціями з купівлі-продажу безготівкової іноземної валюти  ВАТ "Укртелеком" та його філіями', 
    1020);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '35', '6514', '35', 'за конвертаційними операціями суб`єктів господарювання', 
    1019);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '34', '6514', '34', 'за конвертаційними операціями фізичних осіб', 
    1018);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '33', '6514', '33', 'за конвертаційними операціями по БПК МПС VISA', 
    1017);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '32', '6514', '32', 'за конвертаційними операціями по БПК МПС MasterCard', 
    1016);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '28', '6514', '28', 'інші комісійні доходи від операцій з суб`єктами господарювання', 
    1015);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '27', '6514', '27', 'інші комісійні доходи від операцій з фізичними особами', 
    1014);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '26', '6514', '26', 'за операціями фізичних осіб по виплаті компенсації в іноземній валюті від компанії "Claims conferenc', 
    1013);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '25', '6514', '25', 'за операціями фізичних осіб по виплаті одноразової фінансової допомоги в іноземній валюті від фонду ', 
    1012);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '23', '6514', '23', 'за операціями фізичних осіб з купівлі-продажу банківських металів', 
    1011);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '17', '6514', '17', 'за виплату  переказів фізичним особам за соціально-значущими платежами', 
    1010);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '16', '6514', '16', 'за відправлення переказів фізичних осіб за соціально-значущими платежами', 
    1009);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '15', '6514', '15', 'за сплату переказів фізичним особам', 
    1008);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '14', '6514', '14', 'за прийом переказів від фізичних осіб', 
    1007);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '10', '6514', '10', 'за операціями фізичних осіб з інкасо іноземної валюти', 
    1006);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '08', '6514', '08', 'за зміну умов, розшук (запит), повернення, анулювання переказів фізичних осіб', 
    1005);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '06', '6514', '06', 'за зовнішньо-економічні та інші перекази за дорученням суб`єктів господарювання', 
    1004);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '04', '6514', '04', 'за розрахунками  суб`єктів господарювання  із застосуванням документарного інкасо', 
    1003);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '01', '6514', '01', 'за операціями суб`єктів господарювання з купівлі-продажу безготівкової іноземної валюти', 
    1002);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '50', '6514', '50', 'за операціями  з видачі фізичним особам індивідуальних е-ліцензій НБУ засобами АІС на здійснення вал', 
    1034);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '49', '6514', '49', 'за операціями підприємств, що підпорядковані Державній адміністрації залізничного транспорту та їх с', 
    1033);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '48', '6514', '48', 'за операціями фізичних осіб з купівлі-продажу безготівкової іноземної валюти', 
    1032);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '47', '6514', '47', 'за операціями підприємств поштового зв`язку `Укрпошта`', 
    1031);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '46', '6514', '46', 'за  проведення експертної оцінки банківських металів промислових споживачів', 
    1030);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '45', '6514', '45', 'за  проведення експертної оцінки банківських металів фізичних осіб', 
    1029);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '44', '6514', '44', 'за  приймання на зберігання банківських металів від промислових споживачів', 
    1028);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '43', '6514', '43', 'за  приймання на зберігання банківських металів від фізичних осіб', 
    1027);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '41', '6514', '41', 'за  операціями фізичних осіб з купівлі-продажу банківських металів без фізичної поставки', 
    1025);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6114', '42', '6514', '42', 'за  операціями промислових споживачів з купівлі-продажу банківських металів без фізичної поставки', 
    1026);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6116', '01', '6516', '01', 'від довірчого обслуговування суб`єктів господарювання', 
    1035);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6118', '02', '6518', '02', 'за гарантіями, наданими суб`єктам господарювання', 
    1037);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6118', '06', '6518', '06', 'за резервування коштів на невикористану частину кредитів за відновлюваною кредитною лінією, наданих ', 
    1413);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6118', '05', '6518', '05', 'за резервування коштів на невикористану частину кредитів за невідновлюваною кредитною лінією, надани', 
    1040);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6118', '09', '6518', '09', 'за документарними операціями  клієнтів ЦА', 
    1416);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6118', '03', '6518', '03', 'інші доходи за операціями суб`єктів господарювання', 
    1038);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6118', '10', '6518', '10', 'за авальованими векселями, наданими клієнтам ММСБ', 
    1417);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6118', '01', '6518', '01', 'за покритими акредитивами', 
    1036);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6118', '08', '6518', '08', 'за авальованими векселями, наданими корпоративним клієнтам', 
    1415);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6118', '07', '6518', '07', 'за непокритими акредитивами', 
    1414);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6118', '04', '6518', '04', 'за резервування коштів на невикористану частину кредитів, наданих юридичним особам та іншим суб`єкта', 
    1039);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6119', '10', '6519', '10', 'за інші операції по БПК МПС VISA', 
    1421);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6119', '11', '6519', '11', 'за укладеними договорами та/або полісами страхування згідно агентських договорів', 
    1422);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6119', '12', '6519', '12', 'за зберігання цінних паперів', 
    1423);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6119', '14', '6519', '14', 'за приймання від спадкоємців дорожніх чеків та документів для передачі до компанії-емітента з метою ', 
    1424);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6119', '15', '6519', '15', 'за передачу клієнтам чеків, надісланих із-за кордону', 
    1425);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6119', '17', '6519', '17', 'за послуги служби інкасації та перевезення цінностей, що надаються підприємствам  поштового зв`язку ', 
    1427);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6119', '19', '6519', '19', 'за надання індивідуальних сейфів фізичним особам у тимчасове      користування та зберігання докумен', 
    1429);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6119', '05', '6519', '05', 'за інші операції по картках  БПК  МПС MasterCard', 
    1420);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6119', '03', '6519', '03', 'інші доходи', 
    1419);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6119', '01', '6519', '01', 'за операціями з грошово-речовими лотереями згідно договорів із суб`єктами господарювання', 
    1418);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6119', '16', '6519', '16', 'за послуги служби інкасації та перевезення цінностей, що надаються суб`єктам господарювання', 
    1426);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6119', '26', '6519', '26', 'за надання інформаційних послуг суб"єктам господарювання', 
    1436);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6119', '25', '6519', '25', 'комісійні доходи за договорами з приватними нотаріусами (щодо власників предметів іпотеки/застави  -', 
    1435);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6119', '24', '6519', '24', 'комісійні доходи за договорами з приватними нотаріусами (щодо власників предметів іпотеки/застави - ', 
    1434);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6119', '23', '6519', '23', 'комісійні доходи за послуги  з доставки платіжних повідомлень до процесингової системи еквайра за оп', 
    1433);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6119', '22', '6519', '22', 'агентська винагорода за укладеними договорами та/або полісами страхування з суб`єктами господарюванн', 
    1432);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6119', '18', '6519', '18', 'за послуги служби інкасації та перевезення цінностей, що надаються фізичним         особам', 
    1428);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6119', '20', '6519', '20', 'за надання індивідуальних сейфів суб`єктам господарювання у тимчасове        користування та зберіга', 
    1430);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6119', '21', '6519', '21', 'агентська винагорода за укладеними договорами та/або полісами страхування з фізичними особами', 
    1431);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6180', '09', '6520', '09', 'за операціями з передачі готівкових коштів між установами банку для виплати компенсації грошових зао', 
    1442);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6180', '08', '6520', '08', 'за операціями з передачі готівкових коштів для підкріплення підприємств поштового зв`язку `Укрпошта`', 
    1441);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6180', '03', '6520', '03', 'за операціями з передачі готівкових коштів  між установами банку', 
    1437);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6180', '05', '6520', '05', 'за послуги служби інкасації та перевезення цінностей між установами Ощадбанку', 
    1439);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6180', '04', '6520', '04', 'за видачу готівки з внутрішнього рахунку та за інкасо готівки в іноземній валюті', 
    1438);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6180', '06', '6520', '06', 'за операціями з передачі готівкових коштів в іноземній валюті  між установами банку за рахунок валют', 
    1440);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6213', '02', '6223', '02', 'від торгових операцій з акціями та іншими дольовими цінними паперами', 
    1444);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6213', '03', '6223', '03', 'від торгових операцій з борговими цінними паперами', 
    1445);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6213', '01', '6223', '01', 'від торгових операцій з цінними паперами, що рефiнансуються НБУ', 
    1443);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'J4', '6350', 'J4', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами)  "Довіра" с', 
    1534);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '25', '6350', '25', 'операційні доходи від перерахування процентів за вкладами "Депозитний"  строком від 1 до 3 місяців в', 
    1568);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '26', '6350', '26', 'операційні доходи від перерахування процентів за вкладами "Депозитний"  строком від 3 до 6 місяців у', 
    1569);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '27', '6350', '27', 'операційні доходи від перерахування процентів за вкладами "Депозитний"  строком від 3 до 6 місяців в', 
    1570);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '28', '6350', '28', 'операційні доходи від перерахування процентів за вкладами "Депозитний"  строком від 6 до 12 місяців ', 
    1571);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '29', '6350', '29', 'операційні доходи від перерахування процентів за вкладами "Депозитний"  строком від 6 до 12 місяців ', 
    1572);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '30', '6350', '30', ' операційні доходи від перерахування процентів за довгостроковими вкладами "Депозитний" строком біль', 
    1573);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '31', '6350', '31', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Депозитний" строком більш', 
    1574);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '32', '6350', '32', 'операційні доходи від перерахування процентів за короткостроковими вкладами "Депозитний Ощадного бан', 
    1575);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '33', '6350', '33', 'операційні доходи від перерахування процентів за короткостроковими вкладами "Депозитний Ощадного бан', 
    1576);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '34', '6350', '34', 'операційні доходи від перерахування процентів за вкладами "Дитячий" у нац.валюті (рахунок 2635)', 
    1577);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '35', '6350', '35', 'операційні доходи від перерахування процентів за вкладами "Дитячий" в ін.валюті (рахунок 2635)', 
    1578);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '36', '6350', '36', 'операційні доходи від перерахування процентів за короткостроковими вкладами  "Авансовий" строком на ', 
    1579);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '37', '6350', '37', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Строковий пенсійний Ощадн', 
    1580);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '38', '6350', '38', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Строковий пенсійний Ощадн', 
    1581);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '39', '6350', '39', 'операційні доходи від перерахування процентів за довгостроковими вкладами  "Депозитний Ощадного банк', 
    1582);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '40', '6350', '40', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Депозитний Ощадного банку', 
    1583);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '41', '6350', '41', 'операційні доходи від перерахування процентів за короткостроковими вкладами "Накопичувальний"  строк', 
    1584);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '42', '6350', '42', 'операційні доходи від перерахування процентів за короткостроковими вкладами "Накопичувальний"  строк', 
    1585);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '43', '6350', '43', 'операційні доходи від перерахування процентів за довгостроковими  вкладами "Мобільний" у нац.валюті ', 
    1586);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '44', '6350', '44', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Мобільний" в ін.валюті (р', 
    1587);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '45', '6350', '45', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Майбутнє дітям" у нац.вал', 
    1588);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '46', '6350', '46', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Накопичувальний"  строком', 
    1589);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '47', '6350', '47', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Накопичувальний"  строком', 
    1590);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '48', '6350', '48', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Новий відсоток " у нац.ва', 
    1591);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '49', '6350', '49', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Новий відсоток" в ін.валю', 
    1592);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '50', '6350', '50', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Накопичувальний"  строком', 
    1593);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '51', '6350', '51', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Накопичувальний"  строком', 
    1594);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '52', '6350', '52', 'операційні доходи від перерахування процентів за короткостроковими вкладами "Авансовий" строком на 1', 
    1595);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '53', '6350', '53', 'операційні доходи від перерахування процентів за короткостроковими вкладами "Динамічний" строком на ', 
    1596);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '54', '6350', '54', 'операційні доходи від перерахування процентів за короткостроковими        вкладами `Динамічний`` стр', 
    1597);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '55', '6350', '55', 'операційні доходи від перерахування процентів за короткостроковими вкладами "Накопичувальний" строко', 
    1598);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'D2', '6340', 'D2', 'доходи за визнаними нестачами винних осіб за операціями з готівкою', 
    1446);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'D3', '6340', 'D3', 'доходи за визнаними нестачами винних осіб за операціями з БПК', 
    1447);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'D4', '6340', 'D4', 'доходи  за визнаними нестачами винних осіб за вкладними (депозитними) операціями', 
    1448);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'D5', '6340', 'D5', 'доходи за визнаними нестачами винних осіб за іншими операціями', 
    1449);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'D6', '6340', 'D6', 'доходи від реалізації інвестиційних монет, виготовлених з дорогоцінних металів', 
    1450);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '01', '6340', '01', 'за надлишки грошових коштів, виявлених у касирів установ банку та банкоматах', 
    1451);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '02', '6340', '02', 'інші операційні доходи', 
    1452);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '04', '6340', '04', 'повернення держмита, судового збору тощо, сплачених при поданні позовної заяви до господарського суд', 
    1453);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '08', '6340', '08', 'доходи за набувальною давністю з рахунків клієнтів та нез`ясовані суми платежів, за якими минув терм', 
    1454);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '14', '6340', '14', 'доходи від реалізації пам"ятних, інвестиційних монет та футлярів для пам"ятних монет', 
    1455);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'A2', '6350', 'A2', 'операційні доходи від перерахування процентів за довгостроковими вкладами (депозитами) "Забезпечувал', 
    1456);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'A3', '6350', 'A3', 'операційні доходи від перерахування процентів за довгостроковими вкладами (депозитами) "Забезпечувал', 
    1457);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'A9', '6350', 'A9', 'операційні доходи від перерахування процентів за короткостроковими  вкладами "Максимальний" у нац.ва', 
    1458);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'B0', '6350', 'B0', 'операційні доходи від перерахування процентів за короткостроковими  вкладами "Максимальний" в ін.вал', 
    1459);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'B1', '6350', 'B1', 'операційні доходи від перерахування процентів за довгостроковими  вкладами "Максимальний" у нац.валю', 
    1460);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'B2', '6350', 'B2', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Максимальний" в ін.валюті', 
    1461);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'B3', '6350', 'B3', 'операційні доходи від перерахування процентів за короткостроковими  вкладами "Накопичувальний" у нац', 
    1462);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'B4', '6350', 'B4', 'операційні доходи від перерахування процентів за короткостроковими  вкладами "Накопичувальний" в ін.', 
    1463);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'B5', '6350', 'B5', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Накопичувальний" у нац.ва', 
    1464);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'B6', '6350', 'B6', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Накопичувальний" в ін.вал', 
    1465);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'B9', '6350', 'B9', 'операційні доходи від перерахування процентів за короткостроковими вкладами "Мобільний" у нац.валюті', 
    1466);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'C0', '6350', 'C0', 'операційні доходи від перерахування процентів за короткостроковими вкладами "Мобільний" в ін.валюті ', 
    1467);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'C1', '6350', 'C1', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Мобільний" у нац.валюті (', 
    1468);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'G3', '6350', 'G3', 'операційні доходи від перерахування процентів за вкладами (депозитами) за вкладами "Класичний" строк', 
    1503);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '56', '6350', '56', 'операційні доходи від перерахування процентів за короткостроковими вкладами "Накопичувальний" строко', 
    1599);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '57', '6350', '57', 'операційні доходи від перерахування процентів за іншими довгостроковими вкладами (депозитами) (рахун', 
    1600);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '59', '6350', '59', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами) "Забезпечув', 
    1601);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '60', '6350', '60', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами) "Забезпечув', 
    1602);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '61', '6350', '61', 'операційні доходи від перерахування процентів за довгостроковими вкладами (депозитами) "Забезпечувал', 
    1603);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '62', '6350', '62', 'операційні доходи від перерахування процентів за довгостроковими вкладами (депозитами) "Забезпечувал', 
    1604);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '63', '6350', '63', 'операційні доходи від перерахування процентів за короткостроковими  вкладами "Максимальний" в нац.ва', 
    1605);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '64', '6350', '64', 'операційні доходи від перерахування процентів за короткостроковими  вкладами "Максимальний" у ін.вал', 
    1606);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '65', '6350', '65', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Максимальний" в нац.валют', 
    1607);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '66', '6350', '66', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Максимальний" у ін.валюті', 
    1608);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '73', '6350', '73', 'операційні доходи від перерахування процентів за короткостроковими  вкладами "Накопичувальний" у нац', 
    1609);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '74', '6350', '74', 'операційні доходи від перерахування процентів за короткостроковими  вкладами "Накопичувальний" в ін.', 
    1610);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '75', '6350', '75', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Накопичувальний" у нац.ва', 
    1611);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '76', '6350', '76', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Накопичувальний" в ін.вал', 
    1612);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '79', '6350', '79', 'операційні доходи від перерахування процентів за короткостроковими вкладами "Мобільний" у нац.валюті', 
    1613);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '80', '6350', '80', 'операційні доходи від перерахування процентів за короткостроковими вкладами "Мобільний" в ін.валюті ', 
    1614);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '81', '6350', '81', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Мобільний" у нац.валюті (', 
    1615);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '82', '6350', '82', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Мобільний" в ін.валюті (р', 
    1616);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '83', '6350', '83', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами) залученими ', 
    1617);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '84', '6350', '84', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами) залученими ', 
    1618);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '85', '6350', '85', 'операційні доходи від перерахування процентів за довгостроковими вкладами (депозитами) залученими на', 
    1619);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '86', '6350', '86', 'операційні доходи від перерахування процентів за довгостроковими вкладами (депозитами) залученими на', 
    1620);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '90', '6350', '90', 'операційні доходи від перерахування процентів за короткостроковими вкладами "Максимальний" у нац.вал', 
    1621);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '91', '6350', '91', 'операційні доходи від перерахування процентів за короткостроковими вкладами "Максимальний" в ін.валю', 
    1622);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '92', '6350', '92', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Максимальний" у нац.валют', 
    1623);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '93', '6350', '93', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Максимальний" в ін.валюті', 
    1624);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '94', '6350', '94', 'операційні доходи від перерахування процентів за короткостроковими вкладами "Накопичувальний" у нац.', 
    1625);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '95', '6350', '95', 'операційні доходи від перерахування процентів за короткостроковими вкладами "Накопичувальний" в ін.в', 
    1626);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '96', '6350', '96', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Накопичувальний" у нац.ва', 
    1627);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '97', '6350', '97', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Накопичувальний" в ін.вал', 
    1628);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'J5', '6350', 'J5', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами)  "Довіра" с', 
    1535);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'C2', '6350', 'C2', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Мобільний" в ін.валюті (р', 
    1469);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'C3', '6350', 'C3', 'операційні доходи від перерахування процентів за короткостроковими  вкладами (депозитами) залученими', 
    1470);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'G4', '6350', 'G4', 'операційні доходи від перерахування процентів за вкладами (депозитами) за вкладами "Класичний" строк', 
    1504);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'G5', '6350', 'G5', 'операційні доходи від перерахування процентів за вкладами (депозитами)  за вкладами "Класичний" стро', 
    1505);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'G6', '6350', 'G6', 'операційні доходи від перерахування процентів за вкладами (депозитами)  за вкладами "Класичний" стро', 
    1506);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'G7', '6350', 'G7', 'операційні доходи від перерахування процентів за вкладами (депозитами) за вкладами "Капітал" строком', 
    1507);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'G8', '6350', 'G8', 'операційні доходи від перерахування процентів за вкладами (депозитами) за вкладами "Капітал" строком', 
    1508);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'G9', '6350', 'G9', 'операційні доходи від перерахування процентів за вкладами (депозитами)  за вкладами "Капітал" строко', 
    1509);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'H0', '6350', 'H0', 'операційні доходи від перерахування процентів за вкладами (депозитами)  за вкладами "Капітал" строко', 
    1510);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'H1', '6350', 'H1', 'операційні доходи від перерахування процентів за вкладами (депозитами)  за вкладами "Капітал" строко', 
    1511);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'H2', '6350', 'H2', 'операційні доходи від перерахування процентів за вкладами (депозитами)  за вкладами "Капітал" строко', 
    1512);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'H3', '6350', 'H3', 'операційні доходи від перерахування процентів за вкладами (депозитами) "Класичний " строком на 18 мі', 
    1513);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'H4', '6350', 'H4', 'операційні доходи від перерахування процентів за вкладами (депозитами) "Класичний " строком на 18 мі', 
    1514);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'H5', '6350', 'H5', 'операційні доходи від перерахування процентів за вкладами (депозитами) "Капітал " строком на 18 міся', 
    1515);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'H6', '6350', 'H6', 'операційні доходи від перерахування процентів за вкладами (депозитами) "Капітал " строком на 18 міся', 
    1516);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'H7', '6350', 'H7', 'операційні доходи від перерахування процентів за вкладами (депозитами) "Капітал " строком на 36 міся', 
    1517);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'H8', '6350', 'H8', 'операційні доходи від перерахування процентів за вкладами (депозитами) "Капітал " строком на 36 міся', 
    1518);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'H9', '6350', 'H9', 'операційні доходи від перерахування процентів за вкладами (депозитами) "Пенсійний " строком на 18 мі', 
    1519);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'I0', '6350', 'I0', 'операційні доходи від перерахування процентів за вкладами (депозитами) "Пенсійний " строком на 18 мі', 
    1520);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'I1', '6350', 'I1', 'операційні доходи від перерахування процентів за вкладами (депозитами)  за вкладами "Гнучкий" у наці', 
    1521);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'I2', '6350', 'I2', 'операційні доходи від перерахування процентів за вкладами (депозитами)  за вкладами "Гнучкий" в іноз', 
    1522);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'I3', '6350', 'I3', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами)  "Депозитна', 
    1523);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'I4', '6350', 'I4', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами)  "Депозитна', 
    1524);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'I5', '6350', 'I5', 'операційні доходи від перерахування процентів за довгостроковими вкладами (депозитами)  "Депозитна л', 
    1525);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'I6', '6350', 'I6', 'операційні доходи від перерахування процентів за довгостроковими вкладами (депозитами)  "Депозитна л', 
    1526);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'I7', '6350', 'I7', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами)  "Депозитна', 
    1527);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'I8', '6350', 'I8', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами)  "Депозитна', 
    1528);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'I9', '6350', 'I9', 'операційні доходи від перерахування процентів за довгостроковими вкладами (депозитами)  "Депозитна л', 
    1529);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'J0', '6350', 'J0', 'операційні доходи від перерахування процентів за довгостроковими вкладами (депозитами)  "Депозитна л', 
    1530);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'J1', '6350', 'J1', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами)  "Писанка" ', 
    1531);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'J2', '6350', 'J2', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами)  "Писанка" ', 
    1532);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'J3', '6350', 'J3', ' операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами)  "Довіра  ', 
    1533);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'J6', '6350', 'J6', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами)  "Довіра" с', 
    1536);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'J7', '6350', 'J7', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами)  "Довіра" с', 
    1537);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'J8', '6350', 'J8', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами)  "Довіра" с', 
    1538);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'J9', '6350', 'J9', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами)  без права ', 
    1539);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'K0', '6350', 'K0', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами)  без права ', 
    1540);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'K1', '6350', 'K1', 'операційні доходи від перерахування процентів за довгостроковими вкладами (депозитами)  без права до', 
    1541);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'K2', '6350', 'K2', 'операційні доходи від перерахування процентів за довгостроковими вкладами (депозитами)  без права до', 
    1542);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'K3', '6350', 'K3', 'операційні доходи від перерахування процентів за вкладами  (депозитами) "Мобільний" з правом дострок', 
    1543);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'K4', '6350', 'K4', 'операційні доходи від перерахування процентів за вкладами  (депозитами) "Мобільний" з правом дострок', 
    1544);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'K5', '6350', 'K5', 'операційні доходи від перерахування процентів за вкладами  (депозитами) "Мобільний" з правом дострок', 
    1545);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'K6', '6350', 'K6', 'операційні доходи від перерахування процентів за вкладами  (депозитами) "Мобільний" з правом дострок', 
    1546);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'K7', '6350', 'K7', 'операційні доходи від перерахування процентів за вкладами  (депозитами) "Максимальний" з правом дост', 
    1547);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'K8', '6350', 'K8', 'операційні доходи від перерахування процентів за вкладами  (депозитами) "Максимальний" з правом дост', 
    1548);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'K9', '6350', 'K9', 'операційні доходи від перерахування процентів за вкладами  (депозитами) "Максимальний" з правом дост', 
    1549);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'L0', '6350', 'L0', 'операційні доходи від перерахування процентів за вкладами  (депозитами) "Максимальний" з правом дост', 
    1550);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'L1', '6350', 'L1', 'операційні доходи від перерахування процентів за вкладами  "Корпоративний залишок" у національній ва', 
    1551);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'L2', '6350', 'L2', 'операційні доходи від перерахування процентів за вкладами  "Корпоративний залишок" в іноземній валют', 
    1552);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'L3', '6350', 'L3', 'операційні доходи від перерахування процентів за короткостроковими вкладами "Акційний" у національні', 
    1553);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'L4', '6350', 'L4', 'операційні доходи від перерахування процентів за короткостроковими  вкладами "Акційний" в іноземній ', 
    1554);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'L5', '6350', 'L5', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Акційний" у національній ', 
    1555);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'L6', '6350', 'L6', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Акційний" в іноземній вал', 
    1556);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'L7', '6350', 'L7', 'операційні доходи від перерахування процентів за вкладами  "Депозитна лінія" з правом дострокового в', 
    1557);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'L8', '6350', 'L8', 'операційні доходи від перерахування процентів за вкладами  "Депозитна лінія" з правом дострокового в', 
    1558);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '15', '6350', '15', 'доходи по відшкодуванню витрат банку, пов`язаних з виплатою компенсації грошових заощаджень', 
    1559);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '17', '6350', '17', 'операційні доходи від перерахування процентів за цільовими вкладами на дітей (рахунок 2635)', 
    1560);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '18', '6350', '18', 'операційні доходи від перерахування процентів за короткостроковими  вкладами "Накопичувальний"  стро', 
    1561);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '19', '6350', '19', 'операційні доходи від перерахування процентів за короткостроковими вкладами  "Накопичувальний" строк', 
    1562);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '20', '6350', '20', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Строковий пенсійний"  у н', 
    1563);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '21', '6350', '21', 'операційні доходи від перерахування процентів за довгостроковими вкладами   "Строковий пенсійний" в ', 
    1564);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '22', '6350', '22', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Депозитний"  строком біль', 
    1565);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '23', '6350', '23', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Депозитний"  строком біль', 
    1566);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', '24', '6350', '24', 'операційні доходи від перерахування процентів за вкладами "Депозитний"  строком від 1 до 3 місяців у', 
    1567);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'C4', '6350', 'C4', 'операційні доходи від перерахування процентів за короткостроковими  вкладами (депозитами) залученими', 
    1471);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'C5', '6350', 'C5', 'операційні доходи від перерахування процентів за довгостроковими вкладами (депозитами) залученими на', 
    1472);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'C6', '6350', 'C6', 'операційні доходи від перерахування процентів за довгостроковими вкладами (депозитами) залученими на', 
    1473);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'C9', '6350', 'C9', 'операційні доходи від перерахування процентів за короткостроковими  вкладами (депозитами) "Забезпечу', 
    1474);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'D0', '6350', 'D0', 'операційні доходи від перерахування процентів за короткостроковими  вкладами (депозитами) "Забезпечу', 
    1475);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'D1', '6350', 'D1', 'операційні доходи від перерахування процентів за іншими вкладами (депозитами), ощадними сертифікатам', 
    1476);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'D7', '6350', 'D7', 'операційні доходи від перерахування процентів за короткостроковими вкладами "Золотий стандарт" (раху', 
    1477);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'D8', '6350', 'D8', 'операційні доходи від перерахування процентів за довгостроковими вкладами "Золотий стандарт" (рахуно', 
    1478);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'D9', '6350', 'D9', 'виправлення помилок за доходами попередніх років, які виявлені в поточному році', 
    1479);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'E0', '6350', 'E0', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами) "Ліквідний"', 
    1480);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'E1', '6350', 'E1', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами) "Ліквідний"', 
    1481);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'E2', '6350', 'E2', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами) "Ліквідний"', 
    1482);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'E3', '6350', 'E3', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами) "Максимальн', 
    1483);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'E4', '6350', 'E4', 'операційні доходи від перерахування процентів за короткостроковими вкладами (депозитами) "Накопичува', 
    1484);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'E5', '6350', 'E5', 'операційні доходи від перерахування процентів за вкладами (депозитами) "Щедрик" строком на 3 місяці ', 
    1485);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'E6', '6350', 'E6', 'операційні доходи від перерахування процентів за вкладами (депозитами) "Щедрик" строком на 3 місяці ', 
    1486);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'E7', '6350', 'E7', 'операційні доходи від перерахування процентів за вкладами (депозитами) "Пенсійний " строком на 3 міс', 
    1487);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'E8', '6350', 'E8', 'операційні доходи від перерахування процентів за вкладами (депозитами) "Пенсійний " строком на 3 міс', 
    1488);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'E9', '6350', 'E9', 'операційні доходи від перерахування процентів за вкладами (депозитами) "Пенсійний " строком на 6 міс', 
    1489);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'F0', '6350', 'F0', 'операційні доходи від перерахування процентів за вкладами (депозитами) "Пенсійний " строком на 6 міс', 
    1490);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'F1', '6350', 'F1', 'операційні доходи від перерахування процентів за вкладами (депозитами) "Пенсійний " строком на 12 мі', 
    1491);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'F2', '6350', 'F2', 'операційні доходи від перерахування процентів за вкладами (депозитами) "Пенсійний " строком на 12 мі', 
    1492);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'F3', '6350', 'F3', 'операційні доходи від перерахування процентів за вкладами (депозитами) "Класичний " строком на 36 мі', 
    1493);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'F4', '6350', 'F4', 'операційні доходи від перерахування процентів за вкладами (депозитами) "Класичний " строком на 36 мі', 
    1494);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'F5', '6350', 'F5', 'операційні доходи від перерахування процентів за вкладами (депозитами) "Класичний" строком на 7 днів', 
    1495);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'F6', '6350', 'F6', 'операційні доходи від перерахування процентів за вкладами (депозитами)  за вкладами "Класичний" стро', 
    1496);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'F7', '6350', 'F7', 'операційні доходи від перерахування процентів за вкладами (депозитами) за вкладами "Класичний" строк', 
    1497);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'F8', '6350', 'F8', 'операційні доходи від перерахування процентів за вкладами (депозитами) за вкладами "Класичний" строк', 
    1498);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'F9', '6350', 'F9', 'операційні доходи від перерахування процентів за вкладами (депозитами) за вкладами "Класичний" строк', 
    1499);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'G0', '6350', 'G0', 'операційні доходи від перерахування процентів за вкладами (депозитами) за вкладами "Класичний" строк', 
    1500);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'G1', '6350', 'G1', 'операційні доходи від перерахування процентів за вкладами (депозитами)  за вкладами "Класичний" стро', 
    1501);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6399', 'G2', '6350', 'G2', 'операційні доходи від перерахування процентів за вкладами (депозитами) за вкладами "Класичний" строк', 
    1502);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('6717', '05', '6715', '05', 'Повернення раніше списаних безнадійних доходів минулих років', 
    1629);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7013', '04', '7012', '08', 'за довгостроковими вкладами (депозитами) міжнародних та інвестиційних банків в іноземній валюті', 
    1633);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7013', '01', '7012', '05', 'за довгостроковими вкладами (депозитами) інших банків у національній валюті', 
    1630);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7013', '03', '7012', '07', 'за довгостроковими вкладами (депозитами) міжнародних та інвестиційних банків у національній валюті', 
    1632);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7013', '02', '7012', '06', 'за довгостроковими вкладами (депозитами) інших банків в іноземній валюті', 
    1631);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7016', '05', '7017', '07', 'за короткостроковими кредитами, що отримані від міжнародних та інвестиційних банків у національній в', 
    1636);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7016', '03', '7017', '06', 'за короткостроковими кредитами, що отримані від інших банків в національній валюті  ', 
    1635);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7016', '06', '7017', '08', 'за короткостроковими кредитами, що отримані від міжнародних та інвестиційних банків в іноземній валю', 
    1637);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7016', '01', '7017', '05', 'за короткостроковими кредитами, що отримані від інших банків в іноземній валюті  ', 
    1634);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7052', '02', '7122', '02', 'процентні витрати за ощадними сертифікатами строком на 6 місяців', 
    1639);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7052', '01', '7122', '01', 'процентні витрати за ощадними сертифікатами строком на 3 місяці', 
    1638);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7052', '03', '7122', '03', 'процентні витрати за ощадними сертифікатами строком на 12 місяців', 
    1640);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7060', '01', '7060', '02', 'за короткостроковими  кредитами, що отримані від міжнародних та інших організацій', 
    1641);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7061', '01', '7060', '03', 'за кредитами, що отримані від інших організацій', 
    1642);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7061', '02', '7060', '04', 'амортизація дисконту (премії) за кредитами, що отримані від інших фінансових організацій', 
    1643);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7080', '11', '7130', '11', 'за залишок по внутрішніх рахунках', 
    1651);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7080', '10', '7130', '10', 'за міжрегіональні розрахунки по залученню коштів на пільгових умовах', 
    1650);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7080', '12', '7130', '12', 'за міжрегіональні розрахунки по залученню коштів в іноземній валюті за домовленістю сторін', 
    1652);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7080', '07', '7130', '07', 'за коштами по інших розрахунках', 
    1649);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7080', '06', '7130', '06', 'за коштами, отриманими з централізованого фонду кредитних ресурсів регіонального управління', 
    1648);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7080', '03', '7130', '03', 'за кредитні ресурси, отримані з МБК (централізована заборгованість)', 
    1646);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7080', '02', '7130', '02', 'за міжрегіональні розрахунки по залученню коштів за домовленістю сторін', 
    1645);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7080', '01', '7130', '01', 'за коштами, отриманими з централізованого фонду кредитних ресурсів Правління', 
    1644);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7080', '05', '7130', '05', 'за коштами, отриманими на виконання цільових програм', 
    1647);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7096', '01', '7140', '01', 'процентні витрати за номінальною ставкою', 
    1653);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7096', '02', '7140', '1 ', 'амортизація дисконту', 
    1654);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7099', '05', '7141', '03', 'за коштами суб`єктів господарювання', 
    1657);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7099', '03', '7141', '02', 'проценти, сплачені НБУ за використання коштів обов`язкових резервів', 
    1656);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7099', '07', '7141', '05', 'за коштами фізичних осіб', 
    1659);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7099', '06', '7141', '04', 'за коштами органів державної влади', 
    1658);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7099', '01', '7141', '01', 'за коштами банків', 
    1655);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7100', '18', '7500', '18', 'за послуги банкам-еквайрам по обслуговуванню БПК МПС VISA Ощадбанку в частині видачі готівки', 
    1314);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7100', '21', '7500', '21', 'за  купівлю готівкових коштів для підприємства поштового зв`язку `Укрпошта` на виплату пенсії', 
    1315);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7100', '23', '7500', '23', 'за купівлю готівкових коштів для підприємств поштового зв`язку `Укрпошта` на інші потреби, крім випл', 
    1316);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7100', '06', '7500', '06', 'за обробку платежів', 
    1663);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7100', '08', '7500', '08', 'інші комісійні витрати', 
    1664);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7100', '09', '7500', '09', 'за послуги процесингових центрів по обробці транзакцій за операціями БПК МПС', 
    1665);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7100', '17', '7500', '17', 'за операціями з іменними та дорожніми чеками банків-кореспондентів', 
    1313);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7100', '02', '7500', '02', 'за операціями купівлі-продажу готівкової іноземної валюти', 
    1661);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7100', '01', '7500', '01', 'за відкриття, ведення та закриття рахунків', 
    1660);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7100', '11', '7500', '11', 'за послуги банкам-емітентам по операціях в торгівлі, що здійснені по їх БПК', 
    1309);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7100', '10', '7500', '10', 'за послуги МПС по авторизації та клірингу за операціями з БПК і витрати на підтримку емітованих карт', 
    1308);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7100', '14', '7500', '14', 'за послуги іншим банкам по обслуговуванню рахунків Ощадбанку по БПК', 
    1312);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7100', '13', '7500', '13', 'за послуги МПС по проведенню розрахунків з БПК', 
    1311);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7100', '12', '7500', '12', 'за послуги банкам-еквайрам по обслуговуванню БПК МПС MasterCard  Ощадбанку в частині видачі готівки', 
    1310);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7100', '05', '7500', '05', 'за операціями купівлі-продажу готівкової національної валюти', 
    1662);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7101', '03', '7501', '03', 'витрати за інформаційні послуги бюро кредитних історій', 
    1318);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7101', '01', '7501', '01', 'на кредитне обслуговування', 
    1317);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7103', '02', '7503', '02', 'інші витрати', 
    1319);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7103', '05', '7503', '05', 'за послуги, що надаються депозитарієм НБУ', 
    1321);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7103', '04', '7503', '04', 'нотаріальні послуги, збори за повідомлення осіб, зобов`язаними за векселем, тощо', 
    1320);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7104', '01', '7504', '01', 'за операціями з купівлі-продажу безготівкової іноземної валюти', 
    1322);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7104', '02', '7504', '02', 'за конвертаційними операціями', 
    1323);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7104', '04', '7504', '04', 'розрахунки з застосуванням документарного інкасо', 
    1324);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7104', '05', '7504', '05', 'виконання операцій з документарними акредитивами', 
    1325);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7104', '06', '7504', '06', 'за зовнішньо-економічні та інші перекази', 
    1326);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7104', '09', '7504', '09', 'інші комісійні витрати', 
    1328);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7104', '07', '7504', '07', 'від операцій зі зношеною валютою', 
    1327);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7104', '10', '7504', '10', 'за операціями купівлі-продажу готівкової іноземної валюти', 
    1329);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7108', '01', '7508', '01', 'за операціями з банками', 
    1330);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7108', '02', '7508', '02', 'за операціями з клієнтами', 
    1331);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7109', '08', '7509', '08', 'за послуги процесинговому центру за обробку файлів авторизації', 
    1338);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7109', '09', '7509', '09', 'оплата послуг процесингового центру та МПС за процедури блокування картрахунків, постановку БПК МПС ', 
    1339);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7109', '10', '7509', '10', 'за користування додатковими послугами МПС MasterCard', 
    1340);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7109', '11', '7509', '11', 'інші комісійні витрати по операціях з платіжними картками МПС VISA', 
    1341);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7109', '12', '7509', '12', 'за користування додатковими послугами МПС VISA', 
    1342);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7109', '07', '7509', '07', 'за послуги процесинговому центру за технологічну підтримку пристроїв для здійснення операцій по БПК ', 
    1337);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7109', '06', '7509', '06', 'за послуги процесинговому центру по генерації РІН-кодів та підготовку файла персоналізації для ембос', 
    1336);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7109', '01', '7509', '01', 'за операціями з банками', 
    1332);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7109', '13', '7509', '13', 'за послуги провайдера з передачі текстових повідомлень клієнтам (sms тощо)', 
    1343);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7109', '04', '7509', '04', 'інші витрати', 
    1335);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7109', '03', '7509', '03', 'інші комісійні витрати по операціях з платіжними картками  МПС MasterCard', 
    1334);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7109', '02', '7509', '02', 'за операціями з клієнтами', 
    1333);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7180', '03', '7520', '03', 'за операціями по залученню готівкових коштів між установами банку', 
    1344);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7180', '04', '7520', '04', 'за отримання готівки з внутрішнього рахунку та за інкасо готівки в іноземній валюті', 
    1345);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7180', '06', '7520', '06', 'за операціями по залученню готівкових коштів в іноземній валюті між установами банку за рахунок валю', 
    1347);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7180', '05', '7520', '05', 'за послуги служби інкасації та перевезення цінностей між установами Ощадбанку', 
    1346);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7180', '08', '7520', '08', 'за операціями по залученню готівкових коштів для підкріплення підприємств поштового зв`язку `Укрпошт', 
    1348);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7180', '09', '7520', '09', 'за операціями по залученню готівкових коштів між установами банку  для виплати компенсації грошових ', 
    1349);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7440', '08', '7300', '08', 'оренда виділених каналів тональної частоти (мережі Укртелеком)', 
    1353);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7440', '04', '7300', '04', 'оренда інших виділених каналів зв`язку для передачі даних', 
    1352);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7440', '02', '7300', '02', 'оренда каналів передачі даних за протоколом Х.25 (мережі УкрПак, ГолденТелеком та інших операторів з', 
    1351);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7440', '01', '7300', '01', 'витрати за послуги електронної пошти НБУ та СЕП', 
    1350);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7440', '09', '7300', '09', 'супроводження програмного забезпечення корпоративної електронної пошти FOSSMAIL', 
    1354);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7441', '06', '7301', '06', 'технічна підтримка телекомунікаційного обладнання корпоративної інформаційної мережі', 
    1359);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7441', '07', '7301', '07', 'радіотелефонний зв`язок (для служб охорони,інкасації, тощо)', 
    1360);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7441', '05', '7301', '05', 'за користування системою REUTERS', 
    1358);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7441', '03', '7301', '03', 'за послуги зв`язку по операціях з БПК МПС', 
    1357);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7441', '02', '7301', '02', 'витрати за користування іншими системами зв`язку', 
    1356);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7441', '08', '7301', '08', 'оренда каналів передачі даних Frame Relay та MPLS (мережі Укртелеком та інших операторів зв`язку)', 
    1361);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7441', '09', '7301', '09', 'за користування системою S.W.I.F.T', 
    1362);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7441', '01', '7301', '01', 'за користування мережею "Інтернет"', 
    1355);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7442', '17', '7450', '11', 'за користування цифровим телефонним зв`язком (мережі CDMA)', 
    1371);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7442', '16', '7450', '10', 'міжміські та міжнародні телефонні переговори', 
    1370);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7442', '19', '7450', '13', 'за користування мобільним зв`язком підрозділами інкасації', 
    1373);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7442', '20', '7450', '14', 'за користування мобільним зв`язком іншими структурними підрозділами', 
    1374);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7442', '18', '7450', '12', 'витрати на встановлення міського телефонного апарата', 
    1372);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7442', '15', '7450', '09', 'міські телефонні переговори', 
    1369);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7442', '02', '7450', '04', 'за послуги телексного (телеграфного) зв`язку', 
    1364);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7442', '06', '7450', '05', 'за користування спецзв`язком', 
    1365);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7442', '07', '7450', '06', 'утримання відомчих АТС', 
    1366);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7442', '12', '7450', '07', 'за послуги зв`язку по операціях в системі Western Union та  інших систем грошових переказів', 
    1367);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7442', '14', '7450', '08', 'абонплата за послуги міської телефонної мережі', 
    1368);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7442', '01', '7450', '03', 'поштові витрати', 
    1363);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7705', '16', '7707', '06', 'відрахування в резерв для відшкодування можливих втрат від фінансової дебіторської заборгованості  (', 
    1385);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7705', '15', '7707', '06', 'відрахування в резерв для відшкодування можливих втрат від фінансової дебіторської заборгованості  (', 
    1384);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7705', '14', '7707', '05', 'зменшення резерву під дебіторську заборгованість за торговими операціями з клієнтами  (рахунки 2 кла', 
    1383);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7705', '13', '7707', '05', 'зменшення резерву під дебіторську заборгованість за торговими операціями з клієнтами  (рахунки 2 кла', 
    1382);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7705', '12', '7707', '04', 'відрахування в резерв для відшкодування можливих втрат від дебіторської заборгованості за торговими ', 
    1381);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7705', '18', '7707', '07', 'зменшення резерву під фінансову дебіторську заборгованість   (рахунки 3 класу)', 
    1387);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7705', '17', '7707', '07', 'зменшення резерву під фінансову дебіторську заборгованість  (рахунки 3 класу)', 
    1386);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7705', '07', '7707', '02', 'зменшення резерву під дебіторську заборгованість за іншими фінансовими активами  (рахунки 2 класу)', 
    1378);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7705', '05', '7707', '02', 'зменшення резерву під дебіторську заборгованість за іншими фінансовими активами (рахунки 2 класу)', 
    1377);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7705', '03', '7707', '01', 'відрахування в резерв для відшкодування можливих втрат від дебіторської заборгованості за іншими фін', 
    1376);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7705', '01', '7707', '01', 'відрахування в резерв для відшкодування можливих втрат від дебіторської заборгованості за іншими фін', 
    1375);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7705', '11', '7707', '04', 'відрахування в резерв для відшкодування можливих втрат від дебіторської заборгованості за торговими ', 
    1380);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7705', '10', '7707', '03', 'погашення суми дебіторської заборгованості, списаної раніше за рахунок сформованого резерву', 
    1379);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7720', '49', '7707', '22', 'зменшення резерву за простроченими іншими нарахованими доходами та іншими нарахованими доходами, що ', 
    1406);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7720', '48', '7707', '25', 'відрахування в резерви за простроченими іншими нарахованими доходами та іншими нарахованими доходами', 
    1405);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7720', '47', '7707', '24', 'зменшення резерву за іншими нарахованими доходами за наданими гарантіями, що неотримані від банків', 
    1404);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7720', '34', '7707', '14', 'відрахування в резерви за простроченими іншими нарахованими доходами та іншими нарахованими доходами', 
    1394);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7720', '45', '7707', '22', 'зменшення резерву за простроченими іншими нарахованими доходами та іншими нарахованими доходами, що ', 
    1402);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7720', '33', '7707', '13', 'відрахування в резерви за простроченими іншими нарахованими доходами та іншими нарахованими доходами', 
    1393);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7720', '26', '7707', '12', 'зменшення резерву за іншими нарахованими доходами за кредитними операціями, що неотртимані від фізич', 
    1392);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7720', '25', '7707', '11', 'відрахування в резерви за іншими нарахованими доходами за кредитними операціями, що неотртимані від ', 
    1391);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7720', '24', '7707', '10', 'зменшення резерву за іншими нарахованими доходами за кредитними операціями, що неотртимані від суб`є', 
    1390);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7720', '23', '7707', '09', 'відрахування в резерви за іншими нарахованими доходами за кредитними операціями, що неотртимані від ', 
    1389);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7720', '12', '7707', '08', 'погашення суми заборгованості за нарахованими доходами, списаної раніше за рахунок сформованого резе', 
    1388);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7720', '44', '7707', '21', 'відрахування в резерви  за простроченими іншими нарахованими доходами та іншими нарахованими доходам', 
    1401);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7720', '43', '7707', '20', 'зменшення резерву за простроченими іншими нарахованими доходами та іншими нарахованими доходами за к', 
    1400);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7720', '38', '7707', '15', 'зменшення резерву за простроченими іншими нарахованими доходами та іншими нарахованими доходами, що ', 
    1395);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7720', '39', '7707', '16', 'зменшення резерву за простроченими іншими нарахованими доходами та іншими нарахованими доходами, що ', 
    1396);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7720', '46', '7707', '23', 'відрахування в резерви за іншими нарахованими доходами за наданими гарантіями, що неотримані від бан', 
    1403);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7720', '41', '7707', '18', 'зменшення резерву за простроченими іншими нарахованими доходами та іншими нарахованими доходами за к', 
    1398);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7720', '42', '7707', '19', 'відрахування в резерви  за простроченими іншими нарахованими доходами та іншими нарахованими доходам', 
    1399);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('7720', '40', '7707', '17', 'відрахування в резерви  за простроченими іншими нарахованими доходами та іншими нарахованими доходам', 
    1397);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('9010', '00', '9031', '04', 'Прості гарантії, що отримані від банків', 
    1407);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('9015', '00', '9036', '01', 'Контргарантії, що отримані від банків ', 
    1408);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('9020', '01', '9000', '01', 'гарантії, надані суб`єктам господарювання, які забезпечені грошовими коштами', 
    1409);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('9020', '02', '9000', '02', 'гарантії, надані суб`єктам господарювання, які  забезпечені частково грошовими коштами та/або іншим ', 
    1410);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('9023', '01', '9003', '01', 'авальовані векселі, що надані клієнтам ММСБ', 
    1411);
Insert into TRANSFER_2017
   (R020_OLD, OB_OLD, R020_NEW, OB_NEW, COMM, 
    ID1)
 Values
   ('9023', '02', '9003', '02', 'авальовані векселі, що надані  клієнтам КБ', 
    1412);
COMMIT;
