CREATE OR REPLACE FORCE VIEW BARS.V_STZAH
(
   ID,
   ZAHID,
   PRODU
)
AS
   SELECT '1' id,
          'Котли з використанням будь-яких видів палива та енергії (за винятком природного газу та електроенергії (крім  електричного теплоакумуляційного обігріву та гарячого водопостачання) та відповідного додаткового обладнання і матеріалів до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220257','220380') PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          'Котли з використанням будь-яких видів палива та енергії (за винятком природного газу та електроенергії (крім  електричного теплоакумуляційного обігріву та гарячого водопостачання) та відповідного додаткового обладнання і матеріалів до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220257','220380') PRODU
     FROM DUAL
   UNION ALL
   SELECT '3' id,
          'Котли з використанням будь-яких видів палива та енергії (за винятком природного газу та електроенергії (крім  електричного теплоакумуляційного обігріву та гарячого водопостачання) та відповідного додаткового обладнання і матеріалів до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220257','220380') PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          'Котли з використанням будь-яких видів палива та енергії (за винятком природного газу та електроенергії (крім  електричного теплоакумуляційного обігріву та гарячого водопостачання) та відповідного додаткового обладнання і матеріалів до них'
             ZAHID,
          '220347' PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          'Котли з використанням будь-яких видів палива та енергії (за винятком природного газу та електроенергії (крім  електричного теплоакумуляційного обігріву та гарячого водопостачання) та відповідного додаткового обладнання і матеріалів до них'
             ZAHID,
          '220347' PRODU
     FROM DUAL
   UNION ALL
   SELECT '3' id,
          'Котли з використанням будь-яких видів палива та енергії (за винятком природного газу та електроенергії (крім  електричного теплоакумуляційного обігріву та гарячого водопостачання) та відповідного додаткового обладнання і матеріалів до них'
             ZAHID,
          '220347' PRODU
     FROM DUAL
   UNION ALL
   SELECT '3' id,
          'Радіатори водяної системи опалення, регулятори температури повітря (в тому числі автоматичні) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '3' id,
          'Вузли обліку води (гарячої, холодної) та теплової енергії, зокрема засоби вимірювальної техніки (прилади обліку, лічильники) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '3' id,
          'Багатозонні (багатотарифні) прилади обліку електричної енергії (лічильники активної електричної енергії) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '3' id,
          'Світлопрозорі конструкції з енергозберігаючим склом (крім однокамерних), у тому числі вікна та балконні двері, та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '3' id,
          'Радіатори водяної системи опалення, регулятори температури повітря (в тому числі автоматичні) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '3' id,
          'Вузли обліку води (гарячої, холодної) та теплової енергії, зокрема засоби вимірювальної техніки (прилади обліку, лічильники) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '3' id,
          'Багатозонні (багатотарифні) прилади обліку електричної енергії (лічильники активної електричної енергії) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '3' id,
          'Світлопрозорі конструкції з енергозберігаючим склом (крім однокамерних), у тому числі вікна та балконні двері, та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          'Радіатори водяної системи опалення, регулятори температури повітря (в тому числі автоматичні), та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          'Рекуператори теплоти вентиляційного повітря та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          'Теплонасосна система для водяної системи опалення та/або гарячого водопостачання та відповідне додаткове обладнання і матеріали до неї'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          'Система сонячного теплопостачання та/або гарячого водопостачання та відповідне додаткове обладнання і матеріали до неї'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          'Вузли обліку води (гарячої, холодної), зокрема засоби вимірювальної техніки (прилади обліку, лічильники) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          'Багатозонні (багатотарифні) прилади обліку електричної енергії (лічильники активної електричної енергії) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          'Обладнання і матеріали для проведення робіт з теплоізоляції (термомодернізації) зовнішніх стін, підвальних приміщень, горищ, покрівель та фундаментів'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          'Світлопрозорі конструкції з енергозберігаючим склом (крім однокамерних), у тому числі вікна та балконні двері, та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          'Радіатори водяної системи опалення, регулятори температури повітря (в тому числі автоматичні), та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          'Рекуператори теплоти вентиляційного повітря та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          'Теплонасосна система для водяної системи опалення та/або гарячого водопостачання та відповідне додаткове обладнання і матеріали до неї'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          'Система сонячного теплопостачання та/або гарячого водопостачання та відповідне додаткове обладнання і матеріали до неї'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          'Вузли обліку води (гарячої, холодної), зокрема засоби вимірювальної техніки (прилади обліку, лічильники) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          'Багатозонні (багатотарифні) прилади обліку електричної енергії (лічильники активної електричної енергії) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          'Обладнання і матеріали для проведення робіт з теплоізоляції (термомодернізації) зовнішніх стін, підвальних приміщень, горищ, покрівель та фундаментів'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          'Світлопрозорі конструкції з енергозберігаючим склом (крім однокамерних), у тому числі вікна та балконні двері, та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          'Радіатори водяної системи опалення, регулятори температури повітря (в тому числі автоматичні), та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          'Рекуператори теплоти вентиляційного повітря та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          'Теплонасосна система для водяної системи опалення та/або гарячого водопостачання та відповідне додаткове обладнання і матеріали до неї'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          'Система сонячного теплопостачання та/або гарячого водопостачання та відповідне додаткове обладнання і матеріали до неї'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          'Вузли обліку води (гарячої, холодної), зокрема засоби вимірювальної техніки (прилади обліку, лічильники) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          'Багатозонні (багатотарифні) прилади обліку електричної енергії (лічильники активної електричної енергії) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          'Обладнання і матеріали для проведення робіт з теплоізоляції (термомодернізації) зовнішніх стін, підвальних приміщень, горищ, покрівель та фундаментів'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          'Світлопрозорі конструкції з енергозберігаючим склом (крім однокамерних), у тому числі вікна та балконні двері, та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          'Радіатори водяної системи опалення, регулятори температури повітря (в тому числі автоматичні), та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          'Рекуператори теплоти вентиляційного повітря та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          'Теплонасосна система для водяної системи опалення та/або гарячого водопостачання та відповідне додаткове обладнання і матеріали до неї'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          'Система сонячного теплопостачання та/або гарячого водопостачання та відповідне додаткове обладнання і матеріали до неї'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          'Вузли обліку води (гарячої, холодної), зокрема засоби вимірювальної техніки (прилади обліку, лічильники) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          'Багатозонні (багатотарифні) прилади обліку електричної енергії (лічильники активної електричної енергії) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          'Обладнання і матеріали для проведення робіт з теплоізоляції (термомодернізації) зовнішніх стін, підвальних приміщень, горищ, покрівель та фундаментів'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          'Світлопрозорі конструкції з енергозберігаючим склом (крім однокамерних), у тому числі вікна та балконні двері, та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL;


GRANT SELECT ON BARS.V_STZAH TO BARS_ACCESS_DEFROLE;

GRANT SELECT ON BARS.V_STZAH TO START1;
