delete from bars.F090;

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('101', 'розрахунки за імпорт продукції на умовах оплати по факту поставки, у тому числі за імпорт на умовах кредитування (відстрочки платежу за поставлений товар та під процент), крім імпорту без  увезення на митну територію України', null, '21', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('102', 'розрахунки за імпорт робіт, послуг на умовах оплати по факту поставки, у тому числі за імпорт на умовах кредитування; страхові відшкодування, у тому числі за договорами перестрахування. ', null, '21, 25', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('103', 'розрахунки за імпорт продукції на умовах попередньої оплати,  крім імпорту без  увезення на митну територію України ', null, '45', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('104', 'розрахунки за імпорт робіт, послуг на умовах попередньої оплати', null, '45, 25', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('105', 'розрахунки за імпорт продукції без її увезення на митну територію України', null, '25', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('110', 'розрахунки за експорт товарів (продукції, робіт, послуг), у тому числі за експорт на умовах кредитування, страхові відшкодування, у тому числі за договорами перестрахування', '01', null, NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('120', 'роялті (оплата прав інтелектуальної власності)', '31', '39', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values  ('121', 'повернення від нерезидентів/нерезидентам (крім помилкових коштів) у зв’язку з невиконанням своїх зобов’язань за експортними/імпортними операціями (невикористання коштів), у тому числі повернення іноземної валюти валюти, яка була раніше куплена на міжбанківському валютному ринку України ', '07', '36', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('122', 'відшкодування збитків, неустойки (штрафи, пені), платежі за судовими рішеннями', '35', '43', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('201', 'надання кредиту, позики на користь резидента від банка - нерезидента', '03', NULL, NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('202', 'надання кредиту, позики на користь резидента від нерезидента - юридичної або фізичної особи (не банку)', '03', NULL, NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('203', 'надання кредиту, позики на користь нерезидента', '03', '26', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('210', 'погашення банком кредиту, отриманого від банку-нерезидента  ', '06', '24', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('211', 'погашення клієнтом кредиту, позики, отриманої від банку, у тому числі погашення за рахунок надходжень на користь клієнта від нерезидента, якщо в платіжних документах зазначено реквізити кредитного договору, укладеного між банком та клієнтом, розрахунки за договорами фінансового лізингу', '06', '34', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values  ('212', 'погашення банком кредиту, позики, отриманої від юридичної або фізичної особи (не банку)', '06', '35', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('213', 'погашення клієнтом кредиту, позики, отриманої від нерезидента-юридичної або фізичної особи (не банку)', '06', '23', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('214', 'погашення кредиту, позики, наданої нерезиденту', '06', NULL, NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('220', 'оплата за користування кредитами, позиками, у тому числі проценти за відстрочку платежу за поставлений товар та проценти за договорами фінансового лізингу, якщо сума процентів за такими договорами сплачується окремою сумою', '23', '33', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('301', 'розміщення коштів на депозит', '04', '27', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('302', 'повернення коштів з депозиту ', '06', '30', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('303', 'доходи від розміщених депозитів (вкладів)', '24', '33', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('401', 'участь у капіталі', '08', '20', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('402', 'здійснення/повернення інвестицій (крім участі у капіталі)', '02', '29', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('403', 'доходи від інвестицій (крім повернення дивідендів) ', '22', '32', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('404', 'повернення дивідендів', NULL, '46', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('501', 'перекази за поточними неторговельними операціями: приватні перекази, заробітна плата, компенсаційні виплати (у тому числі за страховими випадками на користь фізичних осіб), членські внески (крім вступних/членських внесків юридичних осіб), аліменти, спадщина, пенсії, стипендії та інші соціальні виплати, оплата фізичними особами на користь нерезидентів за товари власного споживання, за проживання в готелі, за навчання, за лікування ', '30', '38', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('502', 'вступні/членські внески юридичних осіб ', '30', '38', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('503', 'розрахунки за дорученням Фонду гарантування вкладів фізичних осіб', NULL, NULL, NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('504', 'гуманітарна допомога', '05', NULL, NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('505', 'утримання представництва', '32', '40', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('506', 'розрахунки з платіжними системами, надходження/перекази на користь та за дорученням небанківських фінансових установ, що здійснюють перекази фізичних осіб, на користь та за дорученням національного оператора поштового зв’язку України за поштовий обмін', '29', '37', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('507', 'податки, збори, мито, розрахунки за квотою', '33', '41', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('601', 'розрахунки за операціями з купівлі/продажу банківських металів', '17', '44', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('602', 'розрахунки за операціями конвертації однієї іноземної валюти в іншу, у тому числі за неттингом таких операцій', '28', '28', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('603', 'державне фінансування', '34', '42', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('604', 'за іншими операціями', '09', '31', NULL, NULL, NULL);

Insert into BARS.F090
   (F090, TXT, F552, F555, D_OPEN, D_CLOSE, D_MODE)
 Values ('999', 'сума надходжень в іноземній валюті, що підлягають обов’язковому продажу (довідковий показник)', '36', null, NULL, NULL, NULL);

COMMIT;
