delete from OZNAKA_351;
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (1, 'боржник/контрагент (крім іншого банку) прострочив погашення боргу перед банком більше ніж на 90 календарних днів. Банк-боржник/контрагент прострочив погашення боргу/не виконав вимогу банку більше ніж на 30 календарних днів', '164100000');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (2, 'сформований банком резерв під зменшення корисності наданого боржнику фінансового активу становить 50 та більше відсотків боргу', '164216501');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (3, 'унесені зміни до умов договору, у тому числі пов''язані з реструктуризацією боргу [крім реструктуризації боргу, яка здійснена відповідно до вимог законів України щодо фінансової реструктуризації або реструктуризації зобов''язань громадян України за кредитами в іноземній валюті, за якою боржником виконуються умови договору], передбачають: прощення частини боргу та/або, капіталізацію або заміну на інший актив нарахованих та несплачених відсотків за більш ніж 90 календарних днів поспіль', '164216502');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (4, 'боржник/контрагент заявив про банкрутство', '164216503');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (5, 'боржника/контрагента визнано банкрутом/розпочато процедуру ліквідації (припинення) юридичної особи в установленому законодавством порядку/банк-боржник за рішенням Національного банку віднесено до категорії неплатоспроможних/відкликано банківську ліцензію', '164216504');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (6, 'банк порушив проти боржника/контрагента справу про банкрутство у встановленому законодавством України порядку', '164216505');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (7, 'банк ухвалив рішення про конвертацію (переведення) частини або всієї суми боргу боржника/контрагента в капітал боржника/контрагента (за винятком випадків, передбачених законом України щодо фінансової реструктуризації)', '164216506');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (8, 'хоча б один із зовнішніх рейтингів боржника згідно з міжнародною рейтинговою шкалою, підтверджений агентством (компанією) Standard'||chr(38)||'Poor''s або іншим провідним світовим рейтинговим агентством (компанією), визначеним(ою) цим Положенням, понижено до рівня "дефолт"', '164216507');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (9, 'відбулася повторна/наступна заміна активу на інший актив', '164216508');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (10, 'унесені зміни до умов договору, не пов''язані з реструктуризацією, у частині збільшення строків користування активом, наданим боржнику, який не спроможний погасити борг без реалізації застави, попри відсутність на дату оцінки кредитного ризику прострочення погашення боргу', '164216509');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (11, 'за одним із активів боржника/контрагента відбулося списання боргу за рахунок сформованого резерву', '164216510');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (12, 'за одним із активів боржника/контрагента відбувся продаж зі збитком в обсязі 20 або більше відсотків боргу', '164216511');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (13, 'за одним із активів боржника, який є лізингоотримувачем, відбулось анулювання банком лізингового договору у зв''язку з порушенням боржником (лізингоотримувачем) умов договору', '164216512');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (14, 'продаж банком активу/відступлення права вимоги за активом із відстроченням платежу більше ніж на сім календарних днів відповідно до умов договору про продаж активу/відступлення права вимоги (у тому числі із урахуванням унесених змін до договору про продаж активу), який супроводжується однією або більше з таких подій:на дату оцінки кредитного ризику контрагент, що купує актив, сплатив банку менше 30 відсотків його вартості/сплату за активом не здійснював;контрагент сплачує за активом одним платежем у кінці строку дії договору про продаж активу або сплачує більшу частку вартості активу наближено до кінця строку дії договору про продаж активу', '164216513');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (15, 'є прострочення боргу більше ніж на 90 календарних днів [з дати виконання зобов''язання (платежу) відповідно до умов договору] за: урахованим векселем; факторинговою операцією', '164216514');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (16, 'боржника, що є емітентом цінних паперів, згідно з порядком, передбаченим нормативно-правовим актом Національної комісії з цінних паперів та фондового ринку, уключено до списку емітентів, що мають ознаки фіктивності', '164216515');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (17, 'є затримка погашення номінальної вартості або процентів понад сім календарних днів за борговими цінними паперами', '164216516');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (18, 'у банку: немає фінансової звітності боржника - юридичної особи за останній звітний період понад три місяці після термінів подання, визначених у пункті 48 розділу IV цього Положення, та/або немає розшифрування даних форми N 2 (2-м, 2-мс) "Звіт про фінансові результати" (графа 2000) Положень (стандартів) бухгалтерського обліку 1 або 25 річної фінансової звітності боржника - юридичної особи за останній звітний рік щодо структури доходів; фінансова звітність боржника, за даними якої банк здійснив оцінку фінансового стану такого боржника, не відповідає вимогам Закону України "Про бухгалтерський облік та фінансову звітність в Україні" / вимогам законодавства країни місцезнаходження боржника-нерезидента', '164216517');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (19, 'боржник скористався передбаченою умовами договору про надання кредиту можливістю змін попередніх умов виконання ним зобов''язань на такі, що відповідають ознакам, визначеним у цьому пункті', '164216518');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (20, 'значення хоча б одного з кількісних показників фінансової стійкості (коефіцієнти DSCRi, DSCRc, ICRc, LLCRc) юридичної особи - боржника за кредитом під інвестиційний проект є меншим 1', '164216519');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (21, 'значення кількісного показника фінансової стійкості (коефіцієнт Чкк) юридичної особи - боржника за кредитом під інвестиційний проект є більшим, ніж 90 %', '164216520');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (22, 'критерії оцінки класу юридичної особи - боржника за кредитом під інвестиційний проект та їх характеристики, крім визначених у підпунктах 19 та 20 пункту 165 розділу XVII цього Положення 351кількісних показників фінансової стійкості (DSCRi, DSCRc, ICRc, LLCRc та Чкк), ураховані в обсязі меншому, ніж 70 % від переліку, установленого в додатку 10 до Положення 351', '164216521');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (23, 'сплати боргу боржником (крім боргу за кредитом під інвестиційний проект; кредитом, наданим на виробничі цілі із сезонним або циклічним характером виробництва; кредитом, наданим боржнику, що є учасником групи, консолідована/комбінована звітність якого свідчить про можливість забезпечення його фінансової стійкості) в обсязі менше ніж обсяг доходів, визнаних банком згідно з нормативно-правовими актами Національного банку з бухгалтерського обліку', '164216601');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (24, 'унесення змін до умов договору, пов''язаних із реструктуризацією боргу [крім: реструктуризації боргу, яка здійснена відповідно до вимог законів України щодо фінансової реструктуризації або реструктуризації зобов''язань громадян України за кредитами в іноземній валюті, за якою боржником виконуються умови договору], яка пов''язана з фінансовими труднощами боржника, що мають такі ознаки:клас боржника, визначений банком на момент проведення реструктуризації, - не вище 8 (для боржників - юридичних осіб, крім банків, бюджетних установ та юридичних осіб - боржників за кредитом під інвестиційний проект) / 4 (для інших боржників), та/або на момент проведення реструктуризації боржник прострочив погашення боргу більше ніж на 30 календарних днів', '164216602');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (25, 'унесення змін до умов договору, за відсутності яких актив був би віднесений банком до категорії непрацюючих активів', '164216603');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (26, 'зменшення відсоткової ставки більш ніж на 30 відсотків від первинних умов договору внаслідок зміни попередніх умов договору, не пов''язаних із реструктуризацією, не спричинене зміною ринкових умов', '164216604');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (27, 'в боржника - юридичної особи на звітну дату немає власних/орендованих основних засобів або іншого майна, необхідного для здійснення діяльності (виробничого обладнання, складських приміщень, транспортних засобів, торгових або офісних приміщень тощо), що генерує грошові потоки в обсягах, необхідних для погашення кредиту', '164216605');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (28, 'в банку немає інформації щодо кінцевих бенефіціарних власників (контролерів) боржника - юридичної особи', '164216606');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (29, 'в штаті боржника - юридичної особи немає персоналу, необхідного для здійснення операційної діяльності', '164216607');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (30, 'боржника немає - юридичної особи за зазначеною ним адресою місцезнаходження', '164216608');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (31, 'боржник скористався передбаченою умовами договору про надання кредиту можливістю змін попередніх умов виконання ним зобов''язань на такі, що відповідають ознакам, визначеним у цьому пункті', '164216609');
Insert into BARS.OZNAKA_351 (ID, TXT, KOD) Values
   (32, 'немає ознак згідно з пунктами 164 - 166 Положення N 351', '000000000');
COMMIT;
