set lines 1000
set trimspool on
set serveroutput on size 1000000

prompt Создание / Обновление операции KA7
prompt Наименование операции: КA7 Списання довідки ф.377 за купівлю інвалюти у нерезидента
declare
  cnt_  number;
begin
  --------------------------------
  -- Основные свойства операции --
  --------------------------------
  begin
    insert into tts(tt, name, dk, nlsm, kv, nlsk, kvk, nlss, nlsa, nlsb, mfob, flc, fli, flv, flr, s, s2, sk, proc, s3800, rang, flags, nazn)
    values ('KA7', 'КA7 Списання довідки ф.377 за купівлю інвалюти у нерезидента', 1, '#(nbs_ob22 (''9910'',''01''))', 980, '#(nbs_ob22 (''9821'',''29''))', 980, null, null, null, null, 0, 0, 0, 0, 'nvl2(f_dop(#(REF),''ND377''),100,0)', null, null, null, null, null, '0000100000000000000000000000000000000100000000000000000000000000', 'Списання довідки ф.377 за купівлю іноземної валюти у нерезидента ');
  exception
    when dup_val_on_index then 
      update tts
         set tt='KA7', name='КA7 Списання довідки ф.377 за купівлю інвалюти у нерезидента', dk=1, nlsm='#(nbs_ob22 (''9910'',''01''))', kv=980, nlsk='#(nbs_ob22 (''9821'',''29''))', kvk=980, nlss=null, nlsa=null, nlsb=null, mfob=null, flc=0, fli=0, flv=0, flr=0, s='nvl2(f_dop(#(REF),''ND377''),100,0)', s2=null, sk=null, proc=null, s3800=null, rang=null, flags='0000100000000000000000000000000000000100000000000000000000000000', nazn='Списання довідки ф.377 за купівлю іноземної валюти у нерезидента '
       where tt='KA7';
  end;
  --------------------------------
  ----------- Реквизиты ----------
  --------------------------------
  delete from op_rules where tt='KA7';
  --------------------------------
  ------ Связанные операции ------
  --------------------------------
  delete from ttsap where tt='KA7';
  --------------------------------
  ------- Балансовые счета -------
  --------------------------------
  delete from ps_tts where tt='KA7';
  --------------------------------
  -------- Виды документов -------
  --------------------------------
  delete from tts_vob where tt='KA7';
  --------------------------------
  -------- Группы контроля -------
  --------------------------------
  delete from chklist_tts where tt='KA7';
  --------------------------------
  ------------- Папки ------------
  --------------------------------
  delete from folders_tts where tt='KA7';
end;
/
commit;
