set lines 1000
set trimspool on
set serveroutput on size 1000000

prompt Создание / Обновление операции K46
prompt Наименование операции: K46 (доч.PS3) Комісія за перерах.коштів
declare
  cnt_  number;
begin
  --------------------------------
  -- Основные свойства операции --
  --------------------------------
  begin
    insert into tts(tt, name, dk, nlsm, kv, nlsk, kvk, nlss, nlsa, nlsb, mfob, flc, fli, flv, flr, s, s2, sk, proc, s3800, rang, flags, nazn)
    values ('K46', 'K46 (доч.PS3) Комісія за перерах.коштів', 0, null, 980, '#(nbs_ob22 (''6510'',''06''))', 980, null, null, '#(nbs_ob22 (''6510'',''06''))', null, 0, 0, 0, 0, 'F_TARIF(46, #(KVA), #(NLSA), #(S) )', null, null, null, null, null, '0000100000000000000000000000000000000100000000000000000000000000', 'Комісія за перерахування залишку коштів згідно дод.угоди від 16/10/2008р.');
  exception
    when dup_val_on_index then 
      update tts
         set tt='K46', name='K46 (доч.PS3) Комісія за перерах.коштів', dk=0, nlsm=null, kv=980, nlsk='#(nbs_ob22 (''6510'',''06''))', kvk=980, nlss=null, nlsa=null, nlsb='#(nbs_ob22 (''6510'',''06''))', mfob=null, flc=0, fli=0, flv=0, flr=0, s='F_TARIF(46, #(KVA), #(NLSA), #(S) )', s2=null, sk=null, proc=null, s3800=null, rang=null, flags='0000100000000000000000000000000000000100000000000000000000000000', nazn='Комісія за перерахування залишку коштів згідно дод.угоди від 16/10/2008р.'
       where tt='K46';
  end;
  --------------------------------
  ----------- Реквизиты ----------
  --------------------------------
  delete from op_rules where tt='K46';
  --------------------------------
  ------ Связанные операции ------
  --------------------------------
  delete from ttsap where tt='K46';
  --------------------------------
  ------- Балансовые счета -------
  --------------------------------
  delete from ps_tts where tt='K46';
  --------------------------------
  -------- Виды документов -------
  --------------------------------
  delete from tts_vob where tt='K46';
  --------------------------------
  -------- Группы контроля -------
  --------------------------------
  delete from chklist_tts where tt='K46';
  --------------------------------
  ------------- Папки ------------
  --------------------------------
  delete from folders_tts where tt='K46';
end;
/
commit;
