--  
--  справочник KL_F20 для #20    с 27.12.2017
--                в поле R013  занесены значения R011

exec bc.home;

delete from kl_f20;

-- записи для балансового 2601

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2601', '2',  'X',  '1',  'X',  '4',  '05826011', '2601 кошти на вимогу, нац.валюта' );

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2601', '2',  'X',  '1',  'X',  '5',  '05926011', '2601 строкові кошти, нац.валюта' );

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2601', '2',  'X',  '2',  'X',  '4',  '15826011', '2601 кошти на вимогу, іноз.валюта' );

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2601', '2',  'X',  '2',  'X',  '5',  '15926011', '2601 строкові кошти, іноз.валюта' );

-- записи для балансового 2701

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2701', '2',  'X',  '1',  'X',  '1',  '09327011', '2701 кошти, отриманi вiд мiжнар.фiнанс.органiзацiй. НВ' );

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2701', '2',  'X',  '1',  'X',  '2',  '09327011', '2701 кошти, отриманi вiд мiжнар.фiнанс.органiзацiй. НВ' );

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2701', '2',  'X',  '1',  'X',  '3',  '09327012', '2701 кошти, отриманi вiд iнших органiзацiй. НВ' );

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2701', '2',  'X',  '2',  'X',  '1',  '19327011', '2701 кошти, отриманi вiд мiжнар.фiнанс.органiзацiй. IВ' );

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2701', '2',  'X',  '2',  'X',  '2',  '19327011', '2701 кошти, отриманi вiд мiжнар.фiнанс.органiзацiй. IВ' );

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2701', '2',  'X',  '2',  'X',  '3',  '19327012', '2701 кошти, отриманi вiд iнших органiзацiй. IВ' );


-- записи для балансового 2706

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2706', '1',  'X',  '1',  'X',  '3',  '71927061', '2706 неаморт.дисконт за кредитами iнш.орг-цiй, актив. НВ' );

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2706', '2',  'X',  '1',  'X',  '3',  '71927063', '2706 неаморт.дисконт за кредитами iнш.орг-цiй, пасив, НВ' );

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2706', '1',  'X',  '1',  'X',  '1',  '71927069', '2706 неаморт.дисконт за коштами мiжн.фiн.орг-цiй, актив, НВ' );

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2706', '1',  'X',  '1',  'X',  '2',  '71927069', '2706 неаморт.дисконт за коштами мiжн.фiн.орг-цiй, актив, НВ' );

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2706', '2',  'X',  '1',  'X',  '1',  '71927065', '2706 неаморт.дискот за коштами мiжн.фiн.орг-цiй, пасив, НВ' );

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2706', '2',  'X',  '1',  'X',  '2',  '71927065', '2706 неаморт.дискот за коштами мiжн.фiн.орг-цiй, пасив, НВ' );

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2706', '1',  'X',  '2',  'X',  '3',  '81927061', '2706 неаморт.дисконт за кредитами iнш.орг-цiй, актив, IВ' );

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2706', '2',  'X',  '2',  'X',  '3',  '81927063', '2706 неаморт.дисконт за кредитами iнш.орг-цiй, пасив, IВ' );

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2706', '1',  'X',  '2',  'X',  '1',  '81927069', '2706 неаморт.дисконт за коштами мiжн.фiн.орг-цiй, актив, IВ' );

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2706', '1',  'X',  '2',  'X',  '2',  '81927069', '2706 неаморт.дисконт за коштами мiжн.фiн.орг-цiй, актив, IВ' );

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2706', '2',  'X',  '2',  'X',  '1',  '81927065', '2706 неаморт.дискот за кроштами мiжн.фiн.орг-цiй, пасив, IВ' );

insert into kl_f20 ( KF, R020, T020, K030, R031, S181, R013, DDD, TXT )
         values ( '20', '2706', '2',  'X',  '2',  'X',  '2',  '81927065', '2706 неаморт.дискот за кроштами мiжн.фiн.орг-цiй, пасив, IВ' );


commit;


