Repository: AnnaLut/abs3
Catalog: web/crkr/barsroot/docinput/App_LocalResources/DocInput.aspx.*.resx
Languages: uk

# btFile.ToolTip
source: Print ticket in text mode
uk: Вигрузити тікет в текстовий файл

# DocN.ToolTip
source: Number of document
uk: Номер документа

# LabelDocDate.Text
source: from
uk: від

# DocD_TextBox.ToolTip
source: Date of document
uk: Дата документа

# LabelSum.Text
source: Sum of payment
uk: Сума платежу

# SumA.ToolTip
source: A sum is
uk: Сума

# SumC.ToolTip
source: Sum of payment
uk: Сума платежу

# SumB.ToolTip
source: A sum is
uk: Сума

# CrossRat.ToolTip
source: A cross rat
uk: Крос курс

# Sk.ToolTip
source: Character of CashPlan
uk: Символ КасПлана

# LabelNarrative.Text
source: Setting of payment
uk: Призначення платежу

# lbHint.Text
source: (click by the right button is a default value)
uk: (клік правою клавішею - значення за умовчанням)

# Nazn.ToolTip
source: Setting of payment
uk: Призначення платежу

# DatV.ToolTip
source: Date of currency transaction
uk: Дата валютування

# DatV2.ToolTip
source: Date of currency transaction
uk: Дата валютування

# Message1.Value
source: Incorrect check bit!
uk: Невірний контрольний розряд!

# Message2.Value
source: Information is successfully stored in a reference book!
uk: Дані успішно збережені в довіднику!

# Message3.Value
source: A document is successfully accepted!
uk: Документ успішно прийнятий!

# Message4.Value
source: Reference
uk: Референс

# Message5.Value
source: It is impossible to calculate setting by default!
uk: Неможливо обчислити призначення за умовчанням!

# Message6.Value
source: It is impossible to calculate a formula!
uk: Неможливо обчислити формулу!

# Message7.Value
source: An account is not found
uk: Рахунок не знайдений

# Message8.Value
source: You indeed want to enter a document with ticket
uk: Ви дійсно хочете ввести документ з тікетом

# Message9.Value
source: The sum of document exceeds the amount of balance. To continue?
uk: Сума документа перевищує залишок на рахунку. Продовжити?

# Message10.Value
source: Less
uk: Менше

# Message11.Value
source: characters.
uk: символів.

# Message12.Value
source: A value must be numerical.
uk: Значення повинне бути числовим.

# Message13.Value
source: Error of check bit of OKPO.
uk: Помилка контрольного розряду ОКПО.

# Message14.Value
source: Error of sum.
uk: Помилка суми.

# Message15.Value
source: It is necessary to fill an additional essential element!
uk: Необхідно заповнити додатковий реквізит!

# Message16.Value
source: Impermissible value of essential element
uk: Неприпустиме значення реквізиту

# Message17.Value
source: The fields of accounts and codes of currencies is filled incorrectly.
uk: Неккоректно заповнені поля рахунків і кодів валют.

# Message18.Value
source: Character of cashplan must be numerical!
uk: Символ касплана повинен бути числовим!

# Message19.Value
source: Illegal character of cashplan!
uk: Неприпустимий символ касплана!

# Message20.Value
source: It is not discovered necessary for a digital signature components. Call administrator.
uk: Не виявлено необхідних для цифрового підпису компонентів. Зверніться до адміністратора.

# Message21.Value
source: The system of safety is not initialized. Necessary all of the tools are not set possibly. Call administrator.
uk: Система безпеки НЕ ініціалізована. Можливо не встановлені всі необхідні компоненти. Зверніться до адміністратора.

# Message22.Value
source: Errors at imposition of EDS
uk: Помилки при накладенні ЭЦП

# Message23.Value
source: It is impossible to create the element of ACTIVEX for determination of version of Windows Installer.
uk: Неможливо створити елемент ACTIVEX для визначення версії Windows Installer.

# Message24.Value
source: Length more then 160 symbols (current length
uk: Призначення платежу більше 160 знаків(поточна довжина

# forbtPayIt.Value
source: To pay (Alt + F10)
uk: Сплатити (Alt + F10)

# forbtMenuPrint.Value
source: Print menu
uk: Меню друку

# forbtNewDoc.Value
source: To pass to other operation
uk: Перейти до іншої операції

# forbtPrintDoc.Value
source: To print a document (Alt + F5)
uk: Надрукувати документ (Alt + F5)

# forbtSameDoc.Value
source: To begin the input of new document (Alt + F11)
uk: Почати введення нового документа (Alt + F11)

# forbtSaveAlien.Value
source: To save in a reference book
uk: Зберегти в довіднику

# dF12.InnerText
source: F12 - Reference Book
uk: F12 - Довідник

# Message25.Value
source: Value of sum must be no more 15 symbols
uk: Сума платежу повинна бути менше 15 символів(без коми).

# PageResource.Title
source: Input document
uk: Введення документа

# Message26.Value
source: A primary document fully coincides with an information query. Delete the information query?
uk: Первинний документ повністю співпадає з інформаційним запитом. Видалити інформаційний запит?

# Message27.Value
source: Make information query, specifying OKPO(code) of recipient?
uk: Cформувати інформаційний запит, уточнюючий код ЄДРПОУ одержувача?

# Message28.Value
source: Make information query, specifying ACCOUNT of recipient?
uk: Cформувати інформаційний запит, уточнюющий РАХУНОК одержувача?

# Message29.Value
source: It is edited more than one element. Make information query for the refund of document?
uk: Відредаговано більш ніж один реквізит. Сформувати інформаційний запит на повернення документа?

# Message30.Value
source: Unable to determinate the SEP essential element (QDocs)
uk: Помилка визначення доп.реквізита СЭП

# lbNominal.Text
source: Nominal
uk: Номінал

# Message31.Value
source: Cannot find code currency
uk: Не знайдено код валюти

# Message32.Value
source: Date must be in 10 days range from bankdate
uk: Дата повинна бути в межах 30 днів від банківської.

# Message33.Value
source: Date currency different from the current. Continue?
uk: Дата валютування відрізняється від поточної. Продовжити?

# lbFixValues.Text
source: Extraction is on.
uk: Витяжка вкл.

# cbPriority.Text
source: Urgent
uk: СТП

# cbPriority.ToolTip
source: Urgent payment
uk: Терміновий платіж
