
 
 PROMPT ===================================================================================== 
 PROMPT *** Run *** ========== Scripts /Sql/BARS/function/calp_ar.sql =========*** Run *** ==
 PROMPT ===================================================================================== 
 
  CREATE OR REPLACE FUNCTION BARS.CALP_AR 
( s_   NUMBER, -- сумма капитала
  int_ NUMBER, -- Ном.проц.ставка
  dat1_ date , -- дата "С" вклбчительно
  dat2_ date , -- дата "ПО" вклбчительно
  basey_ int   -- код базы начисления
  )   RETURN NUMBER as  --  05.03.2014 Sta С Арифмеитическим округлением
BEGIN return round ( calp_NR (s_,int_,dat1_,dat2_,basey_) , 0 ) ;
END calp_AR  ;
/
 show err;
 
 
 
 PROMPT ===================================================================================== 
 PROMPT *** End *** ========== Scripts /Sql/BARS/function/calp_ar.sql =========*** End *** ==
 PROMPT ===================================================================================== 
 