
 
 PROMPT ===================================================================================== 
 PROMPT *** Run *** ========== Scripts /Sql/BARS/function/f_ukraine_3000.sql =========*** Run
 PROMPT ===================================================================================== 
 
  CREATE OR REPLACE FUNCTION BARS.F_UKRAINE_3000 RETURN VARCHAR2
/* =============================================================================
-- сбрасывать мне (Кацалап Святослав Миколайович) в ежедневном режиме данные по 
-- количеству и сумме принятых платежей в рамках благотворительной акции с Макдональдсом.
--
-- Реквизиты на которые перечисляются платежи:
-- Рахунок № 26005020043340 МБФ «Україна 3000» (Міжнародний благодійний фонд «Україна 3000»), 
-- відкритий в АТ «Укрексімбанк», код банку 322313, код в ЄДРПОУ 26167513.
--
-- 07.11.2014
-- =============================================================================*/
IS
  FileHandle    UTL_FILE.FILE_TYPE;
  cPath_        VARCHAR2(100) := 'UPLD';
  cOpenMode_    VARCHAR2(1) := 'W';
  cFileName_    VARCHAR2(16) := 'UKRAINE_3000.csv';
  Result        VARCHAR2(3000);
  CRLF          CONSTANT CHAR(2) := CHR(13)||CHR(10); -- Carriage Return+Line Feed
BEGIN

  
  SELECT 'МБФ "Україна 3000".'|| CRLF ||
         'Дані за період з 01/11/2014 по ' || to_char(sysdate,'dd/mm/yyyy hh24:mi') || '.' || CRLF ||
         'Кількість платежів: ' || count(*) || '.' || CRLF ||
         'На суму: ' || trim(to_char(sum(s)/100,'999G999G999G999D99')) || ' грн.'
    INTO Result
              FROM arc_rrp
             WHERE dat_a >= to_date('01/11/2014','dd/mm/yyyy')
               AND mfob='322313'
               AND nlsb='26005020043340'
               AND id_b='26167513';
               
  RETURN Result;
  
END F_UKRAINE_3000;
/
 show err;
 
 
 
 PROMPT ===================================================================================== 
 PROMPT *** End *** ========== Scripts /Sql/BARS/function/f_ukraine_3000.sql =========*** End
 PROMPT ===================================================================================== 
 