
 
 PROMPT ===================================================================================== 
 PROMPT *** Run *** ========== Scripts /Sql/BARS/function/today.sql =========*** Run *** ====
 PROMPT ===================================================================================== 
 
  CREATE OR REPLACE FUNCTION BARS.TODAY 
/* 
   ¬Œ«¬–¿“ “≈ ”Ÿ≈… ƒ¿“€
   =====================

-- Ã‡Í‡ÂÌÍÓ ».¬. 02/08/2017 --
*/
RETURN date
IS
  d_    DATE;
BEGIN
  SELECT trunc(sysdate) INTO d_ from dual;
  RETURN d_;
END;
/
 show err;
 
 
 
 PROMPT ===================================================================================== 
 PROMPT *** End *** ========== Scripts /Sql/BARS/function/today.sql =========*** End *** ====
 PROMPT ===================================================================================== 
 