 PROMPT ===================================================================================== 
 PROMPT *** Run *** ========== Scripts /Sql/BARS/function/zvt_f.sql =========*** Run *** ====
 PROMPT ===================================================================================== 

CREATE OR REPLACE FUNCTION BARS.ZVT_F (NBSD_    VARCHAR2,          -- БС Дебет
                                       NBSK_    VARCHAR2,         -- БС Кредит
                                       BRD_     VARCHAR2, -- Бранч счета-Дебет
                                       BRK_     VARCHAR2, -- Бранс счета-Кредит
                                       tt_      VARCHAR2, -- Код операции по OPLDOK
                                       MFOA_    VARCHAR2,         -- OPER.MFOA
                                       MFOB_    VARCHAR2,         -- OPER.MFOB
                                       TTO_     VARCHAR2 -- Код операции по OPER
                                                        )
   RETURN INT
   RESULT_CACHE
IS
/*
21.02.2018 COBUMMFO-6627
За балансовими рахунками 7301 
"Витрати на інші системи банківського зв’язку" та 7300 "Витрати на СЕП" формуються у папку №27 "Папка Витрати за операціями з клієнтами". Вірна папка має бути №39 "Папка Витрати за внутрішньобанків
ськими операціями".


06.04.2017 COBUSUPABS-5756
Із папки 26 «Доходи» перенести в папку 84 «АВТ.: Доходи» зв’язану (дочірню) операцію BM4 до операції BMY – бухмодель за дебетом рахунок 2909/23 і кредитом 6399/14.

2017-02-07   COBUSUPABS-5433


1.    Із  папки 20 «Початкові внутрішні платежі на рахунки клієнтів» перенести в папку 97 «Авт.Перекриття» операції за кодом PS1.
2.    Із папки 37 «Меморіальні (бухгалтерські) ручні» перенести в папку  80 «Авт. Меморіальні» операції за кодом 38Z.
3.    Із папок 13 «Кредити ФО», 15 «Кредити ЮО»  перенести в папку 80 «Авт. Меморіальні».автоматичні операції за кодами ASG, ASP, ISG
4.     Із папки 4 «Вклади ФО» (б/г) перенести в папку 13 «Кредити ФО» бухгалтерські проводки з кореспонденцією рахунків за дебетом 22 гр. і кредитом 2620; дебетом 2620 і кредитом 22 гр., 6397.
5.     Із папки 26 «Доходи за операціями з клієнтами» перенести в папку 84 «АВТ.: Доходи» операцію BN4 («дочірня» до BNY Реалізація ЮМ (не платіжні) за відпускною ціною ОБ (бух. модель Дт 2909 Кт 6399));
6.    "Операцію К2К Дт 3739 Кт 6110 перенести в папку 84, зараз проводка попадає в папку 26 (це стосуєтьься папок по форм. Документів дня) "




   Доповнені зміни згідно заявки COBUSUPABS-4414.
2016_08_18
ARE. При формуванні бухгалтерського зведення документів дня, бухгалтерська проводка має включатися в папки № 87 (Дт 2401 Кт 7702) та в № -87 (Дт 7702 Кт 2401)
2016_08_08
164. При формуванні бухгалтерського зведення документів дня, бухгалтерська проводка має включатися в папку № 35

2016_05_24
00J. При формуванні бухгалтерського зведення документів дня, бухгалтерська проводка має включатися в папку № 10

2016_04_28
455. При формуванні бухгалтерського зведення документів дня, бухгалтерська проводка має включатися в папку № 27 "Витрати".

2016_04_27

 1. NG1 – при бухгалтерському зведенні операційного дня дана операція повинна попадати в папку 35 (зараз попадає в папку 37).
   2. по операції DOR – дочірня операція DO2 на суму ПДВ, при формуванні бухгалтерського зведення операційного дня, має попасти в папку 37 (зараз попадає в папку 80)


2016_03_28
   №13/1-03/2680від 25/03/2016  -         операцію 163 (бух. модель Дт 3906 Кт 1007) з папки 37 «Меморіальні (бухгалтерські) ручні» перенести в папку 80 «АВТ:Меморіальні».



   2016_02_xx
   Виконані зміни(по заявці COBUSUPABS-4312):
   Із папки 37 «Меморіальні (бухгалтерські) ручні» перенести:
-    в папку 80 «Авт. Меморіальні» операції за кодом ASG – бухмодель за дебетом рахунків 3739 та кредитом 357 групи рахунків; К17 бухмодель за дебетом рахунку 3739 та кредитом 2809; %МВ бухмодель за дебетом рахунку 3904 та кредитом 3800;
-    в папку 35 «Меморіальні (клієнтські) ручні» операцію за кодом CV7;
-    в папку 97 «АВТ.Перекриття» - операції за кодом PS1 з бухмоделлю за дебетом рахунків 25, 26гр.,2909 та кредитом 25,26.

Із папки 20 перенести в папку 32 «Імпорт (кліринг+інше) операції за кодом І00 з кореспонденцією рахунків за дебетом 2902 та кредитом 25 і 26 гр.
Із папки 30 перенести в папку 14 «ПЦ WAY4» операції за кодом OW3.


2016_02_12
    за операцією N12 на списання комісійної винагороди за обслуговування неактивних поточних рахунків фізичних осіб з 2620/05
    в іноземній валюті, бухгалтерські проводки на суму еквіваленту списаної комісії (Дебет рах.№ 3801/03; Кредит рах.№ 6110/F1),
    вилучити з папки № «26 – Доходи» та перенести в папку № «84 – АВТ.:Доходи».



   Пропозиції до зведення документів дня (18.09.2015)

         1. Із папки 37 «Меморіальні (бухгалтерські) ручні» перенести:
        • в папку 80 «Авт: Меморіальні»
        - операції за кодом: І00; CND; К2P; К2К (бух.модель Дт 3739 Кт 3600); %15; MIL
        • в папку 20 «Початкові внутрішні на рахунки клієнтів»
        - операції за кодом 901 з кореспонденцією рахунків за дебетом 3720 та кредитом 2 кл.;
        • в папку 26 «Доходи»
         • в папку 84 «Авт.Доходи»
        - операції за кодом К05 (бух. модель Дт 3570 Кт 6110)
        • в папку 35 «Меморіальні (клієнтські) ручні»
        - операції за кодом 301.

   -- 17.03.2015
      -- при формуванні звітів по зведенню документів дня в зв’язаній операції
      -- ЧЕК для бухгалтерської моделі операції дебет - '2570','2571','2572' кредит '1001','1002'
      -- змінено папку з «5» на «10»;
      --12,03,2015
      --при формуванні звітів по зведенню документів дня в зв’язаній операції 
      --MUO для бухгалтерської моделі операції – дебет рах.№ 3739, кредит рах.№ 3801,
      --змінити папку з «35» на «80»;

   2015-01-30 nvv  по опер. 024 Дт 2608 Кт 2604 також потрібно з папки 20 перенести в папку 80.
                Продовжуємо роботу з документами дня.
               1.    Опер. %15 з папки 19 бух.модель: Дт 2608  Кт 3622; Дт 2608 Кт 3800
               перенести в папку 80. Об’єми проводок великі і роздруковувати не доцільно.
               2.    Опер. %15 з папки 4  бух.модель: Дт 2628, 2638 Кт 3622; Дт 2628,2638 Кт 3800
               перенести в папку 80. Об’єми проводок великі і роздруковувати не доцільно
               3.    Опер. MIL з папки 4 бух.модель: Дт 2628, 2638 Кт 3622; Дт 2628, 2638 Кт 3800  перенести в папку 80.
               4.    Опер. MIL з папки 35 бух.модель: Дт 3801 Кт 3622 перенести в папку 80.
               5.    Опер. MIL з папки 19  бух.модель: Дт 2608  Кт 3622; Дт 2608 Кт 3800 перенести в папку 80.
                   опер. DU1 з папки 20 перенести в папку 80

   2014-10-07 NVV  попадання 901 операції  в папку 80, а хотілося б в папку 35.
                   А також автоперекриття  PS2 (3622, 2902) на  рахунок в ЦА також в 35 папку


   2014-08-21 NVV Шевченко Світлана Іванівна <SchevchenkoSI@oschadbank.ua>

   Бух. проводки попадають у три різні папки, при чому одна з них ручна.
   1.    27 «Витрати» бух. модель Дт/Кт  рах 7702, 7720 в кореспонденції з рах. 3801
   2.    80 «Авт. меморіальні» - Дт/Кт  3800 в коресп. З рах. 2400
   3.    87 «Авт. резерв»- Дт 7720,7702 Кт 3599, 2400 в гривні.
   При чому у всіх проводках код опер. AR*, ARE.
   Вітя, ми нічого не порушимо, якщо всі операції по нарах. резерву будуть попадати в одну папку 87  «Авт. резерв»???



   2014-06-17  NVV -  Шевченко Світлана Іванівна <SchevchenkoSI@oschadbank.ua>
   Опер. 405 має дві зв’язаних проводки: G05 – попадає
   в 19 папку (Дт 2600 Кт 3570),
   Та К05 попадає в 26 папку (Дт 3570 Кт 6110).
   Нам треба К05 (Дт 3570 Кт 6110) перенести в папку 84 «Авт. доходи».


   05.02.2013 Sta - Вимоги МС Демкович п ГОУ
                  - Окрема папка для 4-го кл № 1
                  - В ЦП (№ 8) добавити 3541 + 3641
                  - розділити Кредити на ЮО +ФО

   з кореспонденц_єю рахунк_в 2641, 2642,2643 попадають в 30 папку, а потр_бно в 19. З/П Шевченко С._.тел. 247-85-0333-38
   ('15','16','39') %%1 включив в папку  91-92

           Пропозиції стосовно формування документів дня, які включені в 76 дельту, та за якими виявлені помилки.
           1.    З папки 35 «Меморіальні (ручні)» вилучити операції за кодом PKR та включити в папку 86 «БПК:2924-картрахунки».
           2.    З папки 30 «Інші (початкові СЕП)» вилучити операцію за кодом KL2 з кореспонденцією рахунків наданих кредитів (2062, 2063 та ін.) та перенести в папку 15 «Кредити».
           3.    З папки 83 «Авт: зарах. з KL1» вилучити операції з кореспонденцією рахунків наданих кредитів (2062, 2063 та ін.) та перенести в папку 15 «Кредити».
           4.    В обов’язкове роздрукування не включати папку 41 «Позабаланс операційний». В параметрах запиту передбачити значення «0».
   *********

           Від кого:    Заступника головного бухгалтера-директора департаменту бухгалтерського обліку Демкович М.С.
           Дата    25.09.2013
           REF №:    13/1-03/201


           1.    У зведенні документів дня бух. виокремити папки 26 «Доходи» та 27 «Витрати» з загального роздрукування параметр запиту «1»  та роздруковувати їх за окремим запитом.
           2.    Папка 97 «АВТ. Перекриття».
           -    із операції за кодом PS1 бух. проводки з кореспонденцією рахунків за кредитом та дебетом 6, 7 класу перенести в папку 26 «Доходи» та 27 «Витрати» відповідно;
           -    із операції за кодом PS1 бух. проводки з кореспонденцією рахунків за дебетом 29, 35, 36 розділу та кредитом рахунків 25, 26 розділу включити в новостворену окрему папку 20 «Початкові внутрішні платежі на рахунки клієнтів (свого РУ)», яка вища по пріоритету за 21 папку. До новоствореної 20 папки включати інші коди операцій  внутрішньобанківського зарахування коштів на рахунки клієнтів (Кт 2600, 2603, 2605, 2560, 2650) в т.ч. оп.OW1 (бух. проводка Дт 2924/16 Кт 2600, 2605, 2650) та операцію за кодом 024 (бух. проводка Дт 2909 Кт 2560, 2600, 2603, 2650). Алгоритмом формування папки наступний: БР за кредитом схожий на „260%”, „25%”, „265%”, „264%”; код операції не один із (PS0, PS2).
           3.    Із папки 35 «Меморіальні (ручні) операцію за кодом 38V «Гуртова передача валютної позиції» перенести в 80 «Авт.меморіальні».
           4.    З папки 96 «Авт:Проводки по БПК» операції за кодом PKA, PKD, PKQ, PKG, PKH, PKR, PKS, PKX, PKE, PKU, PKY, PKZ включити в папку 86.
           5.    В окремих папках (15 «Кредити», 26 «Доходи», можливо і інші, але не всі (папка 27 «Витрати», 30 «Інші (початкові СЕП))» формуються вірно) у підсумках по виконавцю та в загальному підсумку по папках кредитовий оборот зазначається за дебетом, а дебетовий за кредитом.
           6.    В папку 45 «Позабаланс інші» включаються автопроводки з кореспонденцією рахунків за дебетом 9900 та кредитом 9129 і навпаки за операцією за кодом OW1. Перемістити в папку 98 «АВТ: Позабаланс інші».
           7.    Папку 45 «Позабаланс операційний» не включати в обов’язкове роздрукування. При друку передбачити параметр запиту «0».

        ===========================================
      21.08.2012 Лист в_д 10,08,2012 № 14/2-1/1969

      Пн 07.05.2012 17:14 Шевченко С.I. [SchevchenkoSI@oschadnybank.com]
         Є питання по формуванн_ документ_в по новому ПЦ WEY4.
         Потрiбно створити нову папку i включати всi бух. проводки по ПЦ  WEY4
         за виключенням Дт 2924/16 Кт 2600 + м/б по зарах вiдшкодування торговцю
                     та Дт 2924 Кт 1004.
         тел. 247-85-03 33-38

      Винница    12-11-2011   Операц_я 976 компенсац_ї  ми друкуєм мемор_альний ордер _    це не є касововим позабалансом
      Операц_я попадає в 41 папку Позабаланс операц    Необх_дно пом_стити в папку 45 Позабаланс _нший

   1. В папку 41 попадають бух. проводки з кореспонденцiєю  по дт i кт 9760,
      їх також необхiдно перенести в папку 45,

   2. Рахунки 2620/07 не включаються в однi папки з рахунками 2600,
      при безготiвковому списаннi вони попадають в папку 30 Iншi,
      тобто ви вiдноситися до них як до Iнших, а не звичайних 2600.

   08-06-2011 папка 32 - миж фил клиринг КИЕВ РУ
   22-07-2010 Визит Шевченко С.И. +Демкович
      1) Перевизначення папки
        - объединена папка 19+20  в одну с № 19
        - любая корресп.3801-6204 в папку 93
        - корресп 3801-7041        в папку 4
        - роздiлено папку 35 на две:
          80) авто , операции пох на 'AR_','I0_'
          35) ручные - остальное
      2) Перевизначення бранчу
        Ранiше завжди було : бранч  = МiСЦЕ виникнення операцiї.
        Зараз зроблено виключення для касових проводок,
        а саме:  для такихи проводок бранч  = МiСЦЕ прописки рахунку каси.
        Якщо обидва рах.касовs,
        то проводка ляже в папку Каса, сховище i буде показана по бранчу-2
        i НЕ буде вiдображення в папцi  Каса операц. по бранчу-3,
        т.я. бух.зведення повино паказати кожну проводку
        лише в однiй iз всiх можливих папок
        з пiдсумковим виходом на валюту оборотного балансу.


   31-05-2010 Sta Заув Шевченко С.И.
   28-05-2010 Sta
    1) у пап 21 Кл.пл. (вiд.вн.)
                виокремити  деб.70*     - крд.25*,26*  ;  деб.25*,26* - крд.70*
                та додати у папку 27 Витрати.

    2) у пап 96 АВТ: БПК
                виокремити  деб.7452    - крд 3550, 2924
                та додати у папку 27 Витрати.


   25-05-2010 Sta.В cоотв с письмом (от 21.05.2010, REF № 13/1-03/80 )
   27-04-2010 Sta Новый свод в Черкассах Сухова +Демкович
   06-04-2010 Sta
              Перенумерованы папки для возможности вставки новых
              Добавлена новая папка № 3 Вклади (депозити) ФО
   *******************************************************
   */

   t_      INT;                                      -- код папки для возврата
   flag_   VARCHAR2 (1);           -- флаг операції автоматични 0 - ручний - 1

   l_BRD   INT := LENGTH (BRD_);                   -- Длина Бранча счета-Дебет
   l_BRK   INT := LENGTH (BRK_);                  -- Длина Бранча счета-Кредит
BEGIN
   SELECT SUBSTR (flags, 1, 1)
     INTO flag_
     FROM tts
    WHERE tt = tt_;


   IF tt_ in ('IF0','IF1','IF2','IF3','IF4','IF5','IF6') 
   THEN
     t_ := 35;
     RETURN t_;
   END IF; 

   IF NBSd_ LIKE '8%'
   THEN
      t_ := 99;
      RETURN t_;
   END IF;                                                          -- 8 класс

   IF NBSd_ LIKE '4%' OR nbsk_ LIKE '4%'
   THEN
      t_ := 1;
      RETURN t_;
   END IF;                                                          -- 4 класс

   ---------------------------------------------------------
   -- 9 класс
   IF NBSd_ LIKE '9%'
   THEN
      IF '9760' IN (NBSd_, NBSk_)
      THEN
         t_ := 45;
      ELSIF tt_ IN ('CR9', 'O99')
      THEN
         t_ := 98;
      ELSIF tt_ = 'OW1' AND (NBSd_ = '9129' OR NBSk_ = '9129')
      THEN
         t_ := 98;
      ELSIF (l_BRD > 15 OR l_BRK > 15)
      THEN
         t_ := 41;
      ELSIF (   NBSD_ LIKE '98%' AND l_BRD = 15
             OR NBSK_ LIKE '98%' AND l_BRK = 15)
      THEN
         t_ := 40;
      ELSE
         t_ := 45;
      END IF;

      RETURN t_;
   END IF;

     
   
   -----------------------------------------------------------
   -- 1-7 классы

   --------- Заведомо АВТОПРОВОДКИ   instr(tt_, '%') > 0
   IF tt_ IN ('%%1') AND (nbsd_ LIKE '2%' OR nbsk_ LIKE '6%'              --or
                                                            --substr(nbsd_,1,2) in    ('15','16','39','14','30','31','32')
                         )
   THEN
      t_ := 91;                                          -- АВТ:Нар.% по кред.
   ELSIF tt_ IN ('%%1', 'DU%') AND (nbsk_ LIKE '2%' OR nbsd_ LIKE '7%'    --or
                                                                      -- substr(nbsk_,1,2) in ('15','16','39','14','30','31','32')
                                   )
   THEN
      t_ := 92;                                           -- АВТ:Нар.% по деп.
   ELSIF tt_ = 'DBF'
   THEN
      t_ := 81;                                              --ABT:Зарах.з DBF
   ELSIF tt_ IN ('ALT', 'ALK')
   THEN
      t_ := 82;                                              --ABT:Зарах.з ALT
   ELSIF tt_ IN ('PFR', 'PFD', 'PFX')
   THEN
      t_ := 50;                                              -- Документи ПФУ
   ELSIF tt_ = 'CRV'
   THEN
      t_ := 9;                                                  -- компенсація
   ELSIF     tt_ IN ('DU1')
         AND MFOA_ = MFOB_
         AND (   SUBSTR (nbsk_, 1, 3) IN ('260', '265', '264')
              OR SUBSTR (nbsk_, 1, 2) IN ('25'))
   THEN
      t_ := 80;
   ELSIF     tt_ IN ('R01', 'I00', 'ZG9', '%%9')
         AND NBSd_ LIKE '7%'
         AND SUBSTR (NBSd_, 1, 2) NOT IN ('73', '74')
   THEN
      t_ := 85;                                                --АВТ.: Витрати
   ELSIF     tt_ IN ('R01', 'I00', 'ZG9', '%%9')
         AND NBSk_ LIKE '7%'
         AND SUBSTR (NBSk_, 1, 2) NOT IN ('73', '74')
   THEN
      t_ := -85;                                               --АВТ.: Витрати
   ELSIF     tt_ IN ('R01', 'I00', 'ZG9', '%%9', 'IRR', '%MB', 'ELT','N12')
         AND NBSd_ LIKE '6%'
   THEN
      t_ := 84;                                                 --АВТ.: Доходи
   ELSIF     tt_ IN ('R01', 'I00', 'ZG9', '%%9', 'IRR', '%MB', 'ELT','N12')
         AND NBSk_ LIKE '6%'
   THEN
      t_ := -84;                                                --АВТ.: Доходи
   ELSIF     (tt_ LIKE 'AR_' OR tt_ = '096')
         AND SUBSTR (NBSd_, 1, 2) IN ('77', '38')
         AND NBSk_ IN
                ('1490',
                 '1491',
                 '1890',
                 '2400',
                 '2890',
                 '3801',
                 '3190',
                 '3290',
                 '3590',
                 '3599',
                 '3690')
   THEN
      t_ := -87;                                               --АВТ.: Резерви
   ELSIF     (tt_ LIKE 'AR_' OR tt_ = '096')
         AND SUBSTR (NBSk_, 1, 2) IN ('77', '38')
         AND NBSd_ IN
                ('1490',
                 '1491',
                 '1890',
                 '2400',
                 '2890',
                 '3801',
                 '3190',
                 '3290',
                 '3590',
                 '3599',
                 '3690')
   THEN
      t_ := 87;
   ELSIF TT_ = 'ARE' AND (nbsd_ = '7702' AND nbsk_ = '2401')
  THEN
         t_ := -87;
   ELSIF TT_ = 'ARE' AND (nbsd_ = '2401' AND nbsk_ = '7702')
  THEN
         t_ := 87;
                                               --АВТ.: Резерви
   ELSIF     tt_ IN ('%15', 'MIL')
         AND nbsd_ IN ('2608', '3801', '2628', '2638')
         AND nbsk_ IN ('3622', '3800')
   THEN
      t_ := 80;
   ELSIF     tt_ IN
                ('RT0',
                 'R02',
                 'D00',
                 'D02',
                 'D01',
                 'DT0',
                 'DT1',
                 'R01',
                 'R00',
                 'RT1')
         AND (   (nbsd_ LIKE '3%' AND nbsk_ LIKE '3%')
              OR (nbsd_ LIKE '1%' AND nbsk_ LIKE '3%')
              OR (nbsd_ LIKE '3%' AND nbsk_ LIKE '1%'))
         AND mfoa_ IS NULL
   THEN
      t_ := 89;                                                --ABT:Квт на РЦ
   ELSIF     tt_ IN ('PVP', 'SPM', 'RET', 'REV')
         AND SUBSTR (NbSD_, 1, 1) = 9
         AND SUBSTR (NbSk_, 1, 1) = 9
   THEN
      t_ := 90;                                   -- АВТ:Переоцiнки позабаланс
   ELSIF    tt_ IN ('PVP', 'SPM', 'RET', 'REV')
         OR (NbSD_ IN ('3801', '6204') AND NbSk_ IN ('3801', '6204'))
   THEN
      t_ := 93;                                              -- АВТ:Переоцiнки
   ELSIF tt_ = 'RKO'
   THEN
      t_ := 94;                                          -- АВТ:Нар.ком.за РКО
   ELSIF tt_ = 'OVR'
   THEN
      t_ := 95;                                               -- АВТ:Овердрафт
   ELSIF tt_ IN ('PKA', 'PKD', 'PKR', 'PKQ', 'OW4')
   THEN      
      t_ := 36;   -- БПК:меморіальні ручні
   -- заведомо старые БПК
   ELSIF     NbSD_ IN ('2625', '2605')
         AND NbSK_ = '2924'
         AND SUBSTR (tt_, 1, 2) NOT IN ('KL')
   THEN  
      t_ := -86;     -- БПК:(2924<->2625)
   ELSIF     NbSK_ IN ('2625', '2605')
         AND NbSD_ = '2924'
         AND SUBSTR (tt_, 1, 2) NOT IN ('KL')      
   THEN  
      t_ :=86;-- БПК:(2924<->2625)
   --4.     Із папки 4 «Вклади ФО» (б/г) перенести в папку 13 «Кредити ФО» бухгалтерські проводки з кореспонденцією рахунків за дебетом 22 гр. і кредитом 2620; дебетом 2620 і кредитом 22 гр., 6397.
   ELSIF (NBSd_ LIKE '22%' AND NBSk_ = '2620')
   THEN
      t_ := 13;
   ELSIF ( (NBSk_ LIKE '22%' OR NBSk_ = '6397') AND NBSd_ = '2620')
   THEN
      t_ := -13;
   --------- Заведомо ВКЛАДЫ -----
   ELSIF     NBSd_ IN ('3801', '7041')
         AND NBSk_ IN ('3801', '7041')
         AND tt_ NOT LIKE 'OW_'
   THEN
      t_ := 4;                                               -- Вклади ФО (Б/г
   ELSIF     NBSd_ IN ('2620', '2630', '2635', '2628', '2638')
         AND tt_ NOT LIKE 'OW_'
   THEN
      IF NBSk_ IN ('1001', '1002')
      THEN
         t_ := -3;                                          -- Вклади ФО (Гот)
      ELSE
         t_ := -4;                                           -- Вклади ФО (Б/г
      END IF;
   ELSIF     NBSk_ IN ('2620', '2630', '2635', '2628', '2638')
         AND tt_ NOT LIKE 'OW_'
   THEN
      IF NBSd_ IN ('1001', '1002')
      THEN
         t_ := 3;                                           -- Вклади ФО (Гот)
      ELSE
         t_ := 4;                                            -- Вклади ФО (Б/г
      END IF;
  ELSIF ( ( tt_ IN ('ЧЕК')
          AND NBSd_ IN ('2570', '2571', '2572')
              AND NBSk_ IN ('1001', '1002'))
          OR (    tt_ IN ('00J')
          AND NBSk_ IN ('2570', '2571', '2572')
          AND NBSd_ IN ('1001', '1002')))
   THEN
      t_ := 10;
   --------- Заведомо КАССА -----
   ELSIF     (NBSk_ LIKE '100_' OR NBSk_ LIKE '110_')
         AND NBSk_ NOT LIKE '___7'
         AND NBSk_ NOT LIKE '___4'
   THEN
      -- касса по деньгам и металлам (Кредит), кроме дороги
      IF l_BRK = 15
      THEN
         t_ := -5;                                               -- Каса схов.
      ELSE
         t_ := -10;                                              -- Каса опер.
      END IF;
   ELSIF     (NBSd_ LIKE '100_' OR NBSd_ LIKE '110_')
         AND NBSd_ NOT LIKE '___7'
         AND NBSD_ NOT LIKE '___4'
   THEN
      -- касса по деньгам и металлам (Кредит), кроме дороги
      IF l_BRD = 15
      THEN
         t_ := 5;                                                -- Каса схов.
      ELSE
         t_ := 10;                                               -- Каса опер.
      END IF;
   ELSIF nbsd_ = '1004'
   THEN
      t_ := 12;                                               -- Каса-банкомат
   ELSIF nbsk_ = '1004'
   THEN
      t_ := -12;                                              -- Каса-банкомат
   --08.05.2012
   --ElsIf  (nbsd_ ='2924' and nbsk_ ='2625')
   --       or (nbsk_ ='2924' and nbsd_ ='2625')                 then t_:= 86;
   ELSIF tt_ IN ('OW3', 'OWI')
   THEN
      t_ := 14;
   ELSIF tt_ LIKE 'OW_' --and NOT (nbsd_='2924' and nbsk_='2600')
         AND mfoa_ = mfob_
   THEN
      t_ := 14;                                                   --   ПЦ WEY4
   ELSIF (tt_ LIKE 'PK_' OR tt_ = 'R03') AND tt_ NOT IN ('PKK')
   THEN
      IF nbsd_ = '7452' AND nbsk_ IN ('3550', '2924')
      THEN
         t_ := 27;                                                  -- Витрати
      -- 28-05-2010 у пап 96 АВТ: БПК
      -- виокремити  деб.7452  - крд 3550,2924
      -- та додати у папку 27 Витрати.
      ELSIF tt_ IN
               ('PKA',
                'PKD',
                'PKQ',
                'PKG',
                'PKH',
                'PKR',
                'PKS',
                'PKX',
                'PKE',
                'PKU',
                'PKY',
                'PKZ')
      THEN
         t_ := 86;                                                          --
      ELSE
         t_ := 96;                                      -- АВТ:Проводки по БПК
      END IF;
   -- Другое
   ELSIF     (NBSd_ LIKE '22%')
         AND tt_ IN
                ('015',
                 '013',
                 'KK1',
                 'KK2',
                 'KK4',
                 'KK5',
                 'KL1',
                 'KL2',
                 'IB1',
                 'IB2',
                 'SNO',
                 '096')
   THEN
      t_ := 13;                                                   --Кредити ФО
   ELSIF     (NBSk_ LIKE '22%')
         AND tt_ IN
                ('015',
                 '013',
                 'KK1',
                 'KK2',
                 'KK4',
                 'KK5',
                 'KL1',
                 'KL2',
                 'IB1',
                 'IB2',
                 'SNO',
                 '096')
   THEN
      t_ := -13;                                                  --Кредити ФО
    ELSIF     (NBSd_ LIKE '20%' OR NBSd_ LIKE '21%')
         AND tt_ IN
                ('015',
                 '013',
                 'KK1',
                 'KK2',
                 'KK4',
                 'KK5',
                 'KL1',
                 'KL2',
                 'IB1',
                 'IB2',
                 'SNO',
                 '096')
   THEN
      t_ := 15;                                                   --Кредити ЮО
   ELSIF     (NBSk_ LIKE '20%' OR NBSk_ LIKE '21%')
         AND tt_ IN
                ('015',
                 '013',
                 'KK1',
                 'KK2',
                 'KK4',
                 'KK5',
                 'KL1',
                 'KL2',
                 'IB1',
                 'IB2',
                 'SNO',
                 '096')
   THEN
      t_ := -15;                                                  --Кредити ЮО
   ---
   ELSIF     SUBSTR (TT_, 1, 2) IN ('KL', 'IB')
         AND (   NBSD_ LIKE '260%'
              OR NBSD_ LIKE '25%'
              OR NBSD_ LIKE '265%'
              OR NBSD_ LIKE '2909')
   THEN
      t_ := 25;                                                 -- Клiєнт-Банк
   ELSIF TT_ IN ('KL1')
   THEN
      t_ := 83;                                                  --Зарах.з KL1
   -- 2015-01-16
   -- 024 бух.модель: Дт 2528, 2538, 2548, 2568,2608, 2658  Кт 252 гр., 253 гр., 254 гр., 2600, 2650, 2560, 2604 перенести в папку 80

   ELSIF     tt_ = '024'
         AND nbsd_ IN ('2528', '2538', '2548', '2568', '2608', '2658')
         AND (   SUBSTR (nbsk_, 1, 3) IN ('252', '253', '254')
              OR nbsk_ IN ('2600', '2650', '2560', '2604'))
   THEN
      t_ := 80;
   --2016_04_28
   ELSIF TT_ IN ('455')
   THEN
      if NBSd_ in ('7300', '7301') then
       t_ := 39;
     else
       t_ := 27;
     end if; 

   --07-10-2013
   ------
   ELSIF REGEXP_LIKE (nbsd_, '^(639[4,5,6]|64)')
   THEN
      t_ := -38;
   ELSIF REGEXP_LIKE (nbsk_, '^(639[4,5,6]|64)')
   THEN
      t_ := 38;
   ELSIF REGEXP_LIKE (nbsd_, '^(739[2,4,5,6,7,9]|74|7900)')
   THEN
      IF tt_ = 'MVN' THEN
		 t_ := 27;
      ELSE
		 t_ := -39;
	  END IF;
   ELSIF REGEXP_LIKE (nbsk_, '^(739[2,4,5,6,7,9]|74|7900)')
   THEN
      t_ := 39;
   ELSIF tt_= '101'
         AND nbsd_ IN ('3570', '3739', '3600')
         AND nbsk_ IN ('3570', '3739', '3600')
   THEN
      t_ := 35;
   --NG1 – при бухгалтерському зведенні операційного дня дана операція повинна попадати в папку 35

   ELSIF tt_ = 'NG1'
   THEN
      t_ := 35;
   ELSIF tt_= 'D66'
         AND nbsd_ IN ('3579', '3739')
         AND nbsk_ IN ('3579', '3739')
   THEN
      t_ := 35;
   ELSIF tt_ = 'D07' AND nbsd_ IN ('3800') AND nbsk_ IN ('2924')
   THEN
      t_ := 80;
   --25/07/2015
    --   Папка 20 «Початкові внутрішні платежі на рахунки клієнтів»:
    --    бухгалтерські проводки з кореспонденцією рахунків БР за дебетом «3500, 3510, 3519, 3610, 3619, 3653, 3678»  та БР за кредитом схожий на «260%» виокремити з папки та перенести в нову папку «Початкові внутрішні за господарськими операціями»;

   ELSIF tt_ = 'PS1'
         AND (    SUBSTR (nbsd_, 1, 2) IN ('29', '35', '36')
              AND SUBSTR (nbsk_, 1, 2) IN ('26', '25'))
   THEN
      IF     nbsd_ IN
                ('3500', '3510', '3519', '3610', '3619', '3653', '3678')
         AND (SUBSTR (nbsk_, 1, 3) = '260')
      THEN
         t_ := 23;      -- 23 Початкові внутрішні за господарськими операціями
      ELSE
         t_ := 97; -- 20 початкові внутрішні платежі на рахунок клієнтів свого РУ
      END IF;
   ELSIF     tt_ = 'PS1'
         AND (SUBSTR (nbsd_, 1, 2) IN ('25','26') OR nbsd_ IN ('2909'))
         AND SUBSTR (nbsk_, 1, 2) IN ('25','26')
   THEN
      t_ := 97;
   ELSIF     tt_ NOT IN ('PS0', 'PS2', 'OW1', 'I00')
         AND MFOA_ = MFOB_
         AND (   SUBSTR (nbsk_, 1, 3) IN ('260', '265', '264')
              OR SUBSTR (nbsk_, 1, 2) IN ('25'))
   THEN
      IF     nbsd_ IN
                ('3500', '3510', '3519', '3610', '3619', '3653', '3678')
         AND (SUBSTR (nbsk_, 1, 3) = '260')
      THEN
         t_ := 23;      -- 23 Початкові внутрішні за господарськими операціями
      ELSE
         IF tt_ = 'PS1'
         THEN
            t_ := 97;
         ELSIF tt_ = 'CL1'
         THEN
            t_ := 25;                                            --Клієнт банк
         ELSE
            t_ := 20; -- 20 початкові внутрішні платежі на рахунок клієнтів свого РУ\
         END IF;
      END IF;
  ELSIF     (   NBSD_ LIKE '260%'
              OR NBSD_ LIKE '25%'
              OR NBSD_ LIKE '265%'
              OR NBSD_ LIKE '264%')
         AND MFOA_ = gl.aMFO
         AND tt_ NOT IN ('PS0', 'PS1', 'PS2', 'ELT')
   THEN
      IF tt_ IN ('CL2', 'CL5')
      THEN
         t_ := 25;                                            --Клієнт банк
      ELSE
         t_ := 19;                                            --Кл.пл.(Поч.ВН+МБ)
      END IF;
   ELSIF     (NBSK_ LIKE '260%' OR NBSK_ LIKE '25%' OR NBSK_ LIKE '265%')
         AND MFOB_ = gl.aMFO
         AND tt_ NOT IN ('PS0', 'PS1', 'PS2','I00')
   THEN
      IF MFOA_ = MFOB_
      THEN
         -- 28-05-2010
         -- у пап 21 Кл.пл. (вiд.вн.)
         -- виокремити  деб.70*     - крд.25*,26*  ;  деб.25*,26* - крд.70*
         -- та додати у папку 27 Витрати.
         IF NBSD_ LIKE '70%' AND SUBSTR (NBSK_, 1, 2) IN ('25', '26')
         THEN
            t_ := 27;                                                --Витрати
         ELSIF NBSK_ LIKE '70%' AND SUBSTR (NBSD_, 1, 2) IN ('25', '26')
         THEN
            t_ := -27;                                              -- Витрати
         ELSE
            t_ := 21;                                         --Кл.пл.(Вiд.ВН)
         END IF;
      ELSE
         t_ := 22;                                            --Кл.пл.(Вiд.МБ)
      END IF;
   ELSIF     MFOA_ <> MFOB_
         AND (   (    nbsd_ LIKE '39%'
                  AND nbsd_ NOT IN ('3900', '3901', '3906', '3907'))
              OR (    nbsk_ LIKE '39%'
                  AND nbsk_ NOT IN ('3900', '3901', '3739', '3906', '3907')))
         AND tt_ NOT IN ('R01', 'D01')
   THEN
      t_ := 29;                                               --М/Ф розрахунки
   ELSIF tt_ = 'VMO'
   THEN
      t_ := 29;                                               --М/Ф розрахунки
   -- особенності ГОУ

   ELSIF (   SUBSTR (nbsd_, 1, 3) IN
                ('151', '161', '152', '162', '131', '132')
          OR SUBSTR (nbsk_, 1, 3) IN
                ('151', '161', '152', '162', '131', '132'))
   THEN
      t_ := 2;                               -- Міжбанківські кредити/депозити
   ELSIF (   SUBSTR (nbsd_, 1, 3) IN ('150', '160')
          OR SUBSTR (nbsk_, 1, 3) IN ('150', '160'))
   THEN
      t_ := 6;                                                 -- Ностро  Лоро
   ELSIF (   SUBSTR (nbsk_, 1, 2) IN ('14', '30', '31', '32')
          OR SUBSTR (nbsd_, 1, 2) IN ('14', '30', '31', '32')
          OR nbsk_ IN ('3541', '3641', '5102')
          OR nbsd_ IN ('3541', '3641', '5102'))
   -- and tt_ like 'F__'
   THEN
      t_ := 7;                                               -- Kt Cinni paper
   ELSIF tt_ IN ('FXM', 'FX%', 'F80')
   THEN
      t_ := 7;                                               -- Kt Cinni paper
   ELSIF     (   nbsk_ IN ('1880', '1919', '1819')
              OR nbsd_ IN ('1880', '1919', '1819'))
         AND (tt_ LIKE 'F__' OR tt_ IN ('CVO', 'C14', '8G2', '8C2', 'CV7'))
   THEN
      t_ := 8;                                               -- Dt Forex paper
   ELSIF tt_ = 'F10'
   THEN
      t_ := 8;                                               -- Dt Forex paper
   ELSIF NBSd_ LIKE '7%' AND tt_ NOT IN ('PS0')
   THEN
      IF tt_ = 'C4A' THEN --COBUMMFO-9457
        t_ := 27;
      ELSE
        t_ := 39;
      END IF;
   ELSIF NBSk_ LIKE '7%' AND tt_ NOT IN ('PS0')
   THEN
      IF tt_ = 'MVN' THEN
		 t_ := 27;
      ELSE
		 t_ := -39;
	  END IF;                                                       --Вирт
    --5.     Із папки 26 «Доходи за операціями з клієнтами» перенести в папку 84 «АВТ.: Доходи» операцію BN4 («дочірня» до BNY Реалізація ЮМ (не платіжні) за відпускною ціною ОБ (бух. модель Дт 2909 Кт 6399));
   ELSIF NBSk_ = '6399' AND NBSd_ = '2909' AND tt_ = ('BN4')
   THEN
      t_ := -84;
   --Із папки 26 «Доходи» перенести в папку 84 «АВТ.: Доходи» зв’язану (дочірню) операцію BM4 до операції BMY – бухмодель за дебетом рахунок 2909/23 і кредитом 6399/14.
   ELSIF NBSk_ = '6399' AND NBSd_ = '2909' AND tt_ = ('BM4')
   THEN
      t_ := 84;
   ELSIF NBSk_ LIKE '6%' AND tt_ NOT IN ('PS0', 'K05','SN3' , 'K2K')
   THEN
      IF tt_ = 'CNC' 
	  THEN
		t_ := 84;
	  ELSE
         t_ := -26;                                                         --Дох
	  END IF;
   ELSIF NBSd_ LIKE '6%' AND tt_ NOT IN ('PS0', 'K05', 'K2K')
   THEN
      t_ := 26;                                                          --Дох
   ELSIF TT_ = TTO_ AND MFOA_ <> MFOB_ AND tt_ NOT IN ('PS0', 'PS1', 'PS2')
   THEN
      IF     (   NBSd_ = '2924' AND NBSk_ = '3739'
              OR NBSk_ = '2924' AND NBSd_ = '3739'
              OR NBSd_ = '2902' AND NBSk_ = '3739'
              OR NBSd_ = '3739' AND NBSk_ = '3739')
         AND (   tt_ LIKE 'I0_'
              OR tt_ IN
                    ('W4D',
                     'W4B',
                     'W4A',
                     'R00',
                     'MND',
                     'MNK',
                     'D00',
                     'D01',
                     'R01',
                     'CS2',
                     '516'))
      THEN
         t_ := 32;                                              -- М/Ф клиринг
      ELSE
         IF MFOA_ = gl.aMFO
         THEN
            --26/07/2015
            --            Папка 30 «Інші початкові СЕП»:
            --   бухгалтерські проводки з кореспонденцією рахунків БР за дебетом «3500, 3510, 3519, 3610, 3619, 3653, 3622, 3678» виокремити з папки та перенести в нову папку «Інші початкові СЕП (за господарськими операціями)».
IF tt_ = 'EW1'
			   THEN
			      t_ := 80;
		    ELSE
                  IF NBSd_ IN
                  ('3500',
                   '3510',
                   '3519',
                   '3610',
                   '3619',
                   '3653',
                   '3622',
                   '3678')
            THEN
               t_ := 33;   --Інші початкові СЕП (за господарськими операціями)
            ELSE
                  t_ := 30;
			   END IF;
            END IF;
                                                     -- СЕП-початк.
         ELSE
            t_ := 31;                                           -- СЕП-вiдпов.
         END IF;
      END IF;
   ELSIF     TT_ = TTO_
         AND MFOA_ <> MFOB_
         AND MFOB_ = '300465'
         AND tt_ IN ('PS2')
         AND NBSd_ IN ('3622', '2902')
   THEN
      t_ := 35;                                          -- Меморiальнi(ручнi)
   ELSIF tt_ IN ('PS0','PS2')
      THEN
      t_ := 97;
   ELSIF tt_ ='CV7'
      THEN
      t_ := 35;
                                                   -- АВТ-Бал.iншi
   ELSIF tt_ = '38V'
   THEN
      t_ := 80;                                             -- АВТ:Меморiальнi
   ELSIF    (tt_ IN ('W4V', 'IB5') AND NBSd_ = '2906' AND NBSk_ = '2924')
         OR (tt_ = 'Z16' AND NBSd_ = '3801' AND NBSk_ = '3902')
   THEN
      t_ := 80;                                             -- АВТ:Меморiальнi
   ELSIF (tt_ IN ('MUO') AND NBSd_ = '3739' AND NBSk_ = '3801')
   THEN
      t_ := 80;                                             -- АВТ:Меморiальнi
   ELSIF     tt_ IN ('ASG')
         AND nbsd_ IN ('3739')
         AND SUBSTR (nbsk_,1,3) IN ('357')
   THEN
      t_ := 80;
   ELSIF tt_ IN ('K17') AND nbsd_ IN ('3739') AND nbsk_ IN ('2809')
   THEN
      t_ := 80;
   ELSIF tt_ IN ('%MB') AND nbsd_ IN ('3904') AND nbsk_ IN ('3800')
   THEN
      t_ := 80;
   ELSIF     tt_ = 'I00'
         AND nbsd_ IN ('2902')
         AND SUBSTR (nbsk_,1,2) IN ('26','26')
   THEN
      t_ := 32;
   ELSIF tt_ IN ('I00', 'CND', 'K2P', '%15', 'MIL')
   THEN
      t_ := 80;                                             -- АВТ:Меморiальнi
   ELSIF tt_ IN ('301')
   THEN
      t_ := 35;                   -- папку 35 «Меморіальні (клієнтські) ручні»
   ELSIF tt_ IN ('K2K') AND nbsd_ = '3739' AND nbsk_ = '3600'
   THEN
      t_ := 80;                                             -- АВТ:Меморiальнi
   ELSIF    (tt_ IN ('K05') AND nbsd_ = '3570' AND nbsk_ = '6110')
         OR (tt_ IN ('SN3') AND nbsk_ LIKE '6%')
   THEN
      t_ := 84;                                           -- папку 26 «Доходи»
   ELSIF tt_ IN ('901') AND nbsd_ = '3720' AND nbsk_ LIKE '2%'
   THEN
      t_ := 20;       -- в папку 20  «Початкові внутрішні на рахунки клієнтів»
   ELSIF (NBSd_ LIKE '3%' OR NBSk_ = '3%') AND tt_ = 'D06'
   THEN
      t_ := 80;
     --  операцію 164 (бух. модель Дт 3907 Кт 1007) з папки 37 «Меморіальні (бухгалтерські) ручні» перенести в папку 35.
   ELSIF (NBSd_ = '3907' AND NBSk_ = '1007' AND tt_ = '164')
  THEN  
t_ := 35;   -- в папку 35 «Меморіальні (клієнтські) ручні»
   ---    бухгалтерські проводки з кореспонденцією рахунків за дебетом та/або  кредитом 3 класу  перенести в нову папку 37 «Меморіальні  (бухгалтерські) ручні».



   --по операції DOR – дочірня операція DO2 на суму ПДВ, при формуванні бухгалтерського зведення операційного дня, має попасти в папку 37 (зараз попадає в папку 80)


   ELSIF     tt_ <> '38Z'
         AND (   ( (NBSd_ LIKE '3%' OR NBSk_ = '3%') AND flag_ = '1')
              OR tt_ = 'DO2')
   THEN 
t_ := 37;   -- 37 «Меморіальні  (бухгалтерські) ручні»
   ELSE
      IF    SUBSTR (tt_, 1, 2) IN ('AR', 'I0')
         OR tt_ IN
               ('VMO',
                'KLR',
                'R00',
                'R01',
                '809',
                '812',
                'D06',
                'D07',
                '437',
                'K06',
                'K07',
                '%03',
                '516',
                '%MB',
                '%15',
                'ELT',
                'D01')
      THEN
         t_ := 80;                                          -- АВТ:Меморiальнi
      ELSIF flag_ = '0' AND tt_ NOT IN ('901')
      THEN
         t_ := 80;                                          -- АВТ:Меморiальнi
      ELSE
         t_ := 35;                                       -- Меморiальнi(ручнi)
      END IF;
   END IF;



   RETURN t_;
END ZVT_F;
/

show err;
 
PROMPT *** Create  grants  ZVT_F ***
grant EXECUTE                                                                on ZVT_F           to BARS_ACCESS_DEFROLE;
grant EXECUTE                                                                on ZVT_F           to RPBN001;
grant EXECUTE                                                                on ZVT_F           to START1;
grant EXECUTE                                                                on ZVT_F           to WR_ALL_RIGHTS;

 
 
 PROMPT ===================================================================================== 
 PROMPT *** End *** ========== Scripts /Sql/BARS/function/zvt_f.sql =========*** End *** ====
 PROMPT ===================================================================================== 