Repository: AnnaLut/abs3
Catalog: web/mmfo/barsroot/App_GlobalResources/admin.Global.*.resx
Languages: uk

# labDlinaParoliaNeMenee6Sivolov
source: Длина пароля неменее 6-ти символов!
uk: Довжина паролю не меньше 6-ти символів!

# labOwibkaPodtvergdeniaParolia
source: Ошибка подтверждения пароля! Повторите ввод.
uk: Помилка підтвердження паролю! Введіть заново.

# labZapolniteFIOPolzovatelia
source: Заполните ФИО пользователя!
uk: Заповніть ПІБ користувача!

# labZapolniteLoginPolzovatelia
source: Заполните логин пользователя!
uk: Заповніть логін користувача!

# labZapolnitePodrazdelenie
source: Заполните подразделение пользователя!
uk: Заповніть підрозділ користувача!

# labZapolniteTabN
source: Заполните табельный номер(совпадает с идентификатором подписи)!
uk: Заповніть табельний номер(співпадає с ідентифікатором підпису)!

# labZapolniteTipPolzovatelia
source: Заполните тип пользователя!
uk: Заповніть тип користувача!

# msgArchiveCorrupt
source: Архив поврежден.
uk: Архів пошкоджений.

# msgArchiveOk
source: Файл обновления корректный. Описание обновления:
uk: Файл обновлення корректний. Опис обновлення:

# msgCheckVersion
source: Проверка соответствия версий в реестре и файле прошла успешно.
uk: Перевірка відповідності версій в реєстрі і файлі пройшла успішно.

# msgDiffVersions
source: Не совпадают номера версий в реестре и файле версий.
uk: Не співпадають номера версій в реєстрі і файлі версій.

# msgErrorReadArchive
source: Ошибка чтения архива.
uk: Помилка чиитання архіву.

# msgFailFileCrc
source: Файл [PATH] не соответствует контрольной сумме, вероятно он был изменен.
uk: Файл [PATH] не відповідає контрольній сумі, ймовірно він був змінений.

# msgFailHashSum
source: Контрольная сумма файла не совпадает с указаной.\nФайл version.xml изменили вручную.
uk: Контрольна сума файла не співпадає з вказаною.\nФайл version.xml змінили вручну.

# msgIncorrectPassword
source: Неверный пароль на архив
uk: Невірний пароль на архів

# msgIncorrectPswRollback
source: Неверный пароль отката (должен совпадать с паролем последнего обновления).
uk: Неверний пароль відкату (повинен співпадать з паролем останього обновлення).

# msgIntegrOk
source: Проверка целосности завершена.\nУкажите файл обновления: для даной версии это должен быть файл с именем update#[VERALL](*).zip или update[TYPE]#[VER](*).zip (* - число).
uk: Перевірка цілісності завершена.\nВкажіть файл обновлення: для даної версії це повинен бути файл з іменем update#[VERALL](*).zip або update[TYPE]#[VER](*).zip (* - число).

# msgMissFile
source: Не найден файл версии!
uk: Не знайдено файл версії!

# msgNameArchiveChange
source: Имя архива менялось вручную.
uk: Ім'я архіву змінювалось вручну.

# msgNameArchiveFailed
source: Имя архива не соответствует нужной маске.
uk: Ім'я архіву не відповідає потрібній масці.

# msgNoFileUpdate
source: Не указан файл обновления.
uk: Не вказано файлу обновлення.

# msgNoPasswordArchive
source: Не указан пароль на архив.
uk: Не вказано пароль на архів.

# msgNotSupport
source: Даный тип обновления не поддерживается.
uk: Даний тип обновлення не підтримується.

# msgNotZipFile
source: Файл обновлений должен быть с расширением zip.
uk: Файл обновлення повинен бути з розширенням zip.

# msgRollbackConfirm
source: Вы действительно хотите откатить версию назад?
uk: Ви дійсно хочете повернути версію назад?

# msgRollbackOk
source: Возврат на одну версию назад успешно завершен.
uk: Повернення на одну версію назад успішно завершено.

# msgUpdateOk
source: Обновление успешно завершено.
uk: Обновлення успішно завершено.
