-- Перемещение задания № 170 (Формування файлів управлінської звітності (К-файлів по корпоративних клієнтах Ощадбанку)) . Старая последовательность  295
-- в выполнение в паралели с заданием № 70 (DPT. Перевірка "пенсійності" вкладів)
-- в последовательность №15
update tms_task set sequence_number = 15 where id = 170 and sequence_number = 295;


-- Перемещение задания № 92 (Way4. Обробка запитів від CardMake). Старая последовательность  44
-- в выполнение в паралели с заданием № 121 (Дозаполнение проц.карточек по 2600)
-- в последовательность №73
update tms_task set sequence_number = 73 where id = 92 and sequence_number = 44;


-- Перемещение задания №  71 (Way4. Встановлення %% ставок). Старая последовательность  18
-- в выполнение в паралели с заданием № 81 (2. Виконання операції "Закриття вкладів після закінчення строку дії")
-- в последовательность №32
update tms_task set sequence_number = 32 where id = 71 and sequence_number = 18;



commit;