declare 
    id_ number ;
begin 

    bc.go('/'); 

    id_ := TMS_UTL.create_or_replace_task (
             p_task_code               => 'SMB_INACTIVE_INTEREST_OPTION' -- унікальний код процедури (довідник TMS_TASK)
            ,p_task_group_id           => 2  -- контекст банківської дати при виконанні процедури: 1 - фініш, 2 - старт, 3 - не встановлюється контекст дати
            ,p_sequence_number         => 312  -- порядковий номер виконання завдання (може дублюватися)
            ,p_task_name               => 'Актуализация процентных ставок для депозитов ММСБ'   -- назва завдання
            ,p_task_description        => 'Ежедневная актуализация процентных ставок для депозитов ММСБ'  -- додатковий текстовий опис завдання
            ,p_separate_by_branch_mode => 1  -- режим представлення РУ: 1 - виконувати процедуру на "/", 2 - кожна РУ обробляється по черзі, 3 - всі РУ обробляються паралельно
            ,p_action_on_failure       => 1  -- порядок дій у разі виникнення помилки: 1 - продовжити виконання процедур, 2 - зупинити виконання наступних процедур
            ,p_task_statement          =>
                                         'begin
                                              smb_deposit_utl.set_inactive_deal_int_option(gl.bd);
                                              commit;
                                          end ;' -- PL/SQL-блок, що виконується для даного завдання
       ) ;
 
    commit;
end;
/
