
PROMPT ===================================================================================== 
PROMPT *** Run *** ========== Scripts /Sql/Bars/Data/patch_data_FIN_QUESTION.sql =========**
PROMPT ===================================================================================== 

Begin
   update FIN_QUESTION
      set name = 'Немає розшифрування даних форми № 2 (2-м, 2-мс) “Звіт про фінансові результати» (графа 2000) за останній звітний рік щодо структури доходів',
	  descript = 'Немає розшифрування даних форми № 2 (2-м, 2-мс) “Звіт про фінансові результати» (графа 2000) за останній звітний рік щодо структури доходів'
    where kod = 'PD20'
      and idf = 53;
end;
/
COMMIT;


PROMPT ===================================================================================== 
PROMPT *** End *** ========== Scripts /Sql/Bars/Data/patch_data_FIN_QUESTION.sql =========**
PROMPT ===================================================================================== 
