function useNewNbs() {
    var res = 'true';
    $.ajax({
        type: "POST",
        url: bars.config.urlContent("/webservices/NewNbs.asmx/UseNewNbs"),

        async: false,
        success: function (result) {
            if (result)
                res = result.text || result.children[0].innerHTML;
        }
    });
    return res.toLowerCase() == 'true';
};

var checkOperCloseRights = {
    isItemInArr: function (item, arr) {
        return arr.indexOf(item) !== -1;
    },

    accCanBeClosed: function (nbs, ob22) {
        var iData = this._useNewNbs ? this.innerDataNewNbs : this.innerData;

        nbs = String(nbs);
        ob22 = String(ob22);

        var arrNBS = Object.keys(iData);
        if (nbs === "2625") {
            return false;
        }
        if (this.isItemInArr(nbs, arrNBS)) {
            var arrObb22 = iData[nbs];
            if (this.isItemInArr(ob22, arrObb22)) {
                return false;
            }
        }
        return true;
    },

    innerData: {
        2202: [
            "45",  //-  кредит за банківським продуктом  "Економний" в системі WAY4;
            "46",  //-  кредит за банківським продуктом "Стандартний" в системі WAY4;
            "47",  //-  кредит за банківським продуктом "Зарплатний " для працівників суб"єктів господарювання в системі WAY4;
            "48",  //-  кредит за банківським продуктом "Зарплатний" для працівників банку в системі WAY4;
            "49",  //-  кредит за банківським продуктом "Преміум" в системі WAY4;
            "50",  //-  кредит за банківським продуктом "Пенсійний" в системі WAY4;
            "51",  //-  кредит за банківським продуктом "Арсенал"  в системі WAY4;
            "52",  //-  кредит за банківським продуктом  "Зарплатний бюджетний" в системі WAY4;
            "53",  //-  кредит за банківським продуктом "Зарплатний студентський" в системі WAY4;
            "59",  //-  споживчі кредити для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "60"   //-  споживчі кредити для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4;
        ],
        2203: [
            "36",  //-  кредит за банківським продуктом "Зарплатний" для працівників суб"єктів господарювання в національній валюті в системі WAY4;
            "37",  //-  кредит за банківським продуктом  "Економний" в системі WAY4;
            "38",  //-  кредит за банківським продуктом "Стандартний" в системі WAY4;
            "39",  //-  кредит за банківським продуктом "Зарплатний" для працівників банку в системі WAY4;
            "40",  //-  кредит за банківським продуктом "Преміум" в системі WAY4;
            "41",  //-  кредит за банківським продуктом "Пенсійний" в системі WAY4;
            "42",  //-  кредит за банківським продуктом "Арсенал"  в системі WAY4;
            "43",  //-  кредит за банківським продуктом  "Зарплатний бюджетний" в системі WAY4;
            "44",  //-  кредит за банківським продуктом "Зарплатний студентський" в системі WAY4;
            "49",  //-  споживчі кредити для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "50"   //-  споживчі кредити для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4;
        ],
        2207: [
            "B3",  //-  за кредитами за банківським продуктом "Соціальний служби зайнятості" в системі WAY4;
            "B4",  //-  за довгостроковими кредитами за банківським продуктом "Зарплатний" для працівників суб"єктів господарювання в системі WAY4;
            "B6",  //-  короткострокові кредити за банківським продуктом  "Економний" в системі WAY4;
            "B7",  //-  довгострокові  кредити за банківським продуктом  "Економний" в системі WAY4;
            "B8",  //-  короткострокові кредити за банківським продуктом "Стандартний" в системі WAY4;
            "B9",  //-  довгострокові кредити за банківським продуктом "Стандартний" в системі WAY4;
            "C1",  //-  короткострокові кредити за банківським продуктом "Зарплатний" для працівників банку в системі WAY4;
            "C2",  //-  довгострокові  кредити за банківським продуктом "Зарплатний" для працівників банку в системі WAY4;
            "C3",  //-  короткострокові кредити за банківським продуктом "Преміум" в системі WAY4;
            "C4",  //-  довгострокові кредити за банківським продуктом "Преміум" в системі WAY4;
            "C5",  //-  короткострокові кредити за банківським продуктом "Пенсійний" в системі WAY4;
            "C6",  //-  довгострокові кредити за банківським продуктом "Пенсійний" в системі WAY4;
            "C7",  //-  короткострокові кредити за банківським продуктом "Арсенал"  в системі WAY4;
            "C8",  //-  довгострокові кредити за банківським продуктом "Арсенал"  в системі WAY4;
            "C9",  //-  короткострокові кредити за банківським продуктом "Зарплатний"  для працівників суб"єктів господарювання в системі WAY4;
            "D0",  //-  короткострокові кредити за банківським продуктом  " Зарплатний бюджетний " в системі WAY4;
            "D1",  //-  довгострокові  кредити за банківським продуктом  " Зарплатний бюджетний " в системі WAY4;
            "D2",  //-  короткострокові кредити за банківським продуктом " Зарплатний студентський " в системі WAY4;
            "D3",  //-  довгострокові кредити за банківським продуктом " Зарплатний студентський" в системі WAY4;
            "D4",  //-  прострочений несанкціонований овердрафт за банківським продуктом " Соціальний мінсоцполітики " в системі WAY4;
            "D5",  //-  прострочений несанкціонований овердрафт за банківським продуктом   "Віртуальна картка " в системі WAY4;
            "E5",  //-  короткострокові споживчі кредити для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "E6",  //-  довгострокові споживчі кредити для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "E7",  //-  короткострокові споживчі кредити для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4;
            "E8"   //-  довгострокові споживчі кредити для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4;
        ],
        2208: [
            "D1",  //-  за довгостроковими кредитами за банківським продуктом  "Зарплатний" для працівників суб"єктів господарювання в системі  WAY4;
            "D3",  //-  за короткостроковими кредитами за банківським продуктом  "Економний" в системі WAY4;
            "D4",  //-  за довгостроковими кредитами за банківським продуктом  "Економний" в системі WAY4;
            "D5",  //-  за короткостроковими кредитами за банківським продуктом "Стандартний" в системі WAY4;
            "D6",  //-  за довгостроковими кредитами за банківським продуктом "Стандартний" в системі WAY4;
            "D7",  //-  за короткостроковими кредитами за банківським продуктом  "Зарплатний" для працівників суб"єктів господарювання в системі  WAY4;
            "D8",  //-  за короткостроковими кредитами за банківським продуктом "Зарплатний" для працівників банку в системі WAY4;
            "D9",  //-  за довгостроковими кредитами за банківським продуктом "Зарплатний" для працівників банку в системі WAY4;
            "E0",  //-  за короткостроковими кредитами за банківським продуктом "Преміум" в системі WAY4;
            "E1",  //-  за довгостроковими кредитами за банківським продуктом "Преміум" в системі WAY4;
            "E2",  //-  за короткостроковими кредитами за банківським продуктом "Пенсійний" в системі WAY4;
            "E3",  //-  за довгостроковими кредитами за банківським продуктом "Пенсійний" в системі WAY4;
            "E4",  //-  за короткостроковими кредитами за банківським продуктом "Арсенал"  в системі WAY4;
            "E5",  //-  за довгостроковими кредитами за банківським продуктом "Арсенал"  в системі WAY4;
            "E6",  //-  за короткостроковими кредитами за банківським продуктом  " Зарплатний бюджетний " в системі WAY4;
            "E7",  //-  за довгостроковими кредитами за банківським продуктом  " Зарплатний бюджетний " в системі WAY4;
            "E8",  //-  за короткостроковими кредитами за банківським продуктом " Зарплатний студентський " в системі WAY4;
            "E9",  //-  за довгостроковими кредитами за банківським продуктом " Зарплатний студентський " в системі WAY4;
            "F9",  //-  за короткостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "G0",  //-  за довгостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "G1",  //-  за короткостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4;
            "G2"   //-  за довгостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4;
        ],
        2209: [
            "E4",  //-  за кредитами за банківським продуктом "Соціальний служби зайнятості" в системі WAY4;
            "E5",  //-  за довгостроковими кредитами за банківським продуктом "Зарплатний" для працівників суб"єктів господарювання в системі WAY4;
            "E7",  //-  прострочені нараховані доходи за короткостроковими кредитами за банківським продуктом  "Економний" в системі WAY4;
            "E8",  //-  прострочені нараховані доходи за довгостроковими кредитами за банківським продуктом  "Економний" в системі WAY4;
            "E9",  //-  прострочені нараховані доходи за короткостроковими кредитами за банківським продуктом "Стандартний" в системі WAY4;
            "F0",  //-  прострочені нараховані доходи за довгостроковими кредитами за банківським продуктом "Стандартний" в системі WAY4;
            "F1",  //-  прострочені нараховані доходи за короткостроковими кредитами за банківським продуктом  "Зарплатний" для працівників суб"єктів господарювання в системі  WAY4;
            "F2",  //-  прострочені нараховані доходи за короткостроковими кредитами за банківським продуктом "Зарплатний" для працівників банку в системі WAY4;
            "F3",  //-  прострочені нараховані доходи за довгостроковими кредитами за банківським продуктом "Зарплатний" для працівників банку в системі WAY4;
            "F4",  //-  прострочені нараховані доходи за короткостроковими кредитами за банківським продуктом "Преміум" в системі WAY4;
            "F5",  //-  прострочені нараховані доходи за довгостроковими кредитами за банківським продуктом "Преміум" в системі WAY4;
            "F6",  //-  прострочені нараховані доходи за короткостроковими кредитами за банківським продуктом "Пенсійний" в системі WAY4;
            "F7",  //-  прострочені нараховані доходи за довгостроковими кредитами за банківським продуктом "Пенсійний" в системі WAY4;
            "F8",  //-  прострочені нараховані доходи за короткостроковими кредитами за банківським продуктом "Арсенал"  в системі WAY4;
            "F9",  //-  прострочені нараховані доходи за довгостроковими кредитами за банківським продуктом "Арсенал"  в системі WAY4;
            "G0",  //-  прострочені нараховані доходи за короткостроковими кредитами за банківським продуктом  "Зарплатний бюджетний "в системі WAY4;
            "G1",  //-  прострочені нараховані доходи за довгостроковими кредитами за банківським продуктом  "Зарплатний бюджетний "в системі WAY4;
            "G2",  //-  прострочені нараховані доходи за короткостроковими кредитами за банківським продуктом " Зарплатний студентський "в системі WAY4;
            "G3",  //-  прострочені нараховані доходи за довгостроковими кредитами за банківським продуктом " Зарплатний студентський "в системі WAY4;
            "G4",  //-  прострочені нараховані доходи за несанкціонованим овердрафтом   за банківським продуктом  " Соціальний мінсоцполітики "   в системі  WAY4;
            "G5",  //-  прострочені нараховані доходи за несанкціонованим овердрафтом за банківським продуктом   "Віртуальна картка " в системі WAY4;
            "H5",  //-  прострочені нараховані доходи за короткостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "H6",  //-  прострочені нараховані доходи за довгостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "H7",  //-  прострочені нараховані доходи за короткостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4;
            "H8",  //-  прострочені нараховані доходи за довгостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4;
            "H5",  //-  прострочені нараховані доходи за короткостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "H6",  //-  прострочені нараховані доходи за довгостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "H7",  //-  прострочені нараховані доходи за короткостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4;
            "H8"   //-  прострочені нараховані доходи за довгостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4;
        ],
        2607: [
            "01",  //-  за рахунками овердрафт;
            "07",  //-  за несанкціонованим овердрафтом банківським продуктом  "Корпоративні платіжні картки клієнтів- суб"єктів господарської діяльності" в системі WAY4";
            "08"   //-  за несанкціонованим овердрафтом за банківським продуктом  "Корпоративні платіжні картки клієнтів- фізичних осіб",  //-  підприємців"  в системі WAY4""
        ],
        2627: [
            "07",  //-  за банківським продуктом "Національна картка"  в системі WAY4;
            "08",  //-  за банківським продуктом "Соціальний служби зайнятості" в системі WAY4;
            "09",  //-  за банківським продуктом "Зарплатний" для працівників суб"єктів господарювання в системі WAY4;
            "10",  //-  за банківським продуктом  "Економний" в системі WAY4;
            "11",  //-  за банківським продуктом "Стандартний" в системі WAY4;
            "12",  //-  за банківським продуктом "Зарплатний" для працівників банку в системі WAY4;
            "13",  //-  за банківським продуктом "Преміум" в системі WAY4;
            "14",  //-  за банківським продуктом "Пенсійний" в системі WAY4;
            "15",  //-  за банківським продуктом "Арсенал"  в системі WAY4;
            "16",  //-  за банківським продуктом  "Зарплатний бюджетний " в системі WAY4;
            "17",  //-  за банківським продуктом " Зарплатний студентський" в системі WAY4;
            "18",  //-  за несанкціонований овердрафт за банківським продуктом "Соціальний мінсоцполітики" в системі WAY4;
            "19",  //-  за несанкціонований овердрафт за банківським продуктом  " Віртуальна картка " в системі WAY4;
            "20",  //-  за рахунками  для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "21"   //-  за рахунками  для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4
        ],
        2628: [
            "31",  //-  за банківським продуктом "Національна картка" в системі WAY4;
            "32",  //-  за банківським продуктом "Соціальний служби зайнятості" в системі WAY4;
            "33",  //-  за банківським продуктом "Зарплатний" для працівників суб"єктів господарювання в системі WAY4;
            "34",  //-  за банківським продуктом  "Економний" в системі WAY4;
            "35",  //-  за банківським продуктом "Стандартний" в системі WAY4;
            "36",  //-  за банківським продуктом "Зарплатний" для працівників банку в системі WAY4;
            "37",  //-  за банківським продуктом "Преміум" в системі WAY4;
            "38",  //-  за банківським продуктом "Пенсійний" в системі WAY4;
            "39",  //-  за банківським продуктом "Арсенал"  в системі WAY4;
            "40",  //-  за банківським продуктом  "Зарплатний бюджетний " в системі WAY4;
            "41",  //-  за банківським продуктом " Зарплатний студентський" в системі WAY4;
            "42",  //-  за банківським продуктом " Соціальний мінсоцполітики" в системі WAY4;
            "43",  //-  за банківським продуктом " Віртуальна картка "в системі WAY4
            "45",  //-  за рахунками  для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "46"   //-  за рахунками  для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4;
        ],
        3570: [
            "13",  //-  за нарахованими доходами за банківським продуктом "Соціальний служби зайнятості" в системі WAY4;
            "14",  //-  за нарахованими доходами за банківським продуктом "Національна картка" в системі WAY4;
            "15",  //-  за нарахованими доходами за банківським продуктом "Зарплатний" для працівників суб"єктів господарювання в системі WAY4;
            "16",  //-  за нарахованими доходами за банківським продуктом  "Економний" в системі WAY4;
            "17",  //-  за нарахованими доходами за банківським продуктом "Стандартний" в системі WAY4;
            "18",  //-  за нарахованими доходами за банківським продуктом "Зарплатний" для працівників банку в системі WAY4;
            "19",  //-  за нарахованими доходами за банківським продуктом "Преміум" в системі WAY4;
            "20",  //-  за нарахованими доходами за банківським продуктом "Пенсійний" в системі WAY4;
            "21",  //-  за нарахованими доходами за банківським продуктом "Арсенал"  в системі WAY4;
            "22",  //-  за нарахованими доходами за банківським продуктом  "Зарплатний бюджетний " в системі WAY4;
            "23",  //-  за нарахованими доходами за банківським продуктом " Зарплатний студентський" в системі WAY4;
            "24",  //-  за нарахованими доходами за банківським продуктом " Соціальний мінсоцполітики" в системі WAY4;
            "25",  //-  за нарахованими доходами за банківським продуктом " Віртуальна картка "в системі WAY4;
            "26",  //-  за нарахованими доходами за банківським продуктом " Корпоративні платіжні картки клієнтів- суб"єктів господарської діяльності " в системі WAY4;
            "27",  //-  за нарахованими доходами за банківським продуктом " Корпоративні платіжні картки клієнтів- фізичних осіб",  //-  підприємців " в системі WAY4;
            "28",  //-  за нарахованими доходами за банківським продуктом " Корпоративні платіжні картки клієнтів- небанківських фінансових установ" в системі WAY4;
            "30",  //-  за нарахованими доходами за банківським продуктом " Корпоративні платіжні картки клієнтів- бюджетних установ" в системі WAY4;
            "31",  //-  за нарахованими доходами за рахунками  для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "32"   //-  за нарахованими доходами за рахунками  для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4;
        ],
        3579: [
            "66",  //-  прострочені нараховані доходи за банківським продуктом "Національна картка" в системі WAY4;
            "67",  //-  прострочені нараховані доходи за банківським продуктом  "Соціальний служби зайнятості" в системі WAY4;
            "68",  //-  прострочені нараховані доходи за банківським продуктом "Зарплатний" для працівників суб"єктів господарювання в системі WAY4;
            "69",  //-  прострочені нараховані доходи за банківським продуктом  "Економний" в системі WAY4;
            "70",  //-  прострочені нараховані доходи за банківським продуктом "Стандартний" в системі WAY4;
            "71",  //-  прострочені нараховані доходи за банківським продуктом "Зарплатний" для працівників банку в системі WAY4;
            "72",  //-  прострочені нараховані доходи за банківським продуктом "Преміум" в системі WAY4;
            "73",  //-  прострочені нараховані доходи за банківським продуктом "Пенсійний" в системі WAY4;
            "74",  //-  прострочені нараховані доходи за банківським продуктом "Арсенал"  в системі WAY4;
            "75",  //-  прострочені нараховані доходи за банківським продуктом  "Зарплатний бюджетний" в системі WAY4;
            "76",  //-  прострочені нараховані доходи за банківським продуктом " Зарплатний студентський" в системі WAY4;
            "77",  //-  прострочені нараховані доходи за банківським продуктом " Соціальний мінсоцполітики"в системі WAY4;
            "78",  //-  прострочені нараховані доходи за банківським продуктом  " Віртуальна картка " в системі WAY4;
            "79",  //-  прострочені нараховані доходи за банківським продуктом " Корпоративні платіжні картки клієнтів- суб"єктів господарської діяльності" в системі WAY4;
            "80",  //-  прострочені нараховані доходи за банківським продуктом " Корпоративні платіжні картки клієнтів- фізичних осіб",  //-  підприємців " в системі WAY4;
            "81",  //-  прострочені нараховані доходи за банківським продуктом " Корпоративні платіжні картки клієнтів- небанківських фінансових установ" в системі WAY4;
            "82",  //-  прострочені нараховані доходи за банківським продуктом " Корпоративні платіжні картки клієнтів- бюджетних установ" в системі WAY4;
            "86",  //-  прострочені нараховані доходи за рахунками  для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "87"   //-  прострочені нараховані доходи за рахунками  для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4;
        ],
        9129: [
            "22",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Зарплатний" для працівників суб"єктів господарювання в системі WAY4 (за якими банк ризику не несе);
            "23",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Економний" в системі WAY4 (за якими банк ризику не несе);
            "24",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Стандартний"  в системі WAY4 (за якими банк ризику не несе);
            "25",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Преміум" в системі WAY4  (за якими банк ризику не несе);
            "26",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Пенсійний" в системі WAY4 (за якими банк ризику не несе);
            "27",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Арсенал" в системі WAY4 (за якими банк ризику не несе);
            "28",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Зарплатний" для працівників банку в системі WAY4 (за якими банк ризику не несе);
            "29",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом " Зарплатний бюджетний " в системі WAY4 (за якими банк ризику не несе);
            "30",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом " Зарплатний студентський "  в системі WAY4 (за якими банк ризику не несе);
            "32",  //-  зобов"язання з кредитування", які надані фізичним особам за короткостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4 (за якими банк ризику не несе);
            "33",  //-  зобов"язання з кредитування", які надані фізичним особам за довгостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4 (за якими банк ризику не несе);
            "34",  //-  зобов"язання з кредитування", які  надані фізичним особам за короткостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4 (за якими банк  ризику не несе);
            "35"   //-  зобов"язання з кредитування", які  надані фізичним особам за довгостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4 (за якими банк  ризику не несе)
        ],
        9900: [
            "22",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Зарплатний" для працівників суб"єктів господарювання в системі WAY4 (за якими банк ризику не несе);
            "23",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Економний" в системі WAY4 (за якими банк ризику не несе);
            "24",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Стандартний"  в системі WAY4 (за якими банк ризику не несе);
            "25",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Преміум" в системі WAY4  (за якими банк ризику не несе);
            "26",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Пенсійний" в системі WAY4 (за якими банк ризику не несе);
            "27",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Арсенал" в системі WAY4 (за якими банк ризику не несе);
            "28",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Зарплатний" для працівників банку в системі WAY4 (за якими банк ризику не несе);
            "29",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом " Зарплатний бюджетний " в системі WAY4 (за якими банк ризику не несе);
            "30",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом " Зарплатний студентський "  в системі WAY4 (за якими банк ризику не несе);
            "32",  //-  зобов"язання з кредитування", які надані фізичним особам за короткостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4 (за якими банк ризику не несе);
            "33",  //-  зобов"язання з кредитування", які надані фізичним особам за довгостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4 (за якими банк ризику не несе);
            "34",  //-  зобов"язання з кредитування", які  надані фізичним особам за короткостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4 (за якими банк  ризику не несе);
            "35"   //-  зобов"язання з кредитування", які  надані фізичним особам за довгостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4 (за якими банк  ризику не несе)
        ],
        2605: [
            "12",  //-  банківський продукт "Корпоративні платіжні картки клієнтів-суб"єктів господарської діяльності" в системі WAY4";
            "13"   //-  банківський продукт "Корпоративні платіжні картки клієнтів- фізичних осіб- підприємців" в системі WAY4"
        ],
        2625: [
            "22",  //-  банківський продукт "Національна картка" в системі WAY4;
            "23",  //-  банківський продукт "Соціальний служби зайнятості" в системі WAY4;
            "24",  //-  банківський продукт "Зарплатний" для працівників суб"єктів господарювання в системі WAY4;
            "25",  //-  банківський продукт "Економний" в системі WAY4;
            "26",  //-  банківський продукт "Стандартний" в системі WAY4;
            "27",  //-  банківський продукт "Зарплатний" для працівників банку в системі WAY4;
            "28",  //-  банківський продукт "Преміум" в системі WAY4;
            "29",  //-  банківський продукт "Пенсійний" в системі WAY4;
            "30",  //-  банківський продукт "Арсенал"  в системі WAY4;
            "31",  //-  банківський продукт "Зарплатний бюджетний "в системі WAY4;
            "32",  //-  банківський продукт " Зарплатний студентський "в системі WAY4;
            "33",  //-  банківський продукт " Соціальний мінсоцполітики" в системі WAY4;
            "34",  //-  банківський продукт " Віртуальна картка "в системі WAY4;
            "35",  //-  картки для окремих категорій клієнтів за банківський продукт "Стандартний" в системі WAY4;
            "36"   //-  картки для окремих категорій клієнтів за банківський продукт "Економний" в системі WAY4
        ],
        2628: [
            "31",  //-  за банківським продуктом "Національна картка" в системі WAY4;
            "32",  //-  за банківським продуктом "Соціальний служби зайнятості" в системі WAY4;
            "33",  //-  за банківським продуктом "Зарплатний" для працівників суб"єктів господарювання в системі WAY4;
            "34",  //-  за банківським продуктом  "Економний" в системі WAY4;
            "35",  //-  за банківським продуктом "Стандартний" в системі WAY4;
            "36",  //-  за банківським продуктом "Зарплатний" для працівників банку в системі WAY4;
            "37",  //-  за банківським продуктом "Преміум" в системі WAY4;
            "38",  //-  за банківським продуктом "Пенсійний" в системі WAY4;
            "39",  //-  за банківським продуктом "Арсенал"  в системі WAY4;
            "40",  //-  за банківським продуктом  "Зарплатний бюджетний " в системі WAY4;
            "41",  //-  за банківським продуктом " Зарплатний студентський" в системі WAY4;
            "42",  //-  за банківським продуктом " Соціальний мінсоцполітики" в системі WAY4;
            "43",  //-  за банківським продуктом " Віртуальна картка "в системі WAY4
            "44",  //-  за рахунками моряків;
            "45",  //-  за рахунками  для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "46"   //-  за рахунками  для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4;
        ]
    },
    innerDataNewNbs: {
        //		2202: [
        //			все пішло в 2203 об "70"
        //          об "53" видалено 
        //		],
        2203: [
            "36",  //-  кредит за банківським продуктом "Зарплатний" для працівників суб"єктів господарювання в національній валюті в системі WAY4;
            "37",  //-  кредит за банківським продуктом  "Економний" в системі WAY4;
            "38",  //-  кредит за банківським продуктом "Стандартний" в системі WAY4;
            "39",  //-  кредит за банківським продуктом "Зарплатний" для працівників банку в системі WAY4;
            "40",  //-  кредит за банківським продуктом "Преміум" в системі WAY4;
            "41",  //-  кредит за банківським продуктом "Пенсійний" в системі WAY4;
            "42",  //-  кредит за банківським продуктом "Арсенал"  в системі WAY4;
            "43",  //-  кредит за банківським продуктом  "Зарплатний бюджетний" в системі WAY4;
            "44",  //-  кредит за банківським продуктом "Зарплатний студентський" в системі WAY4;
            "49",  //-  споживчі кредити для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "50",  //-  споживчі кредити для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4;
            "70",  //-  Довгострокові кредити за поточними рахункам фізичних осіб з використаням платіжих карток в системі WAY4
            "87",  //- Прострочена заборгованість по кредити за поточними рахункам фізичних осіб з використаням платіжих карток в системі WAY4
        ],
        //		2207: [
        //          все пішло в 2203 об "87"
        //			об "D2" видалено
        //		],
        2208: [
            "D1",  //-  за довгостроковими кредитами за банківським продуктом  "Зарплатний" для працівників суб"єктів господарювання в системі  WAY4;
            "D3",  //-  за короткостроковими кредитами за банківським продуктом  "Економний" в системі WAY4;
            "D4",  //-  за довгостроковими кредитами за банківським продуктом  "Економний" в системі WAY4;
            "D5",  //-  за короткостроковими кредитами за банківським продуктом "Стандартний" в системі WAY4;
            "D6",  //-  за довгостроковими кредитами за банківським продуктом "Стандартний" в системі WAY4;
            "D7",  //-  за короткостроковими кредитами за банківським продуктом  "Зарплатний" для працівників суб"єктів господарювання в системі  WAY4;
            "D8",  //-  за короткостроковими кредитами за банківським продуктом "Зарплатний" для працівників банку в системі WAY4;
            "D9",  //-  за довгостроковими кредитами за банківським продуктом "Зарплатний" для працівників банку в системі WAY4;
            "E0",  //-  за короткостроковими кредитами за банківським продуктом "Преміум" в системі WAY4;
            "E1",  //-  за довгостроковими кредитами за банківським продуктом "Преміум" в системі WAY4;
            "E2",  //-  за короткостроковими кредитами за банківським продуктом "Пенсійний" в системі WAY4;
            "E3",  //-  за довгостроковими кредитами за банківським продуктом "Пенсійний" в системі WAY4;
            "E4",  //-  за короткостроковими кредитами за банківським продуктом "Арсенал"  в системі WAY4;
            "E5",  //-  за довгостроковими кредитами за банківським продуктом "Арсенал"  в системі WAY4;
            "E6",  //-  за короткостроковими кредитами за банківським продуктом  " Зарплатний бюджетний " в системі WAY4;
            "E7",  //-  за довгостроковими кредитами за банківським продуктом  " Зарплатний бюджетний " в системі WAY4;
            "E8",  //-  за короткостроковими кредитами за банківським продуктом " Зарплатний студентський " в системі WAY4;
            "E9",  //-  за довгостроковими кредитами за банківським продуктом " Зарплатний студентський " в системі WAY4;
            "F9",  //-  за короткостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "G0",  //-  за довгостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "G1",  //-  за короткостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4;
            "G2",  //-  за довгостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4;
            "I3"   //-  Прострочені нараховані доходи по кредитам за поточними рахункам фізичних осіб з використаням платіжих карток в системі WAY4

        ],
        //		2209: [	
        //          все пішло в 2208 об "I3" 
        //			об "G2" видалено							
        //		],
        2607: [
            "01",  //-  за рахунками овердрафт;
            "07",  //-  за несанкціонованим овердрафтом банківським продуктом  "Корпоративні платіжні картки клієнтів- суб"єктів господарської діяльності" в системі WAY4";
            "08"   //-  за несанкціонованим овердрафтом за банківським продуктом  "Корпоративні платіжні картки клієнтів- фізичних осіб",  //-  підприємців"  в системі WAY4""
        ],
        2627: [
            "07",  //-  за банківським продуктом "Національна картка"  в системі WAY4;
            "08",  //-  за банківським продуктом "Соціальний служби зайнятості" в системі WAY4;
            "09",  //-  за банківським продуктом "Зарплатний" для працівників суб"єктів господарювання в системі WAY4;
            "10",  //-  за банківським продуктом  "Економний" в системі WAY4;
            "11",  //-  за банківським продуктом "Стандартний" в системі WAY4;
            "12",  //-  за банківським продуктом "Зарплатний" для працівників банку в системі WAY4;
            "13",  //-  за банківським продуктом "Преміум" в системі WAY4;
            "14",  //-  за банківським продуктом "Пенсійний" в системі WAY4;
            "15",  //-  за банківським продуктом "Арсенал"  в системі WAY4;
            "16",  //-  за банківським продуктом  "Зарплатний бюджетний " в системі WAY4;
            "17",  //-  за банківським продуктом " Зарплатний студентський" в системі WAY4;
            "18",  //-  за несанкціонований овердрафт за банківським продуктом "Соціальний мінсоцполітики" в системі WAY4;
            "19",  //-  за несанкціонований овердрафт за банківським продуктом  " Віртуальна картка " в системі WAY4;
            "20",  //-  за рахунками  для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "21"   //-  за рахунками  для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4
        ],
        2628: [
            "31",  //-  за банківським продуктом "Національна картка" в системі WAY4;
            "32",  //-  за банківським продуктом "Соціальний служби зайнятості" в системі WAY4;
            "33",  //-  за банківським продуктом "Зарплатний" для працівників суб"єктів господарювання в системі WAY4;
            "34",  //-  за банківським продуктом  "Економний" в системі WAY4;
            "35",  //-  за банківським продуктом "Стандартний" в системі WAY4;
            "36",  //-  за банківським продуктом "Зарплатний" для працівників банку в системі WAY4;
            "37",  //-  за банківським продуктом "Преміум" в системі WAY4;
            "38",  //-  за банківським продуктом "Пенсійний" в системі WAY4;
            "39",  //-  за банківським продуктом "Арсенал"  в системі WAY4;
            "40",  //-  за банківським продуктом  "Зарплатний бюджетний " в системі WAY4;
            "41",  //-  за банківським продуктом " Зарплатний студентський" в системі WAY4;
            "42",  //-  за банківським продуктом " Соціальний мінсоцполітики" в системі WAY4;
            "43",  //-  за банківським продуктом " Віртуальна картка "в системі WAY4
            "45",  //-  за рахунками  для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "46"   //-  за рахунками  для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4;
        ],
        3570: [
            "13",  //-  за нарахованими доходами за банківським продуктом "Соціальний служби зайнятості" в системі WAY4;
            "14",  //-  за нарахованими доходами за банківським продуктом "Національна картка" в системі WAY4;
            "15",  //-  за нарахованими доходами за банківським продуктом "Зарплатний" для працівників суб"єктів господарювання в системі WAY4;
            "16",  //-  за нарахованими доходами за банківським продуктом  "Економний" в системі WAY4;
            "17",  //-  за нарахованими доходами за банківським продуктом "Стандартний" в системі WAY4;
            "18",  //-  за нарахованими доходами за банківським продуктом "Зарплатний" для працівників банку в системі WAY4;
            "19",  //-  за нарахованими доходами за банківським продуктом "Преміум" в системі WAY4;
            "20",  //-  за нарахованими доходами за банківським продуктом "Пенсійний" в системі WAY4;
            "21",  //-  за нарахованими доходами за банківським продуктом "Арсенал"  в системі WAY4;
            "22",  //-  за нарахованими доходами за банківським продуктом  "Зарплатний бюджетний " в системі WAY4;
            "23",  //-  за нарахованими доходами за банківським продуктом " Зарплатний студентський" в системі WAY4;
            "24",  //-  за нарахованими доходами за банківським продуктом " Соціальний мінсоцполітики" в системі WAY4;
            "25",  //-  за нарахованими доходами за банківським продуктом " Віртуальна картка "в системі WAY4;
            "26",  //-  за нарахованими доходами за банківським продуктом " Корпоративні платіжні картки клієнтів- суб"єктів господарської діяльності " в системі WAY4;
            "27",  //-  за нарахованими доходами за банківським продуктом " Корпоративні платіжні картки клієнтів- фізичних осіб",  //-  підприємців " в системі WAY4;
            "28",  //-  за нарахованими доходами за банківським продуктом " Корпоративні платіжні картки клієнтів- небанківських фінансових установ" в системі WAY4;
            "30",  //-  за нарахованими доходами за банківським продуктом " Корпоративні платіжні картки клієнтів- бюджетних установ" в системі WAY4;
            "31",  //-  за нарахованими доходами за рахунками  для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "32"   //-  за нарахованими доходами за рахунками  для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4;
        ],
        3578: [
            "43",  //- прострочені нараховані доходи за поточними рахункам фізичних осіб з використаням платіжих карток в системі WAY4
            "56",  //- прострочені нараховані доходи за банківським продуктом ` Корпоративні платіжні картки клієнтів-суб`єктів господарської діяльності` в системі WAY4
            "57",  //- прострочені нараховані доходи за банківським продуктом " Корпоративні платіжні картки клієнтів-фізичних осіб - підприємців " в системі WAY4
            "58",  //- прострочені нараховані доходи за банківським продуктом " Корпоративні платіжні картки клієнтів-небанківських фінансових установ" в системі WAY4
            "59"   //- прострочені нараховані доходи за банківським продуктом " Корпоративні платіжні картки клієнтів-бюджетних установ" в системі WAY4

        ],
        //		3579: [
        //          все пішло в 3578 об "43, 56, 57, 58, 59" 			
        //		],
        9129: [
            "22",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Зарплатний" для працівників суб"єктів господарювання в системі WAY4 (за якими банк ризику не несе);
            "23",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Економний" в системі WAY4 (за якими банк ризику не несе);
            "24",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Стандартний"  в системі WAY4 (за якими банк ризику не несе);
            "25",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Преміум" в системі WAY4  (за якими банк ризику не несе);
            "26",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Пенсійний" в системі WAY4 (за якими банк ризику не несе);
            "27",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Арсенал" в системі WAY4 (за якими банк ризику не несе);
            "28",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Зарплатний" для працівників банку в системі WAY4 (за якими банк ризику не несе);
            "29",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом " Зарплатний бюджетний " в системі WAY4 (за якими банк ризику не несе);
            "30",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом " Зарплатний студентський "  в системі WAY4 (за якими банк ризику не несе);
            "32",  //-  зобов"язання з кредитування", які надані фізичним особам за короткостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4 (за якими банк ризику не несе);
            "33",  //-  зобов"язання з кредитування", які надані фізичним особам за довгостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4 (за якими банк ризику не несе);
            "34",  //-  зобов"язання з кредитування", які  надані фізичним особам за короткостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4 (за якими банк  ризику не несе);
            "35"   //-  зобов"язання з кредитування", які  надані фізичним особам за довгостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4 (за якими банк  ризику не несе)
        ],
        9900: [
            "22",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Зарплатний" для працівників суб"єктів господарювання в системі WAY4 (за якими банк ризику не несе);
            "23",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Економний" в системі WAY4 (за якими банк ризику не несе);
            "24",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Стандартний"  в системі WAY4 (за якими банк ризику не несе);
            "25",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Преміум" в системі WAY4  (за якими банк ризику не несе);
            "26",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Пенсійний" в системі WAY4 (за якими банк ризику не несе);
            "27",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Арсенал" в системі WAY4 (за якими банк ризику не несе);
            "28",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом "Зарплатний" для працівників банку в системі WAY4 (за якими банк ризику не несе);
            "29",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом " Зарплатний бюджетний " в системі WAY4 (за якими банк ризику не несе);
            "30",  //-  зобов"язання з кредитування", надані фізособам за кредитами за банківським продуктом " Зарплатний студентський "  в системі WAY4 (за якими банк ризику не несе);
            "32",  //-  зобов"язання з кредитування", які надані фізичним особам за короткостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4 (за якими банк ризику не несе);
            "33",  //-  зобов"язання з кредитування", які надані фізичним особам за довгостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4 (за якими банк ризику не несе);
            "34",  //-  зобов"язання з кредитування", які  надані фізичним особам за короткостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4 (за якими банк  ризику не несе);
            "35"   //-  зобов"язання з кредитування", які  надані фізичним особам за довгостроковими споживчими кредитами для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4 (за якими банк  ризику не несе)
        ],
        2605: [
            "12",  //-  банківський продукт "Корпоративні платіжні картки клієнтів-суб"єктів господарської діяльності" в системі WAY4";
            "13"   //-  банківський продукт "Корпоративні платіжні картки клієнтів- фізичних осіб- підприємців" в системі WAY4"
        ],
        2625: [
            "22",  //-  банківський продукт "Національна картка" в системі WAY4;
            "23",  //-  банківський продукт "Соціальний служби зайнятості" в системі WAY4;
            "24",  //-  банківський продукт "Зарплатний" для працівників суб"єктів господарювання в системі WAY4;
            "25",  //-  банківський продукт "Економний" в системі WAY4;
            "26",  //-  банківський продукт "Стандартний" в системі WAY4;
            "27",  //-  банківський продукт "Зарплатний" для працівників банку в системі WAY4;
            "28",  //-  банківський продукт "Преміум" в системі WAY4;
            "29",  //-  банківський продукт "Пенсійний" в системі WAY4;
            "30",  //-  банківський продукт "Арсенал"  в системі WAY4;
            "31",  //-  банківський продукт "Зарплатний бюджетний "в системі WAY4;
            "32",  //-  банківський продукт " Зарплатний студентський "в системі WAY4;
            "33",  //-  банківський продукт " Соціальний мінсоцполітики" в системі WAY4;
            "34",  //-  банківський продукт " Віртуальна картка "в системі WAY4;
            "35",  //-  картки для окремих категорій клієнтів за банківський продукт "Стандартний" в системі WAY4;
            "36"   //-  картки для окремих категорій клієнтів за банківський продукт "Економний" в системі WAY4
        ],
        2628: [
            "31",  //-  за банківським продуктом "Національна картка" в системі WAY4;
            "32",  //-  за банківським продуктом "Соціальний служби зайнятості" в системі WAY4;
            "33",  //-  за банківським продуктом "Зарплатний" для працівників суб"єктів господарювання в системі WAY4;
            "34",  //-  за банківським продуктом  "Економний" в системі WAY4;
            "35",  //-  за банківським продуктом "Стандартний" в системі WAY4;
            "36",  //-  за банківським продуктом "Зарплатний" для працівників банку в системі WAY4;
            "37",  //-  за банківським продуктом "Преміум" в системі WAY4;
            "38",  //-  за банківським продуктом "Пенсійний" в системі WAY4;
            "39",  //-  за банківським продуктом "Арсенал"  в системі WAY4;
            "40",  //-  за банківським продуктом  "Зарплатний бюджетний " в системі WAY4;
            "41",  //-  за банківським продуктом " Зарплатний студентський" в системі WAY4;
            "42",  //-  за банківським продуктом " Соціальний мінсоцполітики" в системі WAY4;
            "43",  //-  за банківським продуктом " Віртуальна картка "в системі WAY4
            "44",  //-  за рахунками моряків;
            "45",  //-  за рахунками  для окремих категорій клієнтів за банківським продуктом "Стандартний" в системі WAY4;
            "46"   //-  за рахунками  для окремих категорій клієнтів за банківським продуктом "Економний" в системі WAY4;
        ]
    }
};