-- ======================================================================================
-- Module : UPL
-- Author : LESIVRI
-- Date   : 20.03.2019
-- ======================================================================================

-- TSK-0003801 UPL - не обрезать хвостики для nd при выгрузке NBU23_REZ

prompt -- ======================================================
prompt -- UPDATE BARSUPL.UPL_COLUMNS
prompt -- ======================================================

begin  update BARSUPL.UPL_COLUMNS set PREFUN = NULL where FILE_ID = 555 and COL_ID = 6  and COL_NAME = 'ND';
end;
/
