

PROMPT ===================================================================================== 
PROMPT *** Run *** ========== Scripts /Sql/BARS/Procedure/P_F92_NN.sql =========*** Run *** 
PROMPT ===================================================================================== 


PROMPT *** Create  procedure P_F92_NN ***

  CREATE OR REPLACE PROCEDURE BARS.P_F92_NN (Dat_ DATE   ,
                                      sheme_ varchar2 default 'G')  IS
/*%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% DESCRIPTION :	Процедура формирование файла #92 для КБ
% COPYRIGHT   :	Copyright UNITY-BARS Limited, 1999.All Rights Reserved.
% VERSION     : 30.05.2005
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    параметры: Dat_ - отчетная дата
    sheme_ - схема формирования
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%*/
	kodf_    varchar2(2):='92';
	userid_  number;

	dat1_	 date;
BEGIN
	-------------------------------------------------------------------
	SELECT id INTO userid_ FROM staff WHERE upper(logname)=upper(USER);
	-------------------------------------------------------------------
	Dat1_:=calc_pdat(Dat_);
	-------------------------------------------------------------------
	p_f12_NN (Dat_,sheme_,kodf_);
	------------------------------------------------------------------
	p_ch_file92('92',dat_,userid_);
	p_ch_sk('92',dat_,dat1_,userid_);
------------------------------------------------------------------
END P_F92_NN;
/
show err;

PROMPT *** Create  grants  P_F92_NN ***
grant EXECUTE                                                                on P_F92_NN        to WR_ALL_RIGHTS;



PROMPT ===================================================================================== 
PROMPT *** End *** ========== Scripts /Sql/BARS/Procedure/P_F92_NN.sql =========*** End *** 
PROMPT ===================================================================================== 
