

PROMPT ===================================================================================== 
PROMPT *** Run *** ========== Scripts /Sql/BARS/Procedure/P_PROC_SET_INT.sql =========*** Ru
PROMPT ===================================================================================== 


PROMPT *** Create  procedure P_PROC_SET_INT ***

  CREATE OR REPLACE PROCEDURE BARS.P_PROC_SET_INT (p_kodf_ IN VARCHAR2, p_sheme_ IN VARCHAR2,
	   	  		  		 o_nbuc_ OUT VARCHAR2, o_typ_ OUT NUMBER) IS
 ------------------------------------------------------------------------------------
 -- для внутренних файлов отчетности Сбербанка
 -- 25-05-2012 По умолчанию - схема С
 -- ВЕРСИЯ:  25.05.2012
 ------------------------------------------------------------------------------------
 -- функция возвращает
 -- настраиваимые параметры для фрмирования отчетности
 -- параметры: p_kodf_ - код функции
 -- 		   p_sheme_ - схема формирования
 -- возвращаемые значения: o_typ_ - способ формирования файлов в разрезе кодов
 --				 областей и кодов подразделений
 --		o_nbuc_ - код области, МФО или код области + код подразделения (для o_typ_=3)
 ------------------------------------------------------------------------------------
    b041_ VARCHAR2(20);
BEGIN
	SELECT DISTINCT ZZZ, NVL(pr_tobo,0)
	INTO o_nbuc_, o_typ_
	FROM KL_F00_INT
	WHERE KODF=p_kodf_ AND
		  A017 in (p_sheme_,'C','G');

EXCEPTION
		 WHEN NO_DATA_FOUND THEN
		 	  o_nbuc_:='';
			  o_typ_:=0;
		WHEN OTHERS THEN
			 RAISE_APPLICATION_ERROR(-20001,'Error in procedure p_proc_set: '||SQLERRM);
END;
/
show err;



PROMPT ===================================================================================== 
PROMPT *** End *** ========== Scripts /Sql/BARS/Procedure/P_PROC_SET_INT.sql =========*** En
PROMPT ===================================================================================== 
