create or replace view v_compen_passp as
select * from passp p
where p.passp in (1, --Паспорт громадянина України
                  3, --Свідоцтво про  народження
                  7, --Паспорт ID-картка(Резидент)
                 98, --Свідоцтво про смерть
                 95, --Свідоцтво про смерть (закордонний)
                 13, --Паспорт нерезидента
                 11, --Закордонний паспорт гр.України
                 15, --Тимчасове посвідчення особи
                 96, --Заповіт
                 97, --Свідоцтво про спадщину
                 94  --За рішенням суду
                 )
order by p.name;

COMMENT ON TABLE v_compen_passp  IS 'Список видів документів, які були вказані банком DOC-NEW-2014_v.doc і + Заповіт, Свідоцтво про спадщину, ID-картка, За рішенням суду';
GRANT SELECT ON v_compen_passp TO BARS_ACCESS_DEFROLE;