PROMPT ===================================================================================== 
PROMPT *** Run *** ========== Scripts /Sql/Bars/Data/Err/mod_CIM.sql =========*** Run *** ==
PROMPT ===================================================================================== 


PROMPT *** Create/replace ERR модуль CIM ***
declare
  l_mod  varchar2(3) := 'CIM';
  l_rus  varchar2(3) := 'RUS';
  l_ukr  varchar2(3) := 'UKR';
  l_eng  varchar2(3) := 'ENG';
  l_geo  varchar2(3) := 'GEO';
  l_exc  number      := -20000;
begin
    bars_error.add_module(l_mod, 'Валютний контроль(CIM)', 1);

    bars_error.add_message(l_mod, 1, l_exc, l_rus, 'Не описана виза валютного контроля!', '', 1, '1');
    bars_error.add_message(l_mod, 1, l_exc, l_ukr, 'Не описана віза валютного контролю!', '', 1, '1');

    bars_error.add_message(l_mod, 2, l_exc, l_rus, 'Некорректно задана виза валютного контроля!', '', 1, '2');
    bars_error.add_message(l_mod, 2, l_exc, l_ukr, 'Некоректно задана віза валютного контролю', '', 1, '2');

    bars_error.add_message(l_mod, 3, l_exc, l_rus, 'Отсутствует информация о тазве и адресе банковського учреждения. Заполните соответствующиэ данные в таблице CIM_JOURNAL_NUM!', '', 1, '3');
    bars_error.add_message(l_mod, 3, l_exc, l_ukr, 'Відсутня інформація про тазву та адресу банківської установи. Заповныть відповідні дані у таблиці CIM_JOURNAL_NUM!', '', 1, '3');

    bars_error.add_message(l_mod, 4, l_exc, l_rus, 'По даному учреждению отсутствуют неотправленные сообщения о задолжености!', '', 1, '4');
    bars_error.add_message(l_mod, 4, l_exc, l_ukr, 'По даній установі відсутні невідправлені повідомлення про заборгованість!', '', 1, '4');

    bars_error.add_message(l_mod, 5, l_exc, l_rus, 'Существуют неподтвержденніе сообщения о задолжености. Формирование файла невозможно !', '', 1, '5');
    bars_error.add_message(l_mod, 5, l_exc, l_ukr, 'Є непідтверджені повідомлення про заборгованість. Формування файлу неможливе!', '', 1, '5');

    bars_error.add_message(l_mod, 6, l_exc, l_rus, 'Контракт имеет статус <Проект>, <Регистрируется в НБУ> или <Закрыт>. Привязка/отвязка документов невозможна!', '', 1, '6');
    bars_error.add_message(l_mod, 6, l_exc, l_ukr, 'Контракт має статус <Проект>, <Реєструється у НБУ> або <Закритий>. Прив`язка/відв`язка документів неможлива!', '', 1, '6');

    bars_error.add_message(l_mod, 7, l_exc, l_rus, 'Закрытие/удаление контракта невозможно!', '', 1, '7');
    bars_error.add_message(l_mod, 7, l_exc, l_ukr, 'Закриття/видалення контракту неможливе!', '', 1, '7');

    bars_error.add_message(l_mod, 8, l_exc, l_rus, 'Не задана сума кредитного контракта!', '', 1, '8');
    bars_error.add_message(l_mod, 8, l_exc, l_ukr, 'Не задана сума кредитного контракту!', '', 1, '8');

    bars_error.add_message(l_mod, 9, l_exc, l_rus, 'Перенумерация журнала уже виполнена. Повторный запуск перенумерацыи можна выполнить через 5 минут!', '', 1, '9');
    bars_error.add_message(l_mod, 9, l_exc, l_ukr, 'Перенумерація журналу вже виконана. Повторний запуск перенумерації можна здійснити через 5 хвилин!', '', 1, '9');

    bars_error.add_message(l_mod, 10, l_exc, l_rus, 'Акт сязан с документами по контракту. Удаление невозможно!', '', 1, '10');
    bars_error.add_message(l_mod, 10, l_exc, l_ukr, 'Акт пов`язаний з документами по контракту. Видалення неможливе!', '', 1, '10');

    bars_error.add_message(l_mod, 11, l_exc, l_rus, 'Указано некоректное id акта!', '', 1, '11');
    bars_error.add_message(l_mod, 11, l_exc, l_ukr, 'Вказано некоректне id акту!', '', 1, '11');

    bars_error.add_message(l_mod, 12, l_exc, l_rus, 'Неправильно расчитано сумму в валюте контракта!', '', 1, '12');
    bars_error.add_message(l_mod, 12, l_exc, l_ukr, 'Неправильно розраховано суму у валюты контракту!', '', 1, '12');

    bars_error.add_message(l_mod, 13, l_exc, l_rus, 'Акт сязан с документами по контракту. Редактирование невозможно!', '', 1, '13');
    bars_error.add_message(l_mod, 13, l_exc, l_ukr, 'Акт пов`язаний з документами по контракту. Редагування неможливе!', '', 1, '13');

    bars_error.add_message(l_mod, 14, l_exc, l_rus, 'Платеж отсутствует или не связан с данным контрактом. Привязка акта невозможна!', '', 1, '14');
    bars_error.add_message(l_mod, 14, l_exc, l_ukr, 'Платіж відсутній або не пов`язаний з даним контратком. Прив`язка акту неможлива!', '', 1, '14');

    bars_error.add_message(l_mod, 15, l_exc, l_rus, 'Указано некоректное значение суммы привязки. Привязка невозможна!', '', 1, '15');
    bars_error.add_message(l_mod, 15, l_exc, l_ukr, 'Задано некоректне значення суми зв`язку. Прив`язка неможлива!', '', 1, '15');

    bars_error.add_message(l_mod, 16, l_exc, l_rus, 'Платеж уже связан с актом. Повторная привязка невозможна!', '', 1, '16');
    bars_error.add_message(l_mod, 16, l_exc, l_ukr, 'Платіж вже зв`язаний з актом. Повторна прив`язка неможлива!', '', 1, '16');

    bars_error.add_message(l_mod, 17, l_exc, l_rus, 'Найдено боль чем 1 акт ценовой экспертизы, связанній с платежом!', '', 1, '17');
    bars_error.add_message(l_mod, 17, l_exc, l_ukr, 'Знайдено більш ніж 1 акт цінової експертизи,зв`язаний з платежем!', '', 1, '17');

    bars_error.add_message(l_mod, 18, l_exc, l_rus, 'Не задан код класификатора услуг!', '', 1, '18');
    bars_error.add_message(l_mod, 18, l_exc, l_ukr, 'Не задано код класифікатора послуг!', '', 1, '18');

    bars_error.add_message(l_mod, 19, l_exc, l_rus, 'По контракту существуют акті ценовой экспертизы. Установыит предмет контракта ``услуги`` невозможно!', '', 1, '19');
    bars_error.add_message(l_mod, 19, l_exc, l_ukr, 'По контракту наявні акти цінової експертизи. Встановити предмету контракту ``послуги`` неможливо!', '', 1, '19');

    bars_error.add_message(l_mod, 20, l_exc, l_rus, 'Отсутствуют данные, необходимые для формирования сообщения в НБУ!', '', 1, '20');
    bars_error.add_message(l_mod, 20, l_exc, l_ukr, 'Відсутні дані, необхідні для формування повідомлення у НБУ!', '', 1, '20');

    bars_error.add_message(l_mod, 21, l_exc, l_rus, 'Подтверждение регистрации контракта невозможно!', '', 1, '21');
    bars_error.add_message(l_mod, 21, l_exc, l_ukr, 'Підтвердження реєстрації контракту неможливе!', '', 1, '21');

    bars_error.add_message(l_mod, 22, l_exc, l_rus, 'Отсутствуют данные, необходимые для подтверждения регистрации контракта!', '', 1, '22');
    bars_error.add_message(l_mod, 22, l_exc, l_ukr, 'Відсутні дані, необхідні для підтвердження реєстрації контракту!', '', 1, '22');

    bars_error.add_message(l_mod, 23, l_exc, l_rus, 'В настройках модуля не задан параметр OBL_CODE. Формирование сообщения в НБУ невозможно!', '', 1, '23');
    bars_error.add_message(l_mod, 23, l_exc, l_ukr, 'В налаштуваннях модуля не задано параметер OBL_CODE. Формування повідомлення в НБУ неможливе!', '', 1, '23');

    bars_error.add_message(l_mod, 24, l_exc, l_rus, 'Период с такой датой окончания уже существует в графике! Добавить период невозможно.', '', 1, '24');
    bars_error.add_message(l_mod, 24, l_exc, l_ukr, 'Період з такою датою закінчення вже існує у графіку! Добавити період неможливо.', '', 1, '24');

    bars_error.add_message(l_mod, 25, l_exc, l_rus, 'Ошибка в данных о периоде графика! Модификация данных невозможна.', '', 1, '25');
    bars_error.add_message(l_mod, 25, l_exc, l_ukr, 'Помилка у даних про преіод графіка. Модифікація даних неможлива.', '', 1, '25');

    bars_error.add_message(l_mod, 26, l_exc, l_rus, 'Ошибка в данных о платеже графика! Модификация данных невозможна.', '', 1, '26');
    bars_error.add_message(l_mod, 26, l_exc, l_ukr, 'Помилка у даних про платіж графіка. Модифікація даних неможлива.', '', 1, '26');

    bars_error.add_message(l_mod, 27, l_exc, l_rus, 'В справочнике branch отсутствует 20-ти значный код подразделения. Формирование сообщения в НБУ невозможно!', '', 1, '27');
    bars_error.add_message(l_mod, 27, l_exc, l_ukr, 'У довіднику branch відсутній 20-ти значний код установи. Формування повідомлення в НБУ неможливе!', '', 1, '27');

    bars_error.add_message(l_mod, 28, l_exc, l_rus, 'Конттракт уже зарегистрирован. Повторная регистрация невозможна.', '', 1, '28');
    bars_error.add_message(l_mod, 28, l_exc, l_ukr, 'Контракт вже зареєстрований. Повторна реєстрація неможлива.', '', 1, '28');

    bars_error.add_message(l_mod, 29, l_exc, l_rus, 'Контракт сохранен!', '', 1, '29');
    bars_error.add_message(l_mod, 29, l_exc, l_ukr, 'Контракт збережено!', '', 1, '29');

    bars_error.add_message(l_mod, 30, l_exc, l_rus, 'Такой контрагент уже существует!', '', 1, '30');
    bars_error.add_message(l_mod, 30, l_exc, l_ukr, 'Такий контрагент вже існує!', '', 1, '30');

    bars_error.add_message(l_mod, 31, l_exc, l_rus, 'Ошибка в данных о контрагенте!', '', 1, '31');
    bars_error.add_message(l_mod, 31, l_exc, l_ukr, 'Помилка у даних про контрагент!', '', 1, '31');

    bars_error.add_message(l_mod, 32, l_exc, l_rus, 'Данные о контрагенте отсутствуют!', '', 1, '32');
    bars_error.add_message(l_mod, 32, l_exc, l_ukr, 'Дані про контрагента відсутні!', '', 1, '32');

    bars_error.add_message(l_mod, 39, l_exc, l_rus, 'Не заданы обязательные параметры плавающей процентной ставки (База и/или Маржа)!', '', 1, '39');
    bars_error.add_message(l_mod, 39, l_exc, l_ukr, 'Не задані обов''язкові параметри плаваючої процентної ставки (База і/або Маржа)!', '', 1, '39');

    bars_error.add_message(l_mod, 40, l_exc, l_rus, 'Пользователь не принадлежит к отделению, за которым закреплен контракт. Выполнение операции невозможно!', '', 1, '40');
    bars_error.add_message(l_mod, 40, l_exc, l_ukr, 'Користувач не належить до відділення, за яким закріплено контракт. Виконання операції неиожливе!', '', 1, '40');

    bars_error.add_message(l_mod, 41, l_exc, l_rus, 'Данные привязки некоректны или несовместимы с выбранным контрактом. Привязка платежа невозможна!', '', 1, '41');
    bars_error.add_message(l_mod, 41, l_exc, l_ukr, 'Дані прив`язки некоректні або несумістні з вибраним контрактом. Прив`язка платежу неможлива!', '', 1, '41');

    bars_error.add_message(l_mod, 42, l_exc, l_rus, 'Нарушение целосности данных! Данные непривязаного остатка платежа не соответствуют данным платежа.', '', 1, '42');
    bars_error.add_message(l_mod, 42, l_exc, l_ukr, 'Порушення цілісності даних! Дані неприв`язаного залишку платежу не відповідають даним платежу.', '', 1, '42');

    bars_error.add_message(l_mod, 43, l_exc, l_rus, 'Сумма привязки равна 0 или больше непривязаного остатка. Привязка невозможна!', '', 1, '43');
    bars_error.add_message(l_mod, 43, l_exc, l_ukr, 'Сума прив`язки рівна 0 або більша неприв`язаного залишку! Прив`язка неможлива!', '', 1, '43');

    bars_error.add_message(l_mod, 44, l_exc, l_rus, 'Данная операция над фантомным платежом недопустима!', '', 1, '44');
    bars_error.add_message(l_mod, 44, l_exc, l_ukr, 'Дана операція над фантомним плетежем недопустима!', '', 1, '44');

    bars_error.add_message(l_mod, 45, l_exc, l_rus, 'Не указано референс (ref) реального платежа!', '', 1, '45');
    bars_error.add_message(l_mod, 45, l_exc, l_ukr, 'Не вказано референс (ref) реального платежу!', '', 1, '45');

    bars_error.add_message(l_mod, 46, l_exc, l_rus, 'Отсутствуют данные об отправителе/получателе платежа!', '', 1, '46');
    bars_error.add_message(l_mod, 46, l_exc, l_ukr, 'Відсутні дані про відправника/одержувача платежу!', '', 1, '46');

    bars_error.add_message(l_mod, 47, l_exc, l_rus, 'Неправильный курс. Привязка невозможна!', '', 1, '47');
    bars_error.add_message(l_mod, 47, l_exc, l_ukr, 'Неправильний курс. Прив`язка неможлива!', '', 1, '47');

    bars_error.add_message(l_mod, 48, l_exc, l_rus, 'Не задан предмет оплаты или код класификатора услуг!', '', 1, '48');
    bars_error.add_message(l_mod, 48, l_exc, l_ukr, 'Не задано предмет оплати або код класифікатора послуг!', '', 1, '48');

    bars_error.add_message(l_mod, 49, l_exc, l_rus, 'Привязка отсутствует или удалена раньше!', '', 1, '49');
    bars_error.add_message(l_mod, 49, l_exc, l_ukr, 'Прив`язка відсутня або видалена раніше!', '', 1, '49');

    bars_error.add_message(l_mod, 50, l_exc, l_rus, 'Сумма привязки превышает задолженость по кредиту!', '', 1, '50');
    bars_error.add_message(l_mod, 50, l_exc, l_ukr, 'Сума прив`язки перевищує заборгованість по кредиту!', '', 1, '50');

    bars_error.add_message(l_mod, 51, l_exc, l_rus, 'В исходящих платежах комисия должна быть равна 0. Привязка невозможна!', '', 1, '51');
    bars_error.add_message(l_mod, 51, l_exc, l_ukr, 'У вихідних платежах комісія повинна бути рівна 0. Прив`язка неможлива!', '', 1, '51');

    bars_error.add_message(l_mod, 52, l_exc, l_rus, 'Документ привязан к контракту. Удаление записи из журнала невозможно!', '', 1, '52');
    bars_error.add_message(l_mod, 52, l_exc, l_ukr, 'Документ прив`язаний до контракту. Видалення запису з журналу неможливе!', '', 1, '52');

    bars_error.add_message(l_mod, 53, l_exc, l_rus, 'Найдеы МД (Акты), связание с вибраным платежом. Виполните отвязку МД и повторите операцию!', '', 1, '53');
    bars_error.add_message(l_mod, 53, l_exc, l_ukr, 'Знайдено МД (Акти), пов`язані з вибраним платежем. Виконайте відв`язку МД і повторіть операцію!', '', 1, '53');

    bars_error.add_message(l_mod, 54, l_exc, l_rus, 'Фантом привязан к контракту. Удаление фантома невозможно!', '', 1, '54');
    bars_error.add_message(l_mod, 54, l_exc, l_ukr, 'Фантом прив`язаний до контракту. Видалення фантому неможливе!', '', 1, '54');

    bars_error.add_message(l_mod, 60, l_exc, l_rus, 'Направление МД (Акта) не соответствует типу контракта!', '', 1, '60');
    bars_error.add_message(l_mod, 60, l_exc, l_ukr, 'Напрям МД (Акту) не відповідає типу контракту!', '', 1, '60');

    bars_error.add_message(l_mod, 61, l_exc, l_rus, 'Не указано референс (ref) реальной МД!', '', 1, '61');
    bars_error.add_message(l_mod, 61, l_exc, l_ukr, 'Не вказано референс (ref) реальної МД!', '', 1, '61');

    bars_error.add_message(l_mod, 62, l_exc, l_rus, 'МД не принадлежит отделению, за которым закреплен контракт. Выполнение операции невозможно!', '', 1, '62');
    bars_error.add_message(l_mod, 62, l_exc, l_ukr, 'МД не належить відділенню, за яким закріплено контракт. Виконання операції неиожливе!', '', 1, '62');

    bars_error.add_message(l_mod, 63, l_exc, l_rus, 'Найдеы платежы, связание с выбраной МД (Актом). Виполните отвязку платежей и повторите операцию!', '', 1, '63');
    bars_error.add_message(l_mod, 63, l_exc, l_ukr, 'Знайдено платежі, пов`язані з втбраною МД (Актом). Виконайте відв`язку платежів і повторіть операцію!', '', 1, '63');

    bars_error.add_message(l_mod, 64, l_exc, l_rus, 'Не указано необходимые параметры привязки!', '', 1, '64');
    bars_error.add_message(l_mod, 64, l_exc, l_ukr, 'Не вказано необхідні параметри прив`язки!', '', 1, '64');

    bars_error.add_message(l_mod, 65, l_exc, l_rus, 'Акт привязан к контракту. Удаление невозможно!', '', 1, '65');
    bars_error.add_message(l_mod, 65, l_exc, l_ukr, 'Акт прив`язано до контракту. Видалення неможливе!', '', 1, '65');

    bars_error.add_message(l_mod, 66, l_exc, l_rus, 'Автопривязка ТД уже виполняется. Повторный запуск автопривязки ТД можна выполнить через 5 минут!', '', 1, '66');
    bars_error.add_message(l_mod, 66, l_exc, l_ukr, 'Автоприв`язка МД вже виконується. Повторний запуск автоприв`язки МД можна здійснити через 5 хвилин!', '', 1, '66');

    bars_error.add_message(l_mod, 70, l_exc, l_rus, 'Указано некоректное id платежа!', '', 1, '70');
    bars_error.add_message(l_mod, 70, l_exc, l_ukr, 'Вказано некоректне id платежа!', '', 1, '70');

    bars_error.add_message(l_mod, 71, l_exc, l_rus, 'Указано некоректное id МД!', '', 1, '71');
    bars_error.add_message(l_mod, 71, l_exc, l_ukr, 'Вказано некоректне id МД!', '', 1, '71');

    bars_error.add_message(l_mod, 72, l_exc, l_rus, 'Сумма связи превышает доаустимое значение!', '', 1, '72');
    bars_error.add_message(l_mod, 72, l_exc, l_ukr, 'Сума зв`язку перевищує допустиме значення!', '', 1, '72');

    bars_error.add_message(l_mod, 73, l_exc, l_rus, 'Выбранные платёж и МД не пренадлежат одному контракту! Установление связи невозможно!', '', 1, '73');
    bars_error.add_message(l_mod, 73, l_exc, l_ukr, 'Вибрані платіж та МД не належать одному контракту. Встановлення зв`язку неможливе!', '', 1, '73');

    bars_error.add_message(l_mod, 74, l_exc, l_rus, 'Указано некоректное id МД или платежа!', '', 1, '74');
    bars_error.add_message(l_mod, 74, l_exc, l_ukr, 'Вказано некоректне id МД або платежу!', '', 1, '74');

    bars_error.add_message(l_mod, 80, l_exc, l_rus, 'Вибранный контракт не есть торговым!', '', 1, '80');
    bars_error.add_message(l_mod, 80, l_exc, l_ukr, 'Вибраний контракт не є торговим!', '', 1, '80');

    bars_error.add_message(l_mod, 81, l_exc, l_rus, 'Указано некоректное id вывода!', '', 1, '81');
    bars_error.add_message(l_mod, 81, l_exc, l_ukr, 'Вказано некоректне id висновку!', '', 1, '81');

    bars_error.add_message(l_mod, 82, l_exc, l_rus, 'Сумма привязки превышает сумму вывода. Привязка невозможна!', '', 1, '82');
    bars_error.add_message(l_mod, 82, l_exc, l_ukr, 'Сума зв`язку перевищує суму висновку. Прив`язка неможлива!', '', 1, '82');

    bars_error.add_message(l_mod, 83, l_exc, l_rus, 'Сумма привязки превышает сумму документа. Привязка невозможна!', '', 1, '83');
    bars_error.add_message(l_mod, 83, l_exc, l_ukr, 'Сума зв`язку перевищує суму документу. Прив`язка неможлива!', '', 1, '83');

    bars_error.add_message(l_mod, 84, l_exc, l_rus, 'Валюта вывода не совпадает с валютой документа. Привязка невозможна!', '', 1, '84');
    bars_error.add_message(l_mod, 84, l_exc, l_ukr, 'Валюта висновку не співпадає з валютою документу. Прив`язка неможлива!', '', 1, '84');

    bars_error.add_message(l_mod, 85, l_exc, l_rus, 'Ошибка в данных вывода!', '', 1, '85');
    bars_error.add_message(l_mod, 85, l_exc, l_ukr, 'Помилка у даних висновку!', '', 1, '85');

    bars_error.add_message(l_mod, 86, l_exc, l_rus, 'Вывод сязан с документами по контракту. Удаление невозможно!', '', 1, '86');
    bars_error.add_message(l_mod, 86, l_exc, l_ukr, 'Висновок пов`язаний з документами по контракту. Видалення неможливе!', '', 1, '86');

    bars_error.add_message(l_mod, 87, l_exc, l_rus, 'Вывод сязан с документами по контракту. Редактирование невозможно!', '', 1, '87');
    bars_error.add_message(l_mod, 87, l_exc, l_ukr, 'Висновок пов`язаний з документами по контракту. Редагування неможливе!', '', 1, '87');

    bars_error.add_message(l_mod, 90, l_exc, l_rus, 'Указано некоректное id лицензии!', '', 1, '90');
    bars_error.add_message(l_mod, 90, l_exc, l_ukr, 'Вказано некоректне id ліцензії!', '', 1, '90');

    bars_error.add_message(l_mod, 91, l_exc, l_rus, 'Невозможно привязать лицензию к входному платежу!', '', 1, '91');
    bars_error.add_message(l_mod, 91, l_exc, l_ukr, 'Неможливо прив`язати ліцензію до вхідного платежу!', '', 1, '91');

    bars_error.add_message(l_mod, 92, l_exc, l_rus, 'Валюта лицензии не совпадает с валютой платежа. Привязка невозможна!', '', 1, '92');
    bars_error.add_message(l_mod, 92, l_exc, l_ukr, 'Валюта ліцензії не співпадає з валютою платежу. Прив`язка неможлива!', '', 1, '92');

    bars_error.add_message(l_mod, 93, l_exc, l_rus, 'Сумма привязанных лицензий превышает сумму платежа. Привязка невозможна!', '', 1, '93');
    bars_error.add_message(l_mod, 93, l_exc, l_ukr, 'Сума прив`язаних ліцензій перевищує суму платежу. Прив`язка неможлива!', '', 1, '93');

    bars_error.add_message(l_mod, 94, l_exc, l_rus, 'Сумма привязанных платежей превышает сумму лицензии. Привязка невозможна!', '', 1, '94');
    bars_error.add_message(l_mod, 94, l_exc, l_ukr, 'Сума прив`язаних платежів перевищує суму ліцензії. Прив`язка неможлива!', '', 1, '94');

    bars_error.add_message(l_mod, 95, l_exc, l_rus, 'Лицензия сязана с платежами. Удаление невозможно!', '', 1, '95');
    bars_error.add_message(l_mod, 95, l_exc, l_ukr, 'Ліцензія пов`язана з платежами. Видалення неможливе!', '', 1, '95');

    bars_error.add_message(l_mod, 100, l_exc, l_rus, 'Не указан параметр режима синхронизации (параметр SYNC_SIDE справочника CIM_PARAMS)', '', 1, '100');
    bars_error.add_message(l_mod, 100, l_exc, l_ukr, 'Не вказано параметр режиму синхронізації (параметр SYNC_SIDE довідника CIM_PARAMS)', '', 1, '100');

    bars_error.add_message(l_mod, 101, l_exc, l_rus, 'Не указан адрес сервиса для синхроназации с ЦА (параметр SERVICE_URL справочника CIM_PARAMS)', '', 1, '101');
    bars_error.add_message(l_mod, 101, l_exc, l_ukr, 'Не вказано адресу сервісу для синхронізації з ЦА (параметр SERVICE_URL довідника CIM_PARAMS)', '', 1, '101');

    bars_error.add_message(l_mod, 102, l_exc, l_rus, 'Выполнение синхронизации запрещено для главного офиса (SYNC_SIDE=1)', '', 1, '102');
    bars_error.add_message(l_mod, 102, l_exc, l_ukr, 'Виконання синхронізації заборонене для головного офісу (SYNC_SIDE=1)', '', 1, '102');
  commit;
end;
/
PROMPT ===================================================================================== 
PROMPT *** End *** ========== Scripts /Sql/Bars/Data/Err/mod_CIM.sql =========*** Run *** ==
PROMPT ===================================================================================== 
