PROMPT =====================================================================================                     
PROMPT *** Run *** ========== Scripts /Sql/bars/data/fin_question_53.sql =========*** Run **            
PROMPT =====================================================================================                     
                                                                                                                 
declare                                                                                                          

	procedure add_question ( p_name       fin_question.name%type,                            
							 p_ord        fin_question.ord%type,                             
							 p_kod        fin_question.kod%type,                             
							 p_idf        fin_question.idf%type,                             
							 p_descript   fin_question.descript%type default null,           
							 p_pob        fin_question.pob%type default 0                    
							                                                                 
						)                                                                    
	as                                                                                       
	l_ques  fin_question%rowtype;                                                            
	begin                                                                                    
                                                                                          
	   l_ques.name       :=   p_name     ;                                                   
	   l_ques.ord        :=   p_ord      ;                                                   
	   l_ques.kod        :=   p_kod      ;                                                   
	   l_ques.idf        :=   p_idf      ;                                                   
	   l_ques.pob        :=   p_pob      ;                                                   
	   l_ques.descript   :=   p_descript ;                                                   

	 insert into fin_question                            
		  values l_ques;                                 
	exception when dup_val_on_index then                 
	  update fin_question                                
		set  row  = l_ques                               
	  where  kod  = l_ques.kod and                       
			 idf  = l_ques.idf ;                         
end;                                                 

	procedure add_question_rep ( p_kod        fin_question_reply.kod%type,          
								 p_name       fin_question_reply.name%type,         
								 p_ord        fin_question_reply.ord%type,          
								 p_val        fin_question_reply.val%type,          
								 p_idf        fin_question_reply.idf%type,          
								 p_repl_s     fin_question_reply.repl_s%type,       
								 p_namep      fin_question_reply.namep%type         
						)                                                           
	as                                                                              
	l_ques  fin_question_reply%rowtype;                                             
	begin                                                                           

      l_ques.name       :=   p_name     ;                       
      l_ques.ord        :=   p_ord      ;                       
      l_ques.kod        :=   p_kod      ;                       
      l_ques.idf        :=   p_idf      ;                       
      l_ques.val        :=   p_val      ;                       
      l_ques.repl_s     :=   p_repl_s   ;                       
      l_ques.namep      :=   p_namep    ;                       

 	 insert into fin_question_reply                         
 		  values l_ques;                                    
 	exception when dup_val_on_index then                    
 	  update fin_question_reply                             
 		set  row  = l_ques                                  
 	  where  kod  = l_ques.kod and                          
 			 ord  = l_ques.ord and                          
 			 idf  = l_ques.idf ;                            
end;                                                        
                                                             
                                                             
Begin                                                        

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD1 *** Резерв під зменшення корисності наданого Контрагенту фінансового активу становить 50 та більше відсотків боргу');
 add_question('Резерв під зменшення корисності наданого Контрагенту фінансового активу становить 50 та більше відсотків боргу', 1, 'PD1', 53, 'сформований Банком резерв під зменшення корисності
наданого Контрагенту фінансового активу становить 50
та більше відсотків боргу', 1);
    add_question_rep('PD1', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD1', 'Так', 2, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD2 *** Реструктуризація передбачає прощення частини боргу та/або капіталізацію або заміну на інший актив нарахованих та несплачених відс. > 90 кал.дн. поспіль');
 add_question('Реструктуризація передбачає прощення частини боргу та/або капіталізацію або заміну на інший актив нарахованих та несплачених відс. > 90 кал.дн. поспіль', 2, 'PD2', 53, 'внесені зміни до умов договору, в тому числі пов’язані
з реструктуризацією боргу [крім: реструктуризації боргу,
яка проводиться згідно з вимогами Законів України “Про
фінансову реструктуризацію” та за якою Контрагентом
виконуються умови договору], передбачають:
•	прощення частини боргу та/або,
•	капіталізацію або заміну на інший актив нарахованих
    та несплачених відсотків за більш ніж 90 календарних
	днів поспіль ', 0);
    add_question_rep('PD2', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD2', 'Так', 2, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD3 *** Контрагент заявив про банкрутство');
 add_question('Контрагент заявив про банкрутство', 3, 'PD3', 53, '', 0);
    add_question_rep('PD3', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD3', 'Так', 2, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD4 *** Контрагента визнано банкрутом/розпочато процедуру ліквідації (припинення) юридичної особи в установленому законодавством порядку');
 add_question('Контрагента визнано банкрутом/розпочато процедуру ліквідації (припинення) юридичної особи в установленому законодавством порядку', 4, 'PD4', 53, '', 0);
    add_question_rep('PD4', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD4', 'Так', 2, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD5 *** Банк порушив проти Контрагента справу про банкрутство у встановленому законодавством України порядку');
 add_question('Банк порушив проти Контрагента справу про банкрутство у встановленому законодавством України порядку', 5, 'PD5', 53, '', 0);
    add_question_rep('PD5', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD5', 'Так', 2, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD6 *** Банком ухвалено рішення про конвертацію (переведення) частини або всієї суми боргу Контрагента в капітал Контрагента');
 add_question('Банком ухвалено рішення про конвертацію (переведення) частини або всієї суми боргу Контрагента в капітал Контрагента', 6, 'PD6', 53, 'Банком ухвалено рішення про конвертацію (переведення)
частини або всієї суми боргу Контрагента в капітал
Контрагента(за виключенням випадків, передбачених
Законом України “Про фінансову реструктуризацію”);', 0);
    add_question_rep('PD6', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD6', 'Так', 2, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD7 *** Рейтинг боржника згідно з міжнародною рейтинговою шкалою');
 add_question('Рейтинг боржника згідно з міжнародною рейтинговою шкалою', 7, 'PD7', 53, 'Рейтинг боржника згідно з міжнародною рейтинговою шкалою,
підтверджений агентством (компанією) Standard$Poor’s,
або іншим провідним світовим рейтинговим агентством (компанією)', 0);
    add_question_rep('PD7', 'NR', 0, 0, 53, null, '');
    add_question_rep('PD7', 'AAA', 1, 2, 53, null, '');
    add_question_rep('PD7', 'AA', 2, 3, 53, null, '');
    add_question_rep('PD7', 'A', 3, 4, 53, null, '');
    add_question_rep('PD7', 'BBB', 4, 5, 53, null, '');
    add_question_rep('PD7', 'BB', 5, 6, 53, null, '');
    add_question_rep('PD7', 'B', 6, 7, 53, null, '');
    add_question_rep('PD7', 'CCC', 7, 8, 53, null, '');
    add_question_rep('PD7', 'CC', 8, 9, 53, null, '');
    add_question_rep('PD7', 'C', 9, 10, 53, null, '');
    add_question_rep('PD7', 'SD', 10, 11, 53, null, '');
    add_question_rep('PD7', 'D', 11, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD8 *** Відбулась повторна/наступна заміна активу на інший актив');
 add_question('Відбулась повторна/наступна заміна активу на інший актив', 8, 'PD8', 53, '', 0);
    add_question_rep('PD8', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD8', 'Так', 2, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD9 *** Внесені зміни до умов договору, не пов’язані з реструктуризацією, в частині збільшення строків користування активом');
 add_question('Внесені зміни до умов договору, не пов’язані з реструктуризацією, в частині збільшення строків користування активом', 9, 'PD9', 53, 'Внесені зміни до умов договору, не пов’язані з
реструктуризацією, в частині збільшення строків
користування активом, наданим Контрагенту, який
не спроможний погасити борг без реалізації застави,
попри відсутність на дату оцінки кредитного ризику
прострочення погашення боргу', 0);
    add_question_rep('PD9', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD9', 'Так', 2, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD10 *** За одним із активів боржника/контрагента відбулось списання боргу за рахунок сформованого резерву');
 add_question('За одним із активів боржника/контрагента відбулось списання боргу за рахунок сформованого резерву', 10, 'PD10', 53, '', 0);
    add_question_rep('PD10', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD10', 'Так', 2, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD11 *** За одним із активів Контрагента відбувся продаж зі збитком в обсязі 20 або більше відсотків боргу');
 add_question('За одним із активів Контрагента відбувся продаж зі збитком в обсязі 20 або більше відсотків боргу', 11, 'PD11', 53, '', 0);
    add_question_rep('PD11', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD11', 'Так', 2, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD12 *** За одним із активів Контрагента, який є лізингоотримувачем, відбулось анулювання Банком лізингового договору');
 add_question('За одним із активів Контрагента, який є лізингоотримувачем, відбулось анулювання Банком лізингового договору', 12, 'PD12', 53, 'За одним із активів/часткою активу Контрагента, який
є лізингоотримувачем, відбулось анулювання Банком
лізингового договору в зв’язку з порушенням Контрагентом
(лізингоотримувачем) умов договору', 0);
    add_question_rep('PD12', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD12', 'Так', 2, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD13 *** Продаж Банком активу з відстроченням платежу більш ніж на 7 календарних днів, на дату оцінки сплачено <30% його вартості');
 add_question('Продаж Банком активу з відстроченням платежу більш ніж на 7 календарних днів, на дату оцінки сплачено <30% його вартості', 13, 'PD13', 53, 'продаж Банком активу з відстроченням платежу більш ніж
на 7 календарних днів відповідно до умов договору про
продаж активу (у т.ч. із урахуванням внесених змін до
договору про продаж активу), при цьому на дату оцінки
кредитного ризику Контрагент, що купує актив, сплатив
Банку менше 30% його вартості або сплату за активом не здійснював ', 0);
    add_question_rep('PD13', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD13', 'Так', 2, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD14 *** Продаж Банком активу з відстроченням платежу більш ніж на 7 календарних днів, при цьому Контрагент сплачує за активом одним платежем у кінці строку дії договору');
 add_question('Продаж Банком активу з відстроченням платежу більш ніж на 7 календарних днів, при цьому Контрагент сплачує за активом одним платежем у кінці строку дії договору', 14, 'PD14', 53, 'продаж Банком активу з відстроченням платежу більш ніж
на 7 календарних днів відповідно до умов договору про
продаж активу (у т.ч. із урахуванням внесених змін до
договору про продаж активу), при цьому Контрагент сплачує
за активом одним платежем у кінці строку дії договору про
продаж активу або сплачує більшу частку вартості активу
наближено до кінця строку дії договору про продаж активу', 0);
    add_question_rep('PD14', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD14', 'Так', 2, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD15 *** Контрагент, що є емітентом цінних паперів,  включений до списку емітентів, що мають ознаки фіктивності');
 add_question('Контрагент, що є емітентом цінних паперів,  включений до списку емітентів, що мають ознаки фіктивності', 15, 'PD15', 53, 'Контрагент, що є емітентом цінних паперів, згідно
з порядком, передбаченим нормативно-правовим актом
Національної комісії з цінних паперів та фондового
ринку, включений до списку емітентів, що мають ознаки
фіктивності', 0);
    add_question_rep('PD15', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD15', 'Так', 2, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD16 *** Контрагент має затримку погашення номінальної вартості або процентів понад сім календарних днів за борговими цінними паперами');
 add_question('Контрагент має затримку погашення номінальної вартості або процентів понад сім календарних днів за борговими цінними паперами', 16, 'PD16', 53, '', 0);
    add_question_rep('PD16', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD16', 'Так', 2, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD17 *** Немає фінансової звітності боржника – юридичної особи за останній звітний період понад три місяці після термінів подання ');
 add_question('Немає фінансової звітності боржника – юридичної особи за останній звітний період понад три місяці після термінів подання ', 17, 'PD17', 53, '', 1);
    add_question_rep('PD17', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD17', 'Так', 2, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD20 *** Немає розшифрування даних форми № 2 (2-м, 2-мс) “Звіт про фінансові результати» (графа 2000+2010+2120) за останній звітний рік щодо структури доходів');
 add_question('Немає розшифрування даних форми № 2 (2-м, 2-мс) “Звіт про фінансові результати» (графа 2000+2010+2120) за останній звітний рік щодо структури доходів', 18, 'PD20', 53, 'Немає розшифрування даних форми № 2 (2-м, 2-мс) “Звіт про фінансові результати» (графа 2000+2010+2120) за останній звітний рік щодо структури доходів', 1);
    add_question_rep('PD20', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD20', 'Так', 2, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD18 *** Фінансова звітність боржника, не відповідає вимогам Закону України “Про бухгалтерський облік та фінансову звітність в Україні”/вимогам законодавства країни місцезнаходження боржника-нерезидента');
 add_question('Фінансова звітність боржника, не відповідає вимогам Закону України “Про бухгалтерський облік та фінансову звітність в Україні”/вимогам законодавства країни місцезнаходження боржника-нерезидента', 19, 'PD18', 53, 'фінансова звітність боржника, не відповідає вимогам Закону України “Про бухгалтерський облік та фінансову звітність в Україні”/вимогам законодавства країни місцезнаходження боржника-нерезидента', 0);
    add_question_rep('PD18', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD18', 'Так', 2, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD21 *** Фінансова звітність Контрагента, підтверджена аудитором, має негативну думку аудитора/відмову аудитора від висловлення думки');
 add_question('Фінансова звітність Контрагента, підтверджена аудитором, має негативну думку аудитора/відмову аудитора від висловлення думки', 20, 'PD21', 53, 'фінансова звітність Контрагента, підтверджена аудитором, має негативну думку аудитора/відмову аудитора від висловлення думки', 0);
    add_question_rep('PD21', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD21', 'Так', 2, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD19 *** Контрагент скористався передбаченою умовами договору про надання кредиту можливістю змін попередніх умов виконання ним зобов’язань');
 add_question('Контрагент скористався передбаченою умовами договору про надання кредиту можливістю змін попередніх умов виконання ним зобов’язань', 21, 'PD19', 53, 'Контрагент скористався передбаченою умовами
договору про надання кредиту можливістю змін
попередніх умов виконання ним зобов’язань на
такі, що відповідають ознакам, визначеним у
цьому пункті', 0);
    add_question_rep('PD19', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD19', 'Так', 2, 1, 53, null, '');

 dbms_output.put_line('PROMPT *** IDF=53 KOD>>PD23 *** Банк володіє іншою інформацією, що свідчить про факт настання події дефолту');
 add_question('Банк володіє іншою інформацією, що свідчить про факт настання події дефолту', 22, 'PD23', 53, '', 0);
    add_question_rep('PD23', 'Ні', 1, 0, 53, null, '');
    add_question_rep('PD23', 'Так', 2, 1, 53, null, '');
end;                                        
/                                           
                                            
commit;                                     
