delete from rez_deb;
Insert into BARS.REZ_DEB
   (NBS, TXT, TIPA, TIPA_FV)
 Values
   ('1200', 'Кореспондентський рахунок банку в Національному банку України', 12, 3);
Insert into BARS.REZ_DEB
   (NBS, TXT, TIPA, TIPA_FV)
 Values
   ('1203', 'Кошти обов''язкових резервiв банку в Нацiональному банку України', 12, 3);
Insert into BARS.REZ_DEB
   (NBS, TXT, TIPA, TIPA_FV)
 Values
   ('1207', 'Накопичувальний рахунок банку в Національному банку України', 12, 3);
Insert into BARS.REZ_DEB
   (NBS, TXT, TIPA, TIPA_FV)
 Values
   ('1208', 'Нараховані доходи за коштами на вимогу в Національному банку України', 12, 3);
Insert into BARS.REZ_DEB
   (NBS, TXT, TIPA, TIPA_FV)
 Values
   ('1211', 'Кошти, що надані Національному банку України за операціями репо', 12, 3);
Insert into BARS.REZ_DEB
   (NBS, TXT, TIPA, TIPA_FV)
 Values
   ('1212', 'Короткострокові вклади (депозити) у Національному банку України', 12, 3);
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT, TIPA, 
    TIPA_FV)
 Values
   ('1218', 1, 14, 'Нараховані доходи за строковими вкладами (депозитами) у Національному банку України', 12, 
    3);
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1400', 14, 'Облігації внутрішньої державної позики, що рефінансуються Національним банком України, у торговому портфелi банку');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1401', 14, 'Облігації зовнішньої державної позики, що рефінансуються Національним банком України, у торговому портфелi банку');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1402', 14, 'Боргові цiннi папери органiв державної влади та місцевого самоврядування, що рефінансуються Національним банком України, у торговому портфелi банку');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1403', 14, 'Боргові цiннi папери, випущені банками та небанківськими фінансовими установами, що рефінансуються Національним банком України, у торговому портфелi банку');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1404', 14, 'Боргові цiннi папери нефінансових підприємств, що рефінансуються Національним банком України, у торговому портфелi банку');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1405', 14, 'Переоцінка боргових цiнних паперів, що рефінансуються Національним банком України, у торговому портфелi банку');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1406', 14, 'Неамортизований дисконт за борговими цiнними паперами, що рефінансуються Національним банком України, у торговому портфелi банку');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1407', 14, 'Неамортизована премія за борговими цiнними паперами, що рефінансуються Національним банком України, у торговому портфелi банку');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('1408', 1, 14, 'Нараховані доходи за борговими цiнними паперами, що рефінансуються Національним банком України, у торговому портфелi банку');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1410', 14, 'Облігації внутрішньої державної позики, що рефінансуються Національним банком України, у портфелi банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1411', 14, 'Облігації зовнішньої державної позики, що рефінансуються Національним банком України, у портфелi банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1412', 14, 'Боргові цiннi папери органiв державної влади та місцевого самоврядування, що рефінансуються Національним банком України, у портфелi банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1413', 14, 'Боргові цiннi папери, випущені банками та небанківськими фінансовими установами, що рефінансуються Національним банком України, у портфелi банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1414', 14, 'Боргові цiннi папери нефінансових підприємств, що рефінансуються Національним банком України, у портфелi банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1415', 14, 'Переоцінка боргових цiнних паперів, що рефінансуються Національним банком України, у портфелi банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1416', 14, 'Неамортизований дисконт за борговими цiнними паперами, що рефінансуються Національним банком України, у портфелi банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1417', 14, 'Неамортизована премія за борговими цiнними паперами, що рефінансуються Національним банком України, у портфелi банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('1418', 1, 14, 'Нараховані доходи за борговими цiнними паперами, що рефінансуються Національним банком України, у портфелi банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('1419', 2, 14, 'Прострочені нараховані доходи за борговими цiнними паперами,що рефінансуються Національним банком України, у портфелi банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1420', 14, 'Облігації внутрішньої державної позики, що рефінансуються Національним банком України, у портфелi банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1421', 14, 'Облігації зовнішньої державної позики, що рефінансуються Національним банком України, у портфелi банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1422', 14, 'Боргові цiннi папери органiв державної влади та місцевого самоврядування, що рефінансуються Національним банком України, у портфелi банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1423', 14, 'Боргові цiннi папери, випущені банками та небанківськими фінансовими установами, що рефінансуються Національним банком України, у портфелi банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1424', 14, 'Боргові цiннi папери нефінансових підприємств, що рефінансуються Національним банком України, у портфелi банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1426', 14, 'Неамортизований дисконт за борговими цiнними паперами, що рефінансуються Національним банком України, у портфелi банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1427', 14, 'Неамортизована премія за борговими цiнними паперами, що рефінансуються Національним банком України, у портфелi банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('1428', 1, 14, 'Нараховані доходи за борговими цiнними паперами, що рефінансуються Національним банком України, у портфелi банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('1429', 2, 14, 'Прострочені нараховані доходи за борговими цiнними паперами,що рефінансуються Національним банком України, у портфелi банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1430', 14, 'Боргові цiннi папери, емiтованi Національним банком України, у портфелi банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1435', 14, 'Переоцінка боргових цiнних паперів, емiтованих Національним банком України, у портфелi банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1436', 14, 'Неамортизований дисконт за борговими цiнними паперами, емiтованими Національним банком України, у портфелi банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1437', 14, 'Неамортизована премiя за борговими цiнними паперами, емiтованими Національним банком України, у портфелi банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('1438', 1, 14, 'Нарахованi доходи за борговими цiнними паперами, емiтованими Національним банком України, у портфелi банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1440', 14, 'Боргові цiннi папери, емiтованi Національним банком України, у портфелi банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1446', 14, 'Неамортизований дисконт за борговими цiнними паперами, емiтованими Національним банком України, у портфелi банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1447', 14, 'Неамортизована премiя за борговими цiнними паперами, емiтованими Національним банком України, у портфелi банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('1448', 1, 14, 'Нарахованi доходи за борговими цiнними паперами, емiтованими Національним банком України, у портфелi банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1490', 14, 'Резерви пiд знецiнення боргових цiнних паперiв, що рефiнансуються Нацiональним банком України, у портфелi банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1491', 14, 'Резерви пiд знецiнення боргових цiнних паперiв, що рефінансуються Національним банком України, у портфелi банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, TXT, GRUPA)
 Values
   ('1500', 'Кореспондентські рахунки, що відкриті в інших банках', 2);
Insert into BARS.REZ_DEB
   (NBS, TXT, GRUPA)
 Values
   ('1502', 'Кошти банків у розрахунках', 2);
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('1507', 1, 14, 'Нараховані витрати за отриманими кредитами овердрафт від інших банків');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('1508', 1, 1, 'Нараховані доходи за коштами на вимогу в інших банках');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT, GRUPA)
 Values
   ('1509', 2, 1, 'Прострочені нараховані доходи за коштами на вимогу в інших банках', 3);
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1510', 1, 'Депозити овернайт, що розміщені в інших банках');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1512', 1, 'Короткострокові вклади (депозити), що розміщені в інших банках');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1513', 1, 'Довгострокові вклади (депозити), що розміщені в інших банках');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1514', 1, 'Довгострокові вклади (депозити), що розміщені на умовах субординованого боргу');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1515', 1, 'Неамортизована премія за строковими вкладами (депозитами), що розміщені в інших банках');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1516', 1, 'Неамортизований дисконт за строковими вкладами (депозитами), що розміщені в інших банках');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT, GRUPA)
 Values
   ('1517', 1, 'Прострочена заборгованість за строковими вкладами (депозитами), що розміщені в інших банках', 3);
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('1518', 1, 1, 'Нараховані доходи за строковими вкладами (депозитами), що розміщені в інших банках');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('1519', 2, 1, 'Прострочені нараховані доходи за строковими вкладами (депозитами), що розміщені в інших банках');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1520', 1, 'Фінансовий лізинг (оренда), що наданий іншим банкам');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1521', 1, 'Кредити овернайт, що надані іншим банкам');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1522', 1, 'Кредити, що надані іншим банкам за операціями репо');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1523', 1, 'Iнші короткострокові кредити, які надані іншим банкам');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1524', 1, 'Довгострокові кредити, які надані іншим банкам');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1525', 1, 'Неамортизована премія за кредитами, що надані іншим банкам');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('1526', 1, 'Неамортизований дисконт за кредитами, що надані іншим банкам');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT, GRUPA)
 Values
   ('1527', 1, 'Прострочена заборгованість за кредитами, що надані іншим банкам', 3);
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('1528', 1, 1, 'Нараховані доходи за кредитами, що надані іншим банкам');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT, GRUPA)
 Values
   ('1529', 2, 1, 'Прострочені нараховані доходи за кредитами, які надані іншим банкам', 3);
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('1607', 1, 1, 'Нараховані доходи за кредитами овердрафт, що надані іншим банкам');
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2)
 Values
   ('1811', 1, 17);
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2)
 Values
   ('1812', 1, 17);
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2)
 Values
   ('1819', 1, 17);
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2008', 1, 2, 'Нараховані доходи за овердрафтом');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2018', 1, 2, 'Нараховані доходи за кредитами, що надані за операціями репо суб''єктам господарювання');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2028', 1, 2, 'Нараховані доходи за кредитами, що наданi за врахованими векселями суб''єктам господарювання');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2029', 2, 2, 'Прострочені нараховані доходи за кредитами, що наданi за врахованими векселями суб''єктам господарювання');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2038', 1, 2, 'Нараховані доходи за вимогами, що придбані за операціями факторингу iз суб''єктами господарювання');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2039', 2, 2, 'Прострочені нараховані доходи за вимогами, що придбані за операціями факторингу iз суб''єктами господарювання');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2048', 1, 2, 'Нараховані доходи за кредитами суб''єктам господарської діяльності за внутрішніми торговельними операціями');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2049', 2, 2, 'Прострочені нараховані доходи за кредитами суб''єктам господарської діяльності за внутрішніми торговельними операціями');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2058', 1, 2, 'Нараховані доходи за кредитами суб''єктам господарської діяльності за експортно-імпортними операціями');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2059', 2, 2, 'Прострочені нараховані доходи за кредитами суб''єктам господарської діяльності за експортно-імпортними операціями');
Insert into BARS.REZ_DEB
   (NBS, GRUPA)
 Values
   ('2067', 4);
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2068', 1, 2, 'Нараховані доходи за кредитами в поточну діяльність, що надані суб''єктам господарювання');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT, GRUPA)
 Values
   ('2069', 2, 2, 'Прострочені нараховані доходи за кредитами в поточну діяльність, що надані суб''єктам господарювання', 4);
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2078', 1, 2, 'Нараховані доходи за фінансовим лізингом, що наданий суб''єктам господарювання');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2079', 2, 2, 'Прострочені нараховані доходи за фінансовим лізингом, що наданий суб''єктам господарської діяльності');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2088', 1, 2, 'Нарахованi доходи за iпотечними кредитами, що наданi суб''єктам господарювання');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2089', 2, 2, 'Простроченi нарахованi доходи за iпотечними кредитами, що наданi суб''єктам господарювання');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('2102', 4, 'Короткостроковi кредити, що наданi органам державної влади');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('2103', 4, 'Довгострокові кредити, що надані органам державної влади');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('2105', 4, 'Неамортизована премія за кредитами, що наданi органам державної влади');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('2106', 4, 'Неамортизований дисконт за кредитами, що надані органам державної влади');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('2107', 4, 'Прострочена заборгованість за кредитами, що надані органам державної влади');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2108', 1, 4, 'Нараховані доходи за кредитами, що надані органам державної влади');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2109', 2, 4, 'Прострочені нараховані доходи за кредитами, що надані органам державної влади');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('2112', 4, 'Короткостроковi кредити, що наданi органам мiсцевого самоврядування');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('2113', 4, 'Довгостроковi кредити, що наданi органам мiсцевого самоврядування');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('2115', 4, 'Неамортизована премія за кредитами, що наданi органам мiсцевого самоврядування');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('2116', 4, 'Неамортизований дисконт за кредитами, що надані органам місцевого самоврядування');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('2117', 4, 'Прострочена заборгованість за кредитами, що надані органам мiсцевого самоврядування');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2118', 1, 4, 'Нараховані доходи за кредитами, що надані органам мiсцевого самоврядування');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2119', 2, 4, 'Прострочені нараховані доходи за кредитами, що надані органам мiсцевого самоврядування');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('2122', 4, 'Короткостроковi iпотечнi кредити, що наданi органам державної влади');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('2123', 4, 'Довгостроковi iпотечнi кредити, що наданi органам державної влади');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('2125', 4, 'Неамортизована премiя за iпотечними кредитами, що наданi органам державної влади');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('2126', 4, 'Неамортизований дисконт за iпотечними кредитами,що наданi органам державної влади');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('2127', 4, 'Прострочена заборгованiсть за iпотечними кредитами, що наданi органам державної влади');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2128', 1, 4, 'Нараховані доходи за iпотечними кредитами, що наданi органам державної влади');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2129', 2, 4, 'Прострочені нараховані доходи за iпотечними кредитами, що наданi органам державної влади');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('2132', 4, 'Короткостроковi iпотечнi кредити, що наданi органам мiсцевого самоврядування');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('2133', 4, 'Довгостроковi iпотечнi кредити, що наданi органам мiсцевого самоврядування');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('2135', 4, 'Неамортизована премiя за iпотечними кредитами, що наданi органам мiсцевого самоврядування');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('2136', 4, 'Неамортизований дисконт за iпотечними кредитами,що наданi органам мiсцевого самоврядування');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('2137', 4, 'Прострочена заборгованiсть за iпотечними кредитами, що наданi органам мiсцевого самоврядування');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2138', 1, 4, 'Нарахованi доходи за iпотечними кредитами, що наданi органам мiсцевого самоврядування');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2139', 2, 4, 'Простроченi нарахованi доходи за iпотечними кредитами, що наданi органам мiсцевого самоврядування');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2208', 1, 3, 'Нараховані доходи за кредитами на поточні потреби, що надані фізичним особам');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2209', 2, 3, 'Прострочені нараховані доходи за кредитами на поточні потреби, що надані фізичним особам');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2218', 1, 3, 'Нарахованi доходи за фiнансовим лiзингом, що наданий фiзичним особам');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2219', 2, 3, 'Простроченi нарахованi доходи за фiнансовим лiзингом, що наданий фiзичним особам');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2228', 1, 3, 'Нараховані доходи за кредитами, що надані за врахованими векселями фізичним особам');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2229', 2, 3, 'Прострочені нараховані доходи за кредитами, що надані за врахованими векселями фізичним особам');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2238', 1, 3, 'Нарахованi доходи за iпотечними кредитами, що наданi фiзичним особам');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2239', 2, 3, 'Простроченi нарахованi доходи за iпотечними кредитами, що наданi фiзичним особам');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2607', 1, 2, 'Нараховані доходи за кредитами овердрафт, що надані суб''єктам господарювання');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2627', 1, 3, 'Нараховані доходи за кредитами овердрафт, що надані фізичним особам');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('2657', 1, 2, 'Нараховані доходи за кредитами овердрафт, що надані небанківським фінансовим установам');
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2)
 Values
   ('2800', 1, 17);
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2)
 Values
   ('2801', 1, 17);
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2)
 Values
   ('2802', 1, 17);
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2)
 Values
   ('2805', 1, 17);
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2)
 Values
   ('2806', 1, 17);
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2)
 Values
   ('2809', 1, 17);
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3002', 30, 'Акції та інші цінні папери з нефіксованим прибутком, що випущені банками, у торговому портфелі банку');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3003', 30, 'Акції та інші цінні папери з нефіксованим прибутком,що випущені небанківськими фінансовими установами, у торговому портфелі банку');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3005', 30, 'Інші акції та цінні папери з нефіксованим прибутком у торговому портфелі банку');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3006', 30, 'Інші фінансові інвестиції, що обліковуються за справедливою вартістю через прибуток або збиток');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3007', 30, 'Переоцінка акції та інших фінансових інвестиції, що обліковуються за справедливою вартістю через прибуток або збиток');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('3008', 1, 30, 'Нараховані доходи за акціями та іншими фінансовими інвестиціями, що обліковуються за справедливою вартістю через прибуток або збиток');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3010', 30, 'Боргові цінні папери органів державної влади в торговому портфелі банку');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3011', 30, 'Боргові цінні папери органів мiсцевого самоврядування в торговому портфелі банку');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3012', 30, 'Боргові цінні папери, випущені банками, у торговому портфелі банку');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3013', 30, 'Боргові цінні папери, випущені небанківськими фінансовими установами, у торговому портфелі банку');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3014', 30, 'Боргові цінні папери нефінансових підприємств у торговому портфелі банку');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3015', 30, 'Переоцінка боргових цінних паперів у торговому портфелі банку');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3016', 30, 'Неамортизований дисконт за борговими цінними паперами в торговому портфелі банку');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3017', 30, 'Неамортизована премія за борговими цінними паперами в торговому портфелі банку');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('3018', 1, 30, 'Нараховані доходи за борговими цінними паперами в торговому портфелі банку');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT, TIPA, TIPA_FV)
 Values
   ('3040', 304, 'Активи за придбаними опціонними контрактами в торговому портфелі банку', 30, 3);
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT, TIPA, TIPA_FV)
 Values
   ('3041', 304, 'Активи за форвардними контрактами в торговому портфелі банку', 30, 3);
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT, TIPA, TIPA_FV)
 Values
   ('3042', 304, 'Активи за ф''ючерсними контрактами в торговому портфелі банку', 30, 3);
Insert into BARS.REZ_DEB
   (NBS, TXT, TIPA, TIPA_FV)
 Values
   ('3043', 'Активи за валютними своп-контрактами, що оцінюються за справедливою вартістю через прибутки/збитки', 30, 3);
Insert into BARS.REZ_DEB
   (NBS, TXT, TIPA, TIPA_FV)
 Values
   ('3044', 'Активи за процентними своп-контрактами, що оцінюються за справедливою вартістю через прибутки/збитки', 30, 3);
Insert into BARS.REZ_DEB
   (NBS, TXT, TIPA, TIPA_FV)
 Values
   ('3049', 'Активи за іншими похідними фінансовими інструментами, що оцінюються за справедливою вартістю через прибутки/збитки', 30, 3);
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3102', 310, 'Акції та інші цінні папери з нефіксованим прибутком, що випущені банками,у портфелі банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3103', 310, 'Акції та інші цінні папери з нефіксованим прибутком, що випущені небанківськими фінансовими установами у портфелі банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3105', 310, 'Iнші акції та цінні папери з нефіксованим прибутком у портфелі банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3106', 310, 'Інші фінансові інвестиції в портфелі банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3107', 310, 'Переоцінка акцій та інших фінансових інвестиції у портфелі банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('3108', 1, 310, 'Нараховані доходи за акціями та іншими фінансовими інвестиціями в портфелі банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3110', 311, 'Боргові цінні папери органiв державної влади в портфелі банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3111', 311, 'Боргові цінні папери органiв мiсцевого самоврядування в портфелі банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3112', 311, 'Боргові цінні папери, випущені банками, у портфелі банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3113', 311, 'Боргові цінні папери, випущені небанківськими фінансовими установами, у портфелі банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3114', 311, 'Боргові цінні папери нефінансових пiдприємств у портфелі банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3115', 311, 'Переоцінка боргових цінних паперів у портфелі банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3116', 311, 'Неамортизований дисконт за борговими цінними паперами в портфелі банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3117', 311, 'Неамортизована премія за борговими цінними паперами в портфелі банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('3118', 1, 311, 'Нараховані доходи за борговими цінними паперами в портфелі банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('3119', 2, 311, 'Прострочені нараховані доходи за борговими цінними паперами в портфелі банку на продаж');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3120', 312, 'Власні акції банку в портфелі на продаж, викуплені в акціонерів');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3122', 312, 'Iнвестицiї в асоцiйованi банки, що утримуються з метою продажу');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3123', 312, 'Iнвестицiї в асоцiйованi небанкiвськi фiнансовi установи, що утримуються з метою продажу');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3125', 312, 'Iнвестицiї в iншi асоцiйованi компанiї, що утримуються з метою продажу');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('3128', 1, 312, 'Нараховані доходи за iнвестицiями в асоцiйованi компанiї, що утримуються з метою продажу');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3132', 312, 'Iнвестицiї в дочiрнi банки, що утримуються з метою продажу');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3133', 312, 'Iнвестицiї в дочiрнi небанкiвськi фiнансовi установи, що утримуються з метою продажу');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3135', 312, 'Iнвестицiї в iншi дочiрнi компанiї, що утримуються з метою продажу');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('3138', 1, 312, 'Нараховані доходи за iнвестицiями в дочiрнi компанiї, що утримуються з метою продажу');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT, TIPA, TIPA_FV)
 Values
   ('3140', 31, 'Активи за придбаними опціонними контрактами, що призначені для обліку хеджування', 30, 3);
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT, TIPA, TIPA_FV)
 Values
   ('3141', 31, 'Активи за форвардними контрактами, що призначенідля обліку хеджування', 30, 3);
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT, TIPA, TIPA_FV)
 Values
   ('3142', 31, 'Активи за ф''ючерсними контрактами, що призначенідля обліку хеджування', 30, 3);
Insert into BARS.REZ_DEB
   (NBS, TXT, TIPA, TIPA_FV)
 Values
   ('3143', 'Активи за валютними своп-контрактами, що призначені для обліку хеджування', 30, 3);
Insert into BARS.REZ_DEB
   (NBS, TXT, TIPA, TIPA_FV)
 Values
   ('3144', 'Активи за процентними своп-контрактами, що призначені для обліку хеджування', 30, 3);
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('3208', 1, 320, 'Нараховані доходи за акціями та іншими вкладеннями з нефіксованим прибутком у портфелі банку на інвестиції');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3210', 32, 'Боргові цінні папери органiв державної влади в портфелі банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3211', 32, 'Боргові цінні папери органів мiсцевого самоврядування в портфелі банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3212', 32, 'Боргові цінні папери, випущені банками, в портфелі банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3213', 32, 'Боргові цінні папери, випущені небанківськими фінансовими установами, у портфелі банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3214', 32, 'Боргові цінні папери нефінансових підприємств у портфелі банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3216', 32, 'Неамортизований дисконт за борговими цінними паперами в портфелі банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR2, TXT)
 Values
   ('3217', 32, 'Неамортизована премія за борговими цінними паперами в портфелі банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('3218', 1, 32, 'Нараховані доходи за борговими цінними паперами в портфелі банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('3219', 2, 32, 'Прострочені нараховані доходи за борговими цінними паперами в портфелі банку до погашення');
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2)
 Values
   ('3510', 2, 17);
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2)
 Values
   ('3519', 2, 17);
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2)
 Values
   ('3540', 1, 17);
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2)
 Values
   ('3541', 1, 17);
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2)
 Values
   ('3548', 1, 17);
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2)
 Values
   ('3550', 2, 17);
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2)
 Values
   ('3551', 2, 17);
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2)
 Values
   ('3552', 2, 17);
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2)
 Values
   ('3559', 2, 17);
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2, GRUPA)
 Values
   ('3570', 1, 17, 1);
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2, GRUPA)
 Values
   ('3578', 1, 17, 1);
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2, GRUPA)
 Values
   ('3579', 1, 17, 1);
Insert into BARS.REZ_DEB
   (NBS, DEB, PR2)
 Values
   ('3710', 1, 17);
Insert into BARS.REZ_DEB
   (NBS, PR, TXT)
 Values
   ('4108', 1, 'Нараховані доходи за інвестиціями в асоційовані компанії');
Insert into BARS.REZ_DEB
   (NBS, PR, TXT)
 Values
   ('4208', 1, 'Нараховані доходи за iнвестицiями в дочiрнi компанiї');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('9000', 9, 1, 'Гарантії, що надані банкам');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2)
 Values
   ('9001', 9, 1);
Insert into BARS.REZ_DEB
   (NBS, PR, PR2)
 Values
   ('9002', 9, 1);
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('9003', 9, 1, 'Авалi, що надані банкам');
Insert into BARS.REZ_DEB
   (NBS, PR, TXT)
 Values
   ('9020', 9, 'Гарантії, що надані клієнтам');
Insert into BARS.REZ_DEB
   (NBS, PR, TXT)
 Values
   ('9023', 9, 'Авалi, що надані клієнтам');
Insert into BARS.REZ_DEB
   (NBS, PR, PR2, TXT)
 Values
   ('9100', 9, 1, 'Зобов''язання з кредитування, що надані банкам');
Insert into BARS.REZ_DEB
   (NBS, PR, TXT)
 Values
   ('9122', 9, 'Непокриті акредитиви');
Insert into BARS.REZ_DEB
   (NBS, PR, TXT)
 Values
   ('9129', 9, 'Iнші зобов''язання з кредитування, що надані клієнтам');
Insert into BARS.REZ_DEB
   (NBS, PR, TXT, TIPA, TIPA_FV)
 Values
   ('9200', 9, 'Валюта та банківські метали до отримання за умовами спот', 92, 3);
Insert into BARS.REZ_DEB
   (NBS, PR, TXT, TIPA, TIPA_FV)
 Values
   ('9201', 9, 'Валюта та банківські метали до отримання за форвардними контрактами, що призначені для обліку хеджування', 92, 3);
Insert into BARS.REZ_DEB
   (NBS, PR, TXT, TIPA, TIPA_FV)
 Values
   ('9202', 9, 'Валюта та банківські метали до отримання за форвардними контрактами в торговому портфелі банку', 92, 3);
Insert into BARS.REZ_DEB
   (NBS, PR, TXT, TIPA, TIPA_FV)
 Values
   ('9203', 9, 'Валюта та банківські метали до отримання за опцiонними контрактами, що призначені для обліку хеджування', 92, 3);
Insert into BARS.REZ_DEB
   (NBS, PR, TXT, TIPA, TIPA_FV)
 Values
   ('9204', 9, 'Валюта та банківські метали до отримання за опцiонними контрактами в торговому портфелі банку', 92, 3);
Insert into BARS.REZ_DEB
   (NBS, PR, TXT, TIPA, TIPA_FV)
 Values
   ('9206', 9, 'Валюта та банківські метали до отримання за ф''ючерсними контрактами, що призначені для обліку хеджування', 92, 3);
Insert into BARS.REZ_DEB
   (NBS, PR, TXT, TIPA, TIPA_FV)
 Values
   ('9207', 9, 'Валюта та банківські метали до отримання за ф''ючерсними контрактами в торговому портфелі банку', 92, 3);
Insert into BARS.REZ_DEB
   (NBS, TXT, TIPA, TIPA_FV)
 Values
   ('9208', 'Вимоги щодо до отримання валюти за валютними своп-контрактами', 92, 3);
Insert into BARS.REZ_DEB
   (NBS, PR, TXT, TIPA, TIPA_FV)
 Values
   ('9300', 9, 'Вимоги за андеррайтингом цiнних паперiв', 93, 3);
Insert into BARS.REZ_DEB
   (NBS, PR, TXT, TIPA, TIPA_FV)
 Values
   ('9350', 9, 'Активи до отримання та депозити до розмiщення за спотовими контрактами', 92, 3);
Insert into BARS.REZ_DEB
   (NBS, PR, TXT, TIPA, TIPA_FV)
 Values
   ('9351', 9, 'Активи до отримання за форвардними контрактами, що призначені для обліку хеджування', 92, 3);
Insert into BARS.REZ_DEB
   (NBS, PR, TXT, TIPA, TIPA_FV)
 Values
   ('9352', 9, 'Активи до отримання за форвардними контрактами в торговому портфелі банку', 92, 3);
Insert into BARS.REZ_DEB
   (NBS, PR, TXT, TIPA, TIPA_FV)
 Values
   ('9353', 9, 'Активи до отримання за опцiонними контрактами, що призначені для обліку хеджування', 92, 3);
Insert into BARS.REZ_DEB
   (NBS, PR, TXT, TIPA, TIPA_FV)
 Values
   ('9354', 9, 'Активи до отримання за опцiонними контрактами в торговому портфелі банку', 92, 3);
Insert into BARS.REZ_DEB
   (NBS, PR, TXT, TIPA, TIPA_FV)
 Values
   ('9356', 9, 'Активи до отримання за ф''ючерсними контрактами, що призначені для обліку хеджування', 92, 3);
Insert into BARS.REZ_DEB
   (NBS, PR, TXT, TIPA, TIPA_FV)
 Values
   ('9357', 9, 'Активи до отримання за ф''ючерсними контрактами в торговому портфелі банку', 92, 3);
Insert into BARS.REZ_DEB
   (NBS, TXT, TIPA, TIPA_FV)
 Values
   ('9358', 'Грошові потоки до отримання за процентними своп-контрактами', 92, 3);
Insert into BARS.REZ_DEB
   (NBS, TXT, TIPA, TIPA_FV)
 Values
   ('9359', 'Активи до отримання за іншими похідними фінансовими інструментами, що оцінюються за справедливою вартістю через прибутки/збитки', 92, 3);
COMMIT;
