-- ===================================================================================
-- Module : UPL
-- Date   : 20.07.2017
-- ===================================================================================
-- Группи вивантаження файлів для DWH
-- ===================================================================================

DELETE FROM BARSUPL.upl_groups WHERE group_id in (18);

insert into barsupl.upl_groups(group_id, descript)    values(18,'Вивантаження #A7');


COMMIT;