-- ======================================================================================
-- Module : UPL
-- Date   : 20.07.2017
-- ======================================================================================
-- Групи вивантаження файлів даних для DWH
-- ======================================================================================

  delete from BARSUPL.UPL_FILEGROUPS_RLN 
   where file_id in (566);

--   -- 18,'Вивантаження #A7':
--
insert into barsupl.upl_filegroups_rln(group_id, file_id, sql_id) values(18, 566, 566);  



COMMIT;
