PROMPT ===================================================================================== 
PROMPT *** Run *** ========== Scripts /Sql/Bars/Data/Err/mod_REZ.sql =========*** Run *** ==
PROMPT ===================================================================================== 


PROMPT *** Create/replace ERR модуль REZ ***
declare
  l_mod  varchar2(3) := 'REZ';
  l_rus  varchar2(3) := 'RUS';
  l_ukr  varchar2(3) := 'UKR';
  l_eng  varchar2(3) := 'ENG';
  l_geo  varchar2(3) := 'GEO';
  l_exc  number      := -20000;
begin
    bars_error.add_module(l_mod, 'Резерв', 1);

    bars_error.add_message(l_mod, 1, l_exc, l_rus, 'Не для всех счетов указан счет резервного фонда ("Справочник счетов резервирования")', '', 1, '1');
    bars_error.add_message(l_mod, 1, l_exc, l_ukr, 'Не для всіх рахунків вказано рахунок резервного фонду ("Довідник рахунків резервування")', '', 1, '1');

    bars_error.add_message(l_mod, 2, l_exc, l_rus, 'Делать расчет за выходной день запрещено. Выберите рабочий день', '', 1, '2');
    bars_error.add_message(l_mod, 2, l_exc, l_ukr, 'Виконувати розрахунок за вихідний день заборонено. Оберіть робочий день', '', 1, '2');

    bars_error.add_message(l_mod, 3, l_exc, l_rus, 'Есть ошибки при формировании резерва. Посмотрите отчет', '', 1, '3');
    bars_error.add_message(l_mod, 3, l_exc, l_ukr, 'Є помилки при формуванні резерву. Перегляньте звіт', '', 1, '3');

    bars_error.add_message(l_mod, 4, l_exc, l_rus, 'Нельзя сформировать резерв - есть неоплаченные документы', '', 1, '4');
    bars_error.add_message(l_mod, 4, l_exc, l_ukr, 'Неможливо сформувати резерв - є несплачені документи', '', 1, '4');

    bars_error.add_message(l_mod, 5, l_exc, l_rus, 'Внутреняя ошибка при выполении процедуры (обратитесь к разработчику)', '', 1, '5');
    bars_error.add_message(l_mod, 5, l_exc, l_ukr, 'Внутрішня помилка при виконанні процедури (зверніться до розробника)', '', 1, '5');
  commit;
end;
/
PROMPT ===================================================================================== 
PROMPT *** End *** ========== Scripts /Sql/Bars/Data/Err/mod_REZ.sql =========*** Run *** ==
PROMPT ===================================================================================== 
