begin
  bars_error.add_message('ZAY', 60, -20000, 'RUS', 'Значение тэга - D1#70 должно соотвтетсвовать коду из Справочника целей покупки-продажи валюты', '', 1, 'FK_ZAYAVKA_ZAYAIMS');
  bars_error.add_message('ZAY', 60, -20000, 'UKR', 'Значення тега - D1#70 повинно відповідати коду із Довідника цілей покупки-продажу валюти', '', 1, 'FK_ZAYAVKA_ZAYAIMS');
  bars_error.add_message('ZAY', 61, -20000, 'RUS', 'Значение тэгов - D6#70/D8#70 должно соотвтетсвовать коду из Справочника стран-эмитентов валют', '', 1, 'XFK_ZAYAVKA_COUNTRY');
  bars_error.add_message('ZAY', 61, -20000, 'UKR', 'Значення тегів - D6#70/D8#70 повинно відповідати коду із Довідника країн-емітентів валюти', '', 1, 'XFK_ZAYAVKA_COUNTRY');
  bars_error.add_message('ZAY', 62, -20000, 'RUS', 'Значение тэга - DB#70 должно соотвтетсвовать коду из Справочника кодов товарных групп', '', 1, 'FK_ZAYAVKA_PRODUCT_GROUP');
  bars_error.add_message('ZAY', 62, -20000, 'UKR', 'Значення тега - DB#70 повинно відповідати коду із Довідника кодів товарних груп', '', 1, 'FK_ZAYAVKA_PRODUCT_GROUP');
end;
/
commit;
/
