--------------------------------
----------- Реквизиты ----------
--------------------------------
delete from op_rules where tt='МГД';
--------------------------------
------ Связанные операции ------
--------------------------------
delete from ttsap where tt='МГД' or ttap='МГД';
--------------------------------
------- Балансовые счета -------
--------------------------------
delete from ps_tts where tt='МГД';
--------------------------------
-------- Виды документов -------
--------------------------------
delete from tts_vob where tt='МГД';
--------------------------------
-------- Группы контроля -------
--------------------------------
delete from chklist_tts where tt='МГД';
--------------------------------
------------- Папки ------------
--------------------------------
delete from folders_tts where tt='МГД';

--delete from tts where tt='МГД';

-- удаление приводит к полному сканировнаию oper
update tts set nlsm='XXXX' where tt='МГД';

commit;
