-- 01.08.2017 изменения в кл-ре для файла #D8
-- с 01.08.2017 для файла #D8 в показатель 121 добавлены бал. и внебал. счета 
--  3043, 3044, 3049, 3143, 3144, 9208, 9358, 9359 в KL_R020 D_OPEN='04/07/2017'

BEGIN
   suda;

   DELETE FROM kl_f3_29 WHERE kf='71' and 
      r020 in ('3043', '3044', '3049', '3143', '3144', '9208', '9358', '9359');  

   INSERT INTO KL_F3_29 ( KF, R020, R050, R012, DDD, TXT, S240 ) VALUES ( 
   '71', '3043', '11', '1', '121', 'Активи за валютними своп-контрактами', null); 

   INSERT INTO KL_F3_29 ( KF, R020, R050, R012, DDD, TXT, S240 ) VALUES ( 
   '71', '3044', '11', '1', '121', 'Активи за процентними своп-контрактами', null); 

   INSERT INTO KL_F3_29 ( KF, R020, R050, R012, DDD, TXT, S240 ) VALUES ( 
   '71', '3049', '11', '1', '121', 'Активи за іншими похідними фін.інструментами', null); 

   INSERT INTO KL_F3_29 ( KF, R020, R050, R012, DDD, TXT, S240 ) VALUES ( 
   '71', '3143', '11', '1', '121', 'Активи за валютними своп-контрактами(хеджування)', null); 

   INSERT INTO KL_F3_29 ( KF, R020, R050, R012, DDD, TXT, S240 ) VALUES ( 
   '71', '3144', '11', '1', '121', 'Активи за прцентними своп-контрактами(хеджування)', null); 

   INSERT INTO KL_F3_29 ( KF, R020, R050, R012, DDD, TXT, S240 ) VALUES ( 
   '71', '9208', '91', '1', '121', 'Вимоги щодо отримання валюти за своп-контрактами', null); 

   INSERT INTO KL_F3_29 ( KF, R020, R050, R012, DDD, TXT, S240 ) VALUES ( 
   '71', '9358', '91', '1', '121', 'Грошові потоки до отримання за %% своп-контрактами', null); 

   INSERT INTO KL_F3_29 ( KF, R020, R050, R012, DDD, TXT, S240 ) VALUES ( 
   '71', '9359', '11', '1', '121', 'Активи до отримання за ін. похідними фін. інструментами', null); 

   commit;

END;
/