/* D:\K\MMFO\forex\COBUMMFO-4222.sql 
   Середньо-зважені курси НЕ можуть бути одночасно і Купівлі, і Продажу. 
   Бо це повинно відповідати знакові рах.ВАЛ.поз. за цей день. а він лише ОДИН.
   Очевидно, колись було зроблено прододку, що змінила знак, а курс не було перекраховано.

   1) Скриваємо в довіднику одну колонку. залишаємо тільки ОДНУ і називаємо її просто "СЕРДНЬО_зважений курс надбанні вал.поз"
   2) для того. щоб ВСІ програми спрацьвували коректно дублюємо обидві колонки однаковим значенням
  скриптом    - минулі дати.
  в процедурі - майбутні дати
*/

--  скриптом    - минулі дати.
begin suda;  
update spot set RATE_K = RATE_P where RATE_K = 0;
update spot set RATE_P = RATE_K where RATE_P = 0;
exception when others then  if SQLCODE = -00001 then null;   else raise; end if; 
end;
/
commit; 