begin
update DPT_TYPES_PARAM set DESCRIPTION_UK ='Строк - 3,6,9,12,18 місяців. Мінімальна сума депозиту - 1000 грн, 100 дол.США, Євро. Виплата процентів - щомісячно або капіталізація процентів. Автопролонгація'
where type_id=47;
update DPT_TYPES_PARAM set DESCRIPTION_UK ='Відкриття депозиту за наявності у вкадника пенсійного посвідчення. Строк - 3,6,9,12,18 місяців. Мінімальна сума депозиту - 1000 грн, 100 дол.США, Євро. Виплата процентів - щомісячно або капіталізація процентів. Автопролонгація'
where type_id=48;
update DPT_TYPES_PARAM set DESCRIPTION_UK ='Cтрок 1 місяць Мінімальна сума депозиту - 1000 грн, 100 дол.США, Євро. Виплата процентів щомісячно. Автопролонгація. Мінімальні бонуси при пролонгації + 0,1% до базової ставки в національній валюті: + 0,05% до базової ставки в іноземній валюті; З кожною пролонгацією процентна ставка за депозитом та бонуси збільшуються протягом 11 пролонгацій.'
where type_id=50;
end;
/
commit; 