SET DEFINE OFF;

exec bc.home;

delete from BARS.KL_F20;
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '2', 
    '2', 'X', '81415269  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '2', '1', 
    '1', 'X', '70116161  ', '1616 неамортизована премія кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '1', '1', 
    '1', 'X', '70116169  ', '1616 неамортизована премія за кредитами вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '2', '1', 
    '2', 'X', '70216162  ', '1616 неамортизована премія за кредитами вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '1', '1', 
    '2', 'X', '70216169  ', '1616 неамортизована премія за кредитами вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '1', '2', 
    '1', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '2', '2', 
    '1', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '1', '2', 
    '2', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '2', '2', 
    '2', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '1', '1', 
    '1', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '2', '1', 
    '1', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '1', '1', 
    '2', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '2', '1', 
    '2', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '1', '2', 
    '1', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '2', '2', 
    '1', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '1', '2', 
    '2', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '2', '2', 
    '2', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '1', 
    '1', 'X', '70515161  ', '1516 короткостроковi кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '1', 
    '1', 'X', '70515169  ', '1516 короткостроковi кошти вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '1', 
    '2', 'X', '70615162  ', '1516 довгостроковi кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '1', 
    '2', 'X', '70615169  ', '1516 довгостроковi кошти вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '2', 
    '1', 'X', '80515161  ', '1516 короткостроковi кошти вiд банкiв нерез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '2', 
    '1', 'X', '80515169  ', '1516 короткостроковi кошти вiд банкiв рез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '2', 
    '2', 'X', '80615162  ', '1516 довгостроковi кошти вiд банкiв нерез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '2', 
    '2', 'X', '80615169  ', '1516 довгостроковi кошти вiд банкiв рез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '1', 
    '1', 'X', '71315261  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '1', 
    '1', 'X', '71315269  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '1', 
    '2', 'X', '71415262  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '1', 
    '2', 'X', '71415269  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '2', 
    '1', 'X', '81315261  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '2', 
    '1', 'X', '81315269  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '2', 
    '2', 'X', '81415262  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '2', 
    '2', 'X', '81415269  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '2', '1', 
    '1', 'X', '70116161  ', '1616 неамортизована премія кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '1', '1', 
    '1', 'X', '70116169  ', '1616 неамортизована премія за кредитами вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '2', '1', 
    '2', 'X', '70216162  ', '1616 неамортизована премія за кредитами вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '1', '1', 
    '2', 'X', '70216169  ', '1616 неаморт/ премія за кредитами вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '1', '2', 
    '1', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '2', '2', 
    '1', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '1', '2', 
    '2', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '2', '2', 
    '2', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '1', '1', 
    '1', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '2', '1', 
    '1', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '1', '1', 
    '2', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '2', '1', 
    '2', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '1', '2', 
    '1', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '2', '2', 
    '1', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '1', '2', 
    '2', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '2', '2', 
    '2', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '1', '1', 
    '1', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '2', '1', 
    '1', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '1', '1', 
    '2', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '2', '1', 
    '2', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '1', '2', 
    '1', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '2', '2', 
    '1', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '1', '2', 
    '2', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '2', '2', 
    '2', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '1', 
    '1', 'X', '70515161  ', '1516 короткостроковi кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '1', 
    '1', 'X', '70515169  ', '1516 короткостроковi кошти вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '1', 
    '2', 'X', '70615162  ', '1516 довгостроковi кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '1', 
    '2', 'X', '70615169  ', '1516 довгостроковi кошти вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '2', 
    '1', 'X', '80515161  ', '1516 короткостроковi кошти вiд банкiв нерез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '2', 
    '1', 'X', '80515169  ', '1516 короткостроковi кошти вiд банкiв рез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '2', 
    '2', 'X', '80615162  ', '1516 довгостроковi кошти вiд банкiв нерез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '2', 
    '2', 'X', '80615169  ', '1516 довгостроковi кошти вiд банкiв рез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '1', 
    '1', 'X', '71315261  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '1', 
    '1', 'X', '71315269  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '1', 
    '2', 'X', '71415262  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '1', 
    '2', 'X', '71415269  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '2', 
    '1', 'X', '81315261  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '2', 
    '1', 'X', '81315269  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '2', 
    '2', 'X', '81415262  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '2', 
    '2', 'X', '81415269  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '2', '1', 
    '1', 'X', '70116161  ', '1616 неамортизована премія кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '1', '1', 
    '1', 'X', '70116169  ', '1616 неамортизована премія за кредитами вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '2', '1', 
    '2', 'X', '70216162  ', '1616 неамортизована премія за кредитами вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '1', '1', 
    '2', 'X', '70216169  ', '1616 неаморт/ премія за кредитами вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '1', '2', 
    '1', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '2', '2', 
    '1', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '1', '2', 
    '2', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '2', '2', 
    '2', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '1', '1', 
    '1', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '2', '1', 
    '1', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '1', '1', 
    '2', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '2', '1', 
    '2', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '1', '2', 
    '1', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '2', '2', 
    '1', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '1', '2', 
    '2', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '2', '2', 
    '2', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '1', 
    '1', 'X', '70515161  ', '1516 короткостроковi кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '1', 
    '1', 'X', '70515169  ', '1516 короткостроковi кошти вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '1', 
    '2', 'X', '70615162  ', '1516 довгостроковi кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '1', 
    '2', 'X', '70615169  ', '1516 довгостроковi кошти вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '2', 
    '1', 'X', '80515161  ', '1516 короткостроковi кошти вiд банкiв нерез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '2', 
    '1', 'X', '80515169  ', '1516 короткостроковi кошти вiд банкiв рез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '2', 
    '2', 'X', '80615162  ', '1516 довгостроковi кошти вiд банкiв нерез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '2', 
    '2', 'X', '80615169  ', '1516 довгостроковi кошти вiд банкiв рез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '1', 
    '1', 'X', '71315261  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '1', 
    '1', 'X', '71315269  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '1', 
    '2', 'X', '71415262  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '1', 
    '2', 'X', '71415269  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '2', 
    '1', 'X', '81315261  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '2', 
    '1', 'X', '81315269  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '2', 
    '2', 'X', '81415262  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '2', 
    '2', 'X', '81415269  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '2', '1', 
    '1', 'X', '70116161  ', '1616 неамортизована премія кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '1', '1', 
    '1', 'X', '70116169  ', '1616 неамортизована премія за кредитами вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '2', '1', 
    '2', 'X', '70216162  ', '1616 неамортизована премія за кредитами вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '1', '1', 
    '2', 'X', '70216169  ', '1616 неаморт/ премія за кредитами вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '2', '2', 
    '1', 'X', '80116161  ', '1616 неаморт. премія за кредитами вiд банкiв нерез. ІВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '1', '2', 
    '1', 'X', '80116169  ', '1616 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '2', '2', 
    '2', 'X', '80216162  ', '1616 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '1', '2', 
    '1', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '2', '2', 
    '1', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '1', '2', 
    '2', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '2', '2', 
    '2', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '1', '1', 
    '1', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '2', '1', 
    '1', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '1', '1', 
    '2', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '2', '1', 
    '2', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '1', '2', 
    '1', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '2', '2', 
    '1', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '1', '2', 
    '2', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '2', '2', 
    '2', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '1', 
    '1', 'X', '70515161  ', '1516 короткостроковi кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '1', 
    '1', 'X', '70515169  ', '1516 короткостроковi кошти вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '1', 
    '2', 'X', '70615162  ', '1516 довгостроковi кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '1', 
    '2', 'X', '70615169  ', '1516 довгостроковi кошти вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '2', 
    '1', 'X', '80515161  ', '1516 короткостроковi кошти вiд банкiв нерез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '2', 
    '1', 'X', '80515169  ', '1516 короткостроковi кошти вiд банкiв рез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '2', 
    '2', 'X', '80615162  ', '1516 довгостроковi кошти вiд банкiв нерез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '2', 
    '2', 'X', '80615169  ', '1516 довгостроковi кошти вiд банкiв рез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '1', 
    '1', 'X', '71315261  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '1', 
    '1', 'X', '71315269  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '1', 
    '2', 'X', '71415262  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '1', 
    '2', 'X', '71415269  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '2', 
    '1', 'X', '81315261  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '2', 
    '1', 'X', '81315269  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '2', 
    '2', 'X', '81415262  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '2', 
    '2', 'X', '81415269  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '2', '1', 
    '1', 'X', '70116161  ', '1616 неамортизована премія кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '1', '1', 
    '1', 'X', '70116169  ', '1616 неамортизована премія за кредитами вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '2', '1', 
    '2', 'X', '70216162  ', '1616 неамортизована премія за кредитами вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '1', '1', 
    '2', 'X', '70216169  ', '1616 неаморт/ премія за кредитами вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '2', '2', 
    '1', 'X', '80116161  ', '1616 неаморт. премія за кредитами вiд банкiв нерез. ІВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '1', '2', 
    '1', 'X', '80116169  ', '1616 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '2', '2', 
    '2', 'X', '80216162  ', '1616 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '1', '2', 
    '2', 'X', '80216169  ', '1616 неаморт. премія за кредитами вiд банкiв рез. ІВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1626', '2', '2', '1', 
    '1', 'X', '70916261  ', '1626 неамортизована премія за кредитами вiд банкiв-нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1626', '2', '1', '1', 
    '1', 'X', '70916269  ', '1626 неамортизована премія за кредитами вiд банкiв-рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1626', '2', '2', '1', 
    '2', 'X', '71016262  ', '1626 неамортизована премія за кредитами вiд банкiв-нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1626', '2', '1', '1', 
    '2', 'X', '71016269  ', '1626 неамортизована премія за кредитами вiд банкiв-рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1626', '2', '2', '2', 
    '1', 'X', '80916261  ', '1626 неамортизована премія за кредитами вiд банкiв-нерез. IB');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1626', '2', '1', '2', 
    '1', 'X', '80916269  ', '1626 неамортизована премія за кредитами вiд банкiв-рез. IB');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1626', '2', '2', '2', 
    '2', 'X', '81016262  ', '1626 довгокостроковi кошти вiд банкiв-нерез. IB');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1626', '2', '1', '2', 
    '2', 'X', '81016269  ', '1626 довгостроковi кошти вiд банкiв-рез. IB');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2616', '2', 'X', '1', 
    '1', 'X', '04326160  ', '2616 неамартизована премія СГ нацалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2616', '2', 'X', '1', 
    '2', 'X', '04426160  ', '2616 неамартизована премія СГ, нацвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2636', '2', 'X', '1', 
    '1', 'X', '04826360  ', '2636 неамартизована премія ФО, нацвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2636', '2', 'X', '1', 
    '2', 'X', '04926360  ', '2636 неамартизована премія ФО, нацвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2656', '2', 'X', '1', 
    '1', 'X', '05026560  ', '2656 неамартизована премія, нацвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2656', '2', 'X', '1', 
    '2', 'X', '05126560  ', '2656 неамартизована премія, нацвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2701', '2', '2', '1', 
    'X', '1', '09227011  ', '2701 кошти що отриманi вiд мiжн.фiн. орг-цiй-нерез. в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2701', '2', '2', '1', 
    'X', '2', '09227012  ', '2701 кошти що отриманi вiд iнших фiн. орг-цiй-нерез. в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2701', '2', '1', '1', 
    'X', '2', '09227013  ', '2701 кошти що отриманi вiд iнших фiн. орг-цiй-рез. в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2701', '2', '2', '2', 
    'X', '1', '19227011  ', '2701 кошти що отриманi вiд мiжн.фiн. орг-цiй-нерез. в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2701', '2', '2', '2', 
    'X', '2', '19227012  ', '2701 кошти що отриманi вiд iнших фiн. орг-цiй-нерез. в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2701', '2', '1', '2', 
    'X', '2', '19227013  ', '2701 кошти що отриманi вiд iнших фiн. орг-цiй-рез. в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', '2', '1', 
    '1', '2', '71727061  ', '2706 неаморт.премiя за короткостр. кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', '1', '1', 
    '1', '2', '71727068  ', '2706 неаморт.премiя за короткостр. кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', 'X', '1', 
    '1', '1', '71727069  ', '2706 неаморт.премiя за короткостр. кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', '2', '1', 
    '2', '2', '71827062  ', '2706 неаморт.премiя за довгостр. кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', '1', '1', 
    '2', '2', '71827068  ', '2706 неаморт.премiя за довгостр. кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', 'X', '1', 
    '2', '1', '71827069  ', '2706 неаморт.премiя за довгостр. кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3016', '1', '1', '2', 
    '1', 'X', '85530161  ', '3016 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3016', '1', '2', '2', 
    '1', 'X', '85530161  ', '3016 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3016', '1', '1', '2', 
    '2', 'X', '85530161  ', '3016 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3016', '1', '2', '2', 
    '2', 'X', '85530161  ', '3016 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3116', '1', '1', '2', 
    '1', 'X', '86531161  ', '3116 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3116', '1', '2', '2', 
    '1', 'X', '86531161  ', '3116 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3116', '1', '1', '2', 
    '2', 'X', '86531161  ', '3116 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3116', '1', '2', '2', 
    '2', 'X', '86531161  ', '3116 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '1', 
    'X', '1', '05826011  ', '2601 кошти на вимогу, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '1', 
    'X', '2', '05826011  ', '2601 кошти на вимогу, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '1', 
    'X', '3', '05826011  ', '2601 кошти на вимогу, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '1', 
    'X', '4', '05926011  ', '2601 строкові кошти, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '1', 
    'X', '5', '05926011  ', '2601 строкові кошти, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '2', 
    'X', '1', '15826011  ', '2601 кошти на вимогу, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '2', 
    'X', '2', '15826011  ', '2601 кошти на вимогу, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '2', 
    'X', '3', '15826011  ', '2601 кошти на вимогу, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '2', 
    'X', '4', '15926011  ', '2601 строкові кошти, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '2', 
    'X', '5', '15926011  ', '2601 строкові кошти, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '1', 
    'X', '1', '05826011  ', '2601 кошти на вимогу, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '1', 
    'X', '2', '05826011  ', '2601 кошти на вимогу, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '1', 
    'X', '3', '05826011  ', '2601 кошти на вимогу, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '1', 
    'X', '4', '05926011  ', '2601 строкові кошти, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '1', 
    'X', '5', '05926011  ', '2601 строкові кошти, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '2', 
    'X', '1', '15826011  ', '2601 кошти на вимогу, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '2', 
    'X', '2', '15826011  ', '2601 кошти на вимогу, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '2', 
    'X', '3', '15826011  ', '2601 кошти на вимогу, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '2', 
    'X', '4', '15926011  ', '2601 строкові кошти, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '2', 
    'X', '5', '15926011  ', '2601 строкові кошти, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '1', 
    'X', '1', '05826011  ', '2601 кошти на вимогу, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '1', 
    'X', '2', '05826011  ', '2601 кошти на вимогу, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '1', 
    'X', '3', '05826011  ', '2601 кошти на вимогу, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '1', 
    'X', '4', '05926011  ', '2601 строкові кошти, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '1', 
    'X', '5', '05926011  ', '2601 строкові кошти, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '2', 
    'X', '1', '15826011  ', '2601 кошти на вимогу, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '2', 
    'X', '2', '15826011  ', '2601 кошти на вимогу, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '2', 
    'X', '3', '15826011  ', '2601 кошти на вимогу, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '2', 
    'X', '4', '15926011  ', '2601 строкові кошти, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '2', 
    'X', '5', '15926011  ', '2601 строкові кошти, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '1', 
    'X', '1', '05826011  ', '2601 кошти на вимогу, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '2', '1', '2', 
    '1', 'X', '84614261  ', '1426 неамарт.дисконт за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '2', '2', '2', 
    '1', 'X', '84614261  ', '1426 неамарт.дисконт за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '2', '1', '2', 
    '2', 'X', '84614261  ', '1426 неамарт.дисконт за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '2', '2', '2', 
    '2', 'X', '84614261  ', '1426 неамарт.дисконт за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1420', '1', '1', '1', 
    '1', 'X', '84714201  ', '1420 ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1420', '1', '2', '1', 
    '1', 'X', '84714201  ', '1420 ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1420', '1', '1', '1', 
    '2', 'X', '84714201  ', '1420 ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1420', '1', '2', '1', 
    '2', 'X', '84714201  ', '1420 ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3010', '1', '1', '2', 
    '1', 'X', '85430101  ', '3010 ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3010', '1', '2', '2', 
    '1', 'X', '85430101  ', '3010 ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3010', '1', '1', '2', 
    '2', 'X', '85430101  ', '3010 ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3010', '1', '2', '2', 
    '2', 'X', '85430101  ', '3010 ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '1', 
    'X', '2', '05826011  ', '2601 кошти на вимогу, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '1', 
    'X', '3', '05826011  ', '2601 кошти на вимогу, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '1', 
    'X', '4', '05926011  ', '2601 строкові кошти, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '1', 
    'X', '5', '05926011  ', '2601 строкові кошти, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3016', '2', '1', '2', 
    '1', 'X', '85630161  ', '3016 неамарт.дисконт за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3016', '2', '2', '2', 
    '1', 'X', '85630161  ', '3016 неамарт.дисконт за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3016', '2', '1', '2', 
    '2', 'X', '85630161  ', '3016 неамарт.дисконт за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3016', '2', '2', '2', 
    '2', 'X', '85630161  ', '3016 неамарт.дисконт за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3010', '1', '1', '1', 
    '1', 'X', '85730101  ', '3010 ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3010', '1', '2', '1', 
    '1', 'X', '85730101  ', '3010 ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3010', '1', '1', '1', 
    '2', 'X', '85730101  ', '3010 ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3010', '1', '2', '1', 
    '2', 'X', '85730101  ', '3010 ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3110', '1', '1', '2', 
    '1', 'X', '86431101  ', '3110 ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3110', '1', '2', '2', 
    '1', 'X', '86431101  ', '3110 ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3110', '1', '1', '2', 
    '2', 'X', '86431101  ', '3110 ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3110', '1', '2', '2', 
    '2', 'X', '86431101  ', '3110 ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '2', 
    'X', '1', '15826011  ', '2601 кошти на вимогу, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '2', 
    'X', '2', '15826011  ', '2601 кошти на вимогу, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '2', 
    'X', '3', '15826011  ', '2601 кошти на вимогу, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '2', 
    'X', '4', '15926011  ', '2601 строкові кошти, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3116', '2', '1', '2', 
    '1', 'X', '86631161  ', '3116 неамарт.дисконт за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3116', '2', '2', '2', 
    '1', 'X', '86631161  ', '3116 неамарт.дисконт за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3116', '2', '1', '2', 
    '2', 'X', '86631161  ', '3116 неамарт.дисконт за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3116', '2', '2', '2', 
    '2', 'X', '86631161  ', '3116 неамарт.дисконт за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3110', '1', '1', '1', 
    '1', 'X', '86731101  ', '3110 ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3110', '1', '2', '1', 
    '1', 'X', '86731101  ', '3110 ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3110', '1', '1', '1', 
    '2', 'X', '86731101  ', '3110 ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '3110', '1', '2', '1', 
    '2', 'X', '86731101  ', '3110 ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2601', '2', 'X', '2', 
    'X', '5', '15926011  ', '2601 строкові кошти, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', '2', '1', 
    'X', '2', '71927063  ', '2706 неаморт.дисконт за кредитами, пасив, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', '1', '1', 
    'X', '2', '71927064  ', '2706 неаморт.дисконт за кредитами, пасив, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', 'X', '1', 
    'X', '1', '71927065  ', '2706 неаморт.дискот за кредитами, пасив, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '2', '1', '1', 
    '1', 'X', '83914161  ', '1416 неамарт.дисконт за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '2', '2', '1', 
    '1', 'X', '83914161  ', '1416 неамарт.дисконт за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '2', '1', '1', 
    '2', 'X', '83914161  ', '1416 неамарт.дисконт за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '2', '2', '1', 
    '2', 'X', '83914161  ', '1416 неамарт.дисконт за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', '2', '1', 
    'X', '2', '81927063  ', '2706 неаморт.дисконт за кредитами, пасив, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', '1', '1', 
    'X', '2', '81927064  ', '2706 неаморт.дисконт за кредитами, пасив, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', 'X', '1', 
    'X', '1', '81927065  ', '2706 неаморт.дискот за кредитами, пасив, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '2', '2', '1', 
    '1', 'X', '70715161  ', '1516 короткостроковi кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '2', '1', '1', 
    '1', 'X', '70715169  ', '1516 короткостроковi кошти вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '2', '2', '1', 
    '2', 'X', '70815162  ', '1516 довгостроковi кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '2', '1', '1', 
    '2', 'X', '70815169  ', '1516 довгостроковi кошти вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '2', '2', '2', 
    '1', 'X', '80715161  ', '1516 короткостроковi кошти вiд банкiв нерез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '2', '1', '2', 
    '1', 'X', '80715169  ', '1516 короткостроковi кошти вiд банкiв рез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '2', '2', '2', 
    '2', 'X', '80815162  ', '1516 довгостроковi кошти вiд банкiв нерез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '2', '1', '2', 
    '2', 'X', '80815169  ', '1516 довгостроковi кошти вiд банкiв рез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '2', '2', '1', 
    '1', 'X', '71515261  ', '1526 короткостроковi кошти вiд банкiв-нерез. нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '2', '1', '1', 
    '1', 'X', '71515269  ', '1526 короткостроковi кошти вiд банкiв-рез. нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '2', '2', '1', 
    '2', 'X', '71615262  ', '1526 довгокостроковi кошти вiд банкiв-нерез. нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '2', '1', '1', 
    '2', 'X', '71615269  ', '1526 довгостроковi кошти вiд банкiв-рез. нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '2', '2', '2', 
    '1', 'X', '81515261  ', '1526 короткостроковi кошти вiд банкiв-нерез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '2', '1', '2', 
    '1', 'X', '81515269  ', '1526 короткостроковi кошти вiд банкiв-рез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '1', '2', '1', 
    '1', 'X', '70316161  ', '1616 короткостроковi кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '1', '1', '1', 
    '1', 'X', '70316169  ', '1616 короткостроковi кошти вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '1', '2', '1', 
    '2', 'X', '70416162  ', '1616 довгостроковi кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '1', '1', '1', 
    '2', 'X', '70416169  ', '1616 довгостроковi кошти вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '1', '2', '2', 
    '1', 'X', '80316161  ', '1616 короткостроковi кошти вiд банкiв нерез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '1', '1', '2', 
    '1', 'X', '80316169  ', '1616 короткостроковi кошти вiд банкiв рез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '1', '2', '2', 
    '2', 'X', '80416162  ', '1616 довгостроковi кошти вiд банкiв нерез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1616', '1', '1', '2', 
    '2', 'X', '80416169  ', '1616 довгостроковi кошти вiд банкiв рез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1626', '1', '2', '1', 
    '1', 'X', '71116261  ', '1626 короткостроковi кошти вiд банкiв-нерез. нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1626', '1', '1', '1', 
    '1', 'X', '71116269  ', '1626 короткостроковi кошти вiд банкiв-рез. нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1626', '1', '2', '1', 
    '2', 'X', '71216262  ', '1626 довгокостроковi кошти вiд банкiв-нерез. нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1626', '1', '1', '1', 
    '2', 'X', '71216269  ', '1626 довгостроковi кошти вiд банкiв-рез. нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1626', '1', '2', '2', 
    '1', 'X', '81116261  ', '1626 короткостроковi кошти вiд банкiв-нерез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1626', '1', '1', '2', 
    '1', 'X', '81116269  ', '1626 короткостроковi кошти вiд банкiв-рез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1626', '1', '2', '2', 
    '2', 'X', '81216262  ', '1626 довгокостроковi кошти вiд банкiв-нерез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1626', '1', '1', '2', 
    '2', 'X', '81216269  ', '1626 довгостроковi кошти вiд банкiв-рез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', '2', '2', 
    '1', '2', '81727071  ', '2707 неаморт.премiя за короткостр. кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', '1', '2', 
    '1', '2', '81727078  ', '2707 неаморт.премiя за короткостр. кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', 'X', '2', 
    '1', '1', '81727079  ', '2707 неаморт.премiя за короткостр. кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', '2', '2', 
    '2', '2', '81827072  ', '2707 неаморт.премiя за довгостр. кредитами IВ (нерез.)');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', '1', '2', 
    '2', '2', '81827078  ', '2707 неаморт.премiя за довгостр. кредитами IВ (рез.)');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', 'X', '2', 
    '2', '1', '81827079  ', '2707 неаморт.премiя за довгостр. кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '1', '2', '2', 
    'X', '2', '81927061  ', '2706 неаморт.дисконт за кредитами, актив, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '1', '1', '2', 
    'X', '2', '81927068  ', '2706 неаморт.дисконт за кредитами, актив, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '1', 'X', '2', 
    'X', '1', '81927069  ', '2706 неаморт.дискот за кредитами, актив, іноз.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '1', '2', '2', 
    '2', '2', '82027062  ', '2706 неаморт.дисконт за довгостр. кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '1', '1', '2', 
    '2', '2', '82027068  ', '2706 неаморт.дисконт за довгостр. кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '1', 'X', '2', 
    '2', '1', '82027069  ', '2706 неаморт.дискот за довгостр. кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2656', '1', 'X', '1', 
    '1', 'X', '03126560  ', '2656 короткостроковi кошти, нацвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2656', '1', 'X', '1', 
    '2', 'X', '03226560  ', '2656 довгостроковi кошти, нацвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2616', '1', 'X', '1', 
    '1', 'X', '04126160  ', '2616 короткостроковi кошти, нацвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2616', '1', 'X', '1', 
    '2', 'X', '04226160  ', '2616 довгостроковi кошти, нацвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '2', '2', '2', 
    '2', 'X', '81615262  ', '1526 довгокостроковi кошти вiд банкiв-нерез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '2', '1', '2', 
    '2', 'X', '81615269  ', '1526 довгостроковi кошти вiд банкiв-рез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2636', '1', 'X', '1', 
    '1', 'X', '04626360  ', '2636 короткостроковi кошти, нацвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2636', '1', 'X', '1', 
    '2', 'X', '04726360  ', '2636 довгостроковi кошти, нацвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2636', '2', 'X', '1', 
    '1', 'X', '04826370  ', '2637 короткостроковi кошти, нацвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2636', '2', 'X', '1', 
    '2', 'X', '04926370  ', '2637 довгостроковi кошти, нацвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2656', '1', 'X', '2', 
    '1', 'X', '13126560  ', '2656 короткостроковi кошти, iнвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2656', '1', 'X', '2', 
    '2', 'X', '13226560  ', '2656 довгостроковi кошти, iнвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2616', '1', 'X', '2', 
    '1', 'X', '14126160  ', '2616 короткостроковi кошти, iнвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2616', '1', 'X', '2', 
    '2', 'X', '14226160  ', '2616 довгостроковi кошти, iнвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2616', '2', 'X', '2', 
    '1', 'X', '14326170  ', '2617 короткостроковi кошти, iнвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2616', '2', 'X', '2', 
    '2', 'X', '14426170  ', '2617 довгостроковi кошти, iнвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2636', '1', 'X', '2', 
    '1', 'X', '14626360  ', '2636 короткостроковi кошти, iнвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2636', '1', 'X', '2', 
    '2', 'X', '14726360  ', '2636 довгостроковi кошти, iнвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2636', '2', 'X', '2', 
    '1', 'X', '14826370  ', '2637 короткостроковi кошти, iнвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2636', '2', 'X', '2', 
    '2', 'X', '14926370  ', '2637 довгостроковi кошти, iнвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2656', '2', 'X', '2', 
    '1', 'X', '15026530  ', '2653 короткостроковi кошти, iнвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2656', '2', 'X', '2', 
    '2', 'X', '15126530  ', '2653 довгостроковi кошти, iнвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2701', '2', '2', '1', 
    'X', '1', '09327011  ', '2701 кошти що отриманi вiд мiжн.фiн. орг-цiй-нерез. в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2701', '2', '2', '1', 
    'X', '2', '09327012  ', '2701 кошти що отриманi вiд iнших фiн. орг-цiй-нерез. в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2701', '2', '1', '1', 
    'X', '2', '09327013  ', '2701 кошти що отриманi вiд iнших фiн. орг-цiй-рез. в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2701', '2', '1', '2', 
    'X', '1', '19327011  ', '2701 кошти що отриманi вiд мiжн.фiн. орг-цiй в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2701', '2', '2', '2', 
    'X', '1', '19327011  ', '2701 кошти що отриманi вiд мiжн.фiн. орг-цiй-нерез. в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2701', '2', '2', '2', 
    'X', '2', '19327012  ', '2701 кошти що отриманi вiд iнших фiн. орг-цiй-нерез. в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2701', '2', '1', '2', 
    'X', '2', '19327013  ', '2701 кошти що отриманi вiд iнших фiн. орг-цiй-рез. в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '1', '2', '1', 
    'X', '2', '71927061  ', '2706 неаморт.дисконт за кредитами, актив, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '1', '1', '1', 
    'X', '2', '71927068  ', '2706 неаморт.дисконт за кредитами, актив, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '1', 'X', '1', 
    'X', '1', '71927069  ', '2706 неаморт.дискот за кредитами, актив, нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '1', '2', '1', 
    '2', '2', '72027062  ', '2706 неаморт.дисконт за довгостр. кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '1', '1', '1', 
    '2', '2', '72027068  ', '2706 неаморт.дисконт за довгостр. кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '2706', '1', 'X', '1', 
    '2', '1', '72027069  ', '2706 неаморт.дискот за довгостр. кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1400', '1', '1', '2', 
    '1', 'X', '82414001  ', '1400 ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1400', '1', '2', '2', 
    '1', 'X', '82414001  ', '1400 ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1400', '1', '1', '2', 
    '2', 'X', '82414001  ', '1400 ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1400', '1', '2', '2', 
    '2', 'X', '82414001  ', '1400 ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '2', '1', '2', 
    '1', 'X', '82614061  ', '1406 неамарт.дисконт за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '2', '2', '2', 
    '1', 'X', '82614061  ', '1406 неамарт.дисконт за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '2', '1', '2', 
    '2', 'X', '82614061  ', '1406 неамарт.дисконт за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1406', '2', '2', '2', 
    '2', 'X', '82614061  ', '1406 неамарт.дисконт за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1400', '1', '1', '1', 
    '1', 'X', '82714001  ', '1400 ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1400', '1', '2', '1', 
    '1', 'X', '82714001  ', '1400 ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1400', '1', '1', '1', 
    '2', 'X', '82714001  ', '1400 ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1400', '1', '2', '1', 
    '2', 'X', '82714001  ', '1400 ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1410', '1', '1', '2', 
    '1', 'X', '83414101  ', '1410 ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1410', '1', '2', '2', 
    '1', 'X', '83414101  ', '1410 ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1410', '1', '1', '2', 
    '2', 'X', '83414101  ', '1410 ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1410', '1', '2', '2', 
    '2', 'X', '83414101  ', '1410 ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '1', '2', 
    '1', 'X', '83514171  ', '1417 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '2', '2', 
    '1', 'X', '83514171  ', '1417 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '1', '2', 
    '2', 'X', '83514171  ', '1417 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '2', '2', 
    '2', 'X', '83514171  ', '1417 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '2', '1', '2', 
    '1', 'X', '83614161  ', '1416 неамарт.дисконт за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '2', '2', '2', 
    '1', 'X', '83614161  ', '1416 неамарт.дисконт за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '2', '1', '2', 
    '2', 'X', '83614161  ', '1416 неамарт.дисконт за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1416', '2', '2', '2', 
    '2', 'X', '83614161  ', '1416 неамарт.дисконт за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1410', '1', '1', '1', 
    '1', 'X', '83714101  ', '1410 ОВДП номiнованi в HВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1410', '1', '2', '1', 
    '1', 'X', '83714101  ', '1410 ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1410', '1', '1', '1', 
    '2', 'X', '83714101  ', '1410 ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1410', '1', '2', '1', 
    '2', 'X', '83714101  ', '1410 ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1420', '1', '1', '2', 
    '1', 'X', '84414201  ', '1420 ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1420', '1', '2', '2', 
    '1', 'X', '84414201  ', '1420 ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1420', '1', '1', '2', 
    '2', 'X', '84414201  ', '1420 ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1420', '1', '2', '2', 
    '2', 'X', '84414201  ', '1420 ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '1', '2', 
    '1', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '2', '2', 
    '1', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '1', '2', 
    '2', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '2', '2', 
    '2', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '1', 
    '1', 'X', '70515161  ', '1516 короткостроковi кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '1', 
    '1', 'X', '70515169  ', '1516 короткостроковi кошти вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '1', 
    '2', 'X', '70615162  ', '1516 довгостроковi кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '1', 
    '2', 'X', '70615169  ', '1516 довгостроковi кошти вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '2', 
    '1', 'X', '80515161  ', '1516 короткостроковi кошти вiд банкiв нерез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '2', 
    '1', 'X', '80515169  ', '1516 короткостроковi кошти вiд банкiв рез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '2', 
    '2', 'X', '80615162  ', '1516 довгостроковi кошти вiд банкiв нерез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '2', 
    '2', 'X', '80615169  ', '1516 довгостроковi кошти вiд банкiв рез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '1', 
    '1', 'X', '71315261  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '1', 
    '1', 'X', '71315269  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '1', 
    '2', 'X', '71415262  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '1', 
    '2', 'X', '71415269  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '2', 
    '1', 'X', '81315261  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '2', 
    '1', 'X', '81315269  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, 
    S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '2', 
    '2', 'X', '81415262  ', '1526 неамортизована премія за кредитами iн.валюта');
COMMIT;
