-- зміни під новий план рахунків з 2018 року 

-- бал.рахунок 1407 переходить на 1406
delete from kl_f20 where ddd in ('82514071');

Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '1', '2', 
    '1', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '2', '2', 
    '1', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '1', '2', 
    '2', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1406', '1', '2', '2', 
    '2', 'X', '82514061  ', '1406 неамарт.премiя за ОВДП номiнованi в IВ');

-- бал.рахунок 1417 переходить на 1416
delete from kl_f20 where ddd in ('83814171');

Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '1', '1', 
    '1', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '2', '1', 
    '1', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '1', '1', 
    '2', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1416', '1', '2', '1', 
    '2', 'X', '83814161  ', '1416 неамарт.премiя за ОВДП номiнованi в НВ');

-- бал.рахунок 1427 переходить на 1426
delete from kl_f20 where ddd in ('84514271');

Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '1', '2', 
    '1', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '2', '2', 
    '1', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '1', '2', 
    '2', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1426', '1', '2', '2', 
    '2', 'X', '84514261  ', '1426 неамарт.премiя за ОВДП номiнованi в IВ');

-- бал.рахунок 1515 переходить на 1516
delete from kl_f20 where ddd in ('70515151','70515159','70615152','70615159',
                                 '80515151','80515159','80615152','80615159');

Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '1', 
    '1', 'X', '70515161  ', '1516 короткостроковi кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '1', 
    '1', 'X', '70515169  ', '1516 короткостроковi кошти вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '1', 
    '2', 'X', '70615162  ', '1516 довгостроковi кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '1', 
    '2', 'X', '70615169  ', '1516 довгостроковi кошти вiд банкiв рез. НВ');

Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '2', 
    '1', 'X', '80515161  ', '1516 короткостроковi кошти вiд банкiв нерез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '2', 
    '1', 'X', '80515169  ', '1516 короткостроковi кошти вiд банкiв рез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '2', '2', 
    '2', 'X', '80615162  ', '1516 довгостроковi кошти вiд банкiв нерез. iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1516', '1', '1', '2', 
    '2', 'X', '80615169  ', '1516 довгостроковi кошти вiд банкiв рез. iн.валюта');

-- бал.рахунок 1525 переходить на 1526
delete from kl_f20 where ddd in ('71315251','71315259','71415252','71415259',
                                 '81315251','81315259','81415252','81415259');

Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '1', 
    '1', 'X', '71315261  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '1', 
    '1', 'X', '71315269  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '1', 
    '2', 'X', '71415262  ', '1526 неамортизована премія за кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '1', 
    '2', 'X', '71415269  ', '1526 неамортизована премія за кредитами нац.валюта');

Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '2', 
    '1', 'X', '81315261  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '2', 
    '1', 'X', '81315269  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '2', '2', 
    '2', 'X', '81415262  ', '1526 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1526', '1', '1', '2', 
    '2', 'X', '81415269  ', '1526 неамортизована премія за кредитами iн.валюта');

-- бал.рахунок 1615 переходить на 1616
delete from kl_f20 where ddd in ('70116151','70116159','70216152','70216159',
                                 '80116151','80116159','80216152','80216159');

Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '2', '1', 
    '1', 'X', '70116161  ', '1616 неамортизована премія кошти вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '1', '1', 
    '1', 'X', '70116169  ', '1616 неамортизована премія за кредитами вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '2', '1', 
    '2', 'X', '70216162  ', '1616 неамортизована премія за кредитами вiд банкiв нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '1', '1', 
    '2', 'X', '70216169  ', '1616 неаморт/ премія за кредитами вiд банкiв рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '2', '2', 
    '1', 'X', '80116161  ', '1616 неаморт. премія за кредитами вiд банкiв нерез. ІВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '1', '2', 
    '1', 'X', '80116169  ', '1616 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '2', '2', 
    '2', 'X', '80216162  ', '1616 неамортизована премія за кредитами iн.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1616', '2', '1', '2', 
    '2', 'X', '80216169  ', '1616 неаморт. премія за кредитами вiд банкiв рез. ІВ');

-- бал.рахунок 1625 переходить на 1626
delete from kl_f20 where ddd in ('70916251','70916259','71016252','71016259',
                                 '80916251','80916259','81016252','81016259');

Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1626', '2', '2', '1', 
    '1', 'X', '70916261  ', '1626 неамортизована премія за кредитами вiд банкiв-нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1626', '2', '1', '1', 
    '1', 'X', '70916269  ', '1626 неамортизована премія за кредитами вiд банкiв-рез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1626', '2', '2', '1', 
    '2', 'X', '71016262  ', '1626 неамортизована премія за кредитами вiд банкiв-нерез. НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1626', '2', '1', '1', 
    '2', 'X', '71016269  ', '1626 неамортизована премія за кредитами вiд банкiв-рез. НВ');

Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1626', '2', '2', '2', 
    '1', 'X', '80916261  ', '1626 неамортизована премія за кредитами вiд банкiв-нерез. IB');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1626', '2', '1', '2', 
    '1', 'X', '80916269  ', '1626 неамортизована премія за кредитами вiд банкiв-рез. IB');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1626', '2', '2', '2', 
    '2', 'X', '81016262  ', '1626 довгокостроковi кошти вiд банкiв-нерез. IB');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '1626', '2', '1', '2', 
    '2', 'X', '81016269  ', '1626 довгостроковi кошти вiд банкiв-рез. IB');

-- бал.рахунок 2617 переходить на 2616
delete from kl_f20 where ddd in ('04326170','04426170');

Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '2616', '2', 'X', '1', 
    '1', 'X', '04326160  ', '2616 неамартизована премія СГ нацалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '2616', '2', 'X', '1', 
    '2', 'X', '04426160  ', '2616 неамартизована премія СГ, нацвалюта');

-- бал.рахунок 2637 переходить на 2636
delete from kl_f20 where ddd in ('04826170','04926170');

Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '2636', '2', 'X', '1', 
    '1', 'X', '04826360  ', '2636 неамартизована премія ФО, нацвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '2636', '2', 'X', '1', 
    '2', 'X', '04926360  ', '2636 неамартизована премія ФО, нацвалюта');

-- бал.рахунок 2653 переходить на 2656
delete from kl_f20 where ddd in ('05026530','05126530');


Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '2656', '2', 'X', '1', 
    '1', 'X', '05026560  ', '2656 неамартизована премія, нацвалюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '2656', '2', 'X', '1', 
    '2', 'X', '05126560  ', '2656 неамартизована премія, нацвалюта');

-- бал.рахунок 2700 переходить на 2701
delete from kl_f20 where ddd in ('09227001','09227002','09227003',
                                 '19227001','19227002','19227003');

Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '2701', '2', '2', '1', 
    'X', '1', '09227011  ', '2701 кошти що отриманi вiд мiжн.фiн. орг-цiй-нерез. в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '2701', '2', '2', '1', 
    'X', '2', '09227012  ', '2701 кошти що отриманi вiд iнших фiн. орг-цiй-нерез. в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '2701', '2', '1', '1', 
    'X', '2', '09227013  ', '2701 кошти що отриманi вiд iнших фiн. орг-цiй-рез. в НВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '2701', '2', '2', '2', 
    'X', '1', '19227011  ', '2701 кошти що отриманi вiд мiжн.фiн. орг-цiй-нерез. в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '2701', '2', '2', '2', 
    'X', '2', '19227012  ', '2701 кошти що отриманi вiд iнших фiн. орг-цiй-нерез. в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '2701', '2', '1', '2', 
    'X', '2', '19227013  ', '2701 кошти що отриманi вiд iнших фiн. орг-цiй-рез. в IВ');

-- бал.рахунок 2707 переходить на 2706
delete from kl_f20 where ddd in ('71727071','71727078','71727079',
                                 '71827072','71827078','71827079');

Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', '2', '1', 
    '1', '2', '71727061  ', '2706 неаморт.премiя за короткостр. кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', '1', '1', 
    '1', '2', '71727068  ', '2706 неаморт.премiя за короткостр. кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', 'X', '1', 
    '1', '1', '71727069  ', '2706 неаморт.премiя за короткостр. кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', '2', '1', 
    '2', '2', '71827062  ', '2706 неаморт.премiя за довгостр. кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', '1', '1', 
    '2', '2', '71827068  ', '2706 неаморт.премiя за довгостр. кредитами нац.валюта');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '2706', '2', 'X', '1', 
    '2', '1', '71827069  ', '2706 неаморт.премiя за довгостр. кредитами нац.валюта');

-- бал.рахунок 3017 переходить на 3016
delete from kl_f20 where ddd in ('85530171');

Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '3016', '1', '1', '2', 
    '1', 'X', '85530161  ', '3016 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '3016', '1', '2', '2', 
    '1', 'X', '85530161  ', '3016 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '3016', '1', '1', '2', 
    '2', 'X', '85530161  ', '3016 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '3016', '1', '2', '2', 
    '2', 'X', '85530161  ', '3016 неамарт.премiя за ОВДП номiнованi в IВ');

-- бал.рахунок 3117 переходить на 3116
delete from kl_f20 where ddd in ('86531171');

Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '3116', '1', '1', '2', 
    '1', 'X', '86531161  ', '3116 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '3116', '1', '2', '2', 
    '1', 'X', '86531161  ', '3116 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '3116', '1', '1', '2', 
    '2', 'X', '86531161  ', '3116 неамарт.премiя за ОВДП номiнованi в IВ');
Insert into BARS.KL_F20
   (KF, R020, T020, K030, R031, S181, R013, DDD, TXT)
 Values
   ('20', '3116', '1', '2', '2', 
    '2', 'X', '86531161  ', '3116 неамарт.премiя за ОВДП номiнованi в IВ');


--commit;

