
PROMPT ===================================================================================== 
PROMPT *** Run *** ========== Scripts /Sql/BARS/Script/UPD6299_KL_F3_29.sql =========*** Run
PROMPT ===================================================================================== 

--  корректировка списка балансовых для файла #6B в kl_f3_29

exec bc.home;

begin

delete from kl_f3_29
 where kf= '6B';

insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2010', '11', '1',  '111', 'Кредити, що надані за операціями репо суб''єктам господарюван');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2018', '03', '1',  '111', 'Нараховані доходи за кредитами, що надані за операціями репо' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2020', '11', '1',  '111', 'Кредити, що наданi за врахованими векселями суб''єктам господ');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2028', '03', '1',  '111', 'Нараховані доходи за кредитами, що наданi за врахованими век' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2030', '11', '1',  '111', 'Вимоги, що придбанi за операцiями факторингу iз суб''єктами г');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2038', '03', '1',  '111', 'Нараховані доходи за вимогами, що придбані за операціями фак' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2040', '11', '1',  '111', 'Кредити');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2041', '11', '1',  '111', 'Кредити');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2042', '11', '1',  '111', 'Вимоги');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2043', '11', '1',  '111', 'кредити в поточну діяльність');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2044', '11', '1',  '111', 'Фiнансовий лiзинг (оренда)');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2045', '11', '1',  '111', 'iпотечнi кредити, що наданi суб''єктам господ');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2048', '03', '1',  '111', 'Нараховані доходи за кредитами' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2060', '11', '1',  '111', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2063', '11', '1',  '111', 'кредити в поточну діяльність');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2068', '03', '1',  '111', 'Нараховані доходи за кредитами в поточну діяльність' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2071', '11', '1',  '111', 'Фiнансовий лiзинг (оренда), що наданий суб''єктам господарюва');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2078', '03', '1',  '111', 'Нараховані доходи за фінансовим лізингом');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2083', '11', '1',  '111', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2088', '03', '1',  '111', 'Нарахованi доходи за iпотечними кредитами, що наданi суб''єкт');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2103', '11', '1',  '111', 'кредити, що надані органам державної влади    ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2108', '03', '1',  '111', 'Нараховані доходи за кредитами, що надані органам державної ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2113', '11', '1',  '111', 'кредити, що наданi органам мiсцевого самовряду' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2118', '03', '1',  '111', 'Нараховані доходи за кредитами, що надані органам мiсцевого ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2123', '11', '1',  '111', 'iпотечнi кредити, що наданi органам державної ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2128', '03', '1',  '111', 'Нараховані доходи за iпотечними кредитами, що наданi органам' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2133', '11', '1',  '111', 'iпотечнi кредити, що наданi органам мiсцевого ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2138', '03', '1',  '111', 'Нарахованi доходи за iпотечними кредитами, що наданi органам' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2140', '11', '1',  '111', 'кредити, що надані органам державної влади    ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2141', '11', '1',  '111', 'кредити, що наданi органам мiсцевого самовряду' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2142', '11', '1',  '111', 'iпотечнi кредити, що наданi органам державної ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2143', '11', '1',  '111', 'iпотечнi кредити, що наданi органам мiсцевого ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2148', '03', '1',  '111', 'Нараховані доходи за кредитами, що надані органам державної ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2203', '11', '1',  '111', 'кредити на поточні потреби, що надані фізичним' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2208', '03', '1',  '111', 'Нараховані доходи за кредитами на поточні потреби, що надані' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2211', '11', '1',  '111', 'Фiнансовий лiзинг (оренда), що наданий фiзичним особам' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2218', '03', '1',  '111', 'Нарахованi доходи за фiнансовим лiзингом, що наданий фiзични' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2220', '11', '1',  '111', 'Кредити, що надані за врахованими векселями фізичним особам ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2228', '03', '1',  '111', 'Нараховані доходи за кредитами, що надані за врахованими век' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2233', '11', '1',  '111', 'iпотечнi кредити, що наданi фiзичним особам   ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2238', '03', '1',  '111', 'Нарахованi доходи за iпотечними кредитами, що наданi фiзични' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2240', '11', '1',  '111', 'кредити на поточні потреби, що надані фізичним' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2241', '11', '1',  '111', 'Фiнансовий лiзинг (оренда), що наданий фiзичним особам' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2242', '11', '1',  '111', 'Кредити, що надані за врахованими векселями фізичним особам ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2243', '11', '1',  '111', 'iпотечнi кредити, що наданi фiзичним особам   ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2248', '03', '1',  '111', 'Нараховані доходи за кредитами на поточні потреби, що надані' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2301', '11', '1',  '111', 'кредити в поточну діяльність');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2303', '11', '1',  '111', 'кредити в поточну діяльність');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2307', '13', '3',  '111', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2308', '03', '1',  '111', 'Нараховані доходи за кредитами в поточну діяльність' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2310', '11', '1',  '111', 'Кредити');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2311', '11', '1',  '111', 'Кредити');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2317', '13', '3',  '111', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2318', '03', '1',  '111', 'Нараховані доходи за кредитами' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2320', '11', '1',  '111', 'Кредити');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2321', '11', '1',  '111', 'Кредити');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2327', '13', '3',  '111', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2328', '03', '1',  '111', 'Нараховані доходи за кредитами' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2330', '11', '1',  '111', 'Вимоги');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2331', '11', '1',  '111', 'Вимоги');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2337', '13', '3',  '111', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2338', '03', '1',  '111', 'Нараховані доходи за вимогами' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2340', '11', '1',  '111', 'Фiнансовий лiзинг (оренда)');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2341', '11', '1',  '111', 'Фiнансовий лiзинг (оренда)');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2347', '13', '3',  '111', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2348', '03', '1',  '111', 'Нараховані доходи за фінансовим лізингом');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2351', '11', '1',  '111', 'iпотечнi кредити, що наданi суб''єктам господ');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2353', '11', '1',  '111', 'iпотечнi кредити, що наданi суб''єктам господ');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2357', '13', '3',  '111', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2358', '03', '1',  '111', 'Нарахованi доходи за iпотечними кредитами, що наданi суб''єкт');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2360', '11', '1',  '111', 'кредити, що надані органам державної влади    ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2361', '11', '1',  '111', 'кредити, що надані органам державної влади    ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2362', '11', '1',  '111', 'iпотечнi кредити, що наданi органам державної ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2363', '11', '1',  '111', 'iпотечнi кредити, що наданi органам державної ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2367', '13', '3',  '111', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2368', '03', '1',  '111', 'Нараховані доходи за кредитами, що надані органам державної ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2370', '11', '1',  '111', 'кредити, що наданi органам мiсцевого самовряду' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2371', '11', '1',  '111', 'кредити, що наданi органам мiсцевого самовряду' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2372', '11', '1',  '111', 'iпотечнi кредити, що наданi органам мiсцевого ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2373', '11', '1',  '111', 'iпотечнi кредити, що наданi органам мiсцевого ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2377', '13', '3',  '111', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2378', '03', '1',  '111', 'Нараховані доходи за кредитами, що надані органам мiсцевого ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2380', '11', '1',  '111', 'кредити, що надані органам державної влади    ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2381', '11', '1',  '111', 'кредити, що наданi органам мiсцевого самовряду' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2382', '11', '1',  '111', 'iпотечнi кредити, що наданi органам державної ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2383', '11', '1',  '111', 'iпотечнi кредити, що наданi органам мiсцевого ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2387', '13', '3',  '111', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2388', '03', '1',  '111', 'Нараховані доходи за кредитами, що надані органам державної ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2390', '11', '1',  '111', 'кредити в поточну діяльність');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2391', '11', '1',  '111', 'Кредити');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2392', '11', '1',  '111', 'Кредити');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2393', '11', '1',  '111', 'Вимоги');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2394', '11', '1',  '111', 'Фiнансовий лiзинг (оренда)');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2395', '11', '1',  '111', 'iпотечнi кредити, що наданi суб''єктам господ');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2397', '13', '3',  '111', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2398', '03', '1',  '111', 'Нараховані доходи за кредитами' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2401', '11', '1',  '111', 'кредити на поточні потреби, що надані фізичним' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2403', '11', '1',  '111', 'кредити на поточні потреби, що надані фізичним' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2407', '13', '3',  '111', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2408', '03', '1',  '111', 'Нараховані доходи за кредитами на поточні потреби, що надані' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2410', '11', '1',  '111', 'Фiнансовий лiзинг (оренда), що наданий фiзичним особам' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2411', '11', '1',  '111', 'Фiнансовий лiзинг (оренда), що наданий фiзичним особам' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2417', '13', '3',  '111', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2418', '03', '1',  '111', 'Нарахованi доходи за фiнансовим лiзингом, що наданий фiзични' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2420', '11', '1',  '111', 'Кредити, що надані за врахованими векселями фізичним особам ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2421', '11', '1',  '111', 'Кредити, що надані за врахованими векселями фізичним особам ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2427', '13', '3',  '111', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2428', '03', '1',  '111', 'Нараховані доходи за кредитами, що надані за врахованими век' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2431', '11', '1',  '111', 'iпотечнi кредити, що наданi фiзичним особам   ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2433', '11', '1',  '111', 'iпотечнi кредити, що наданi фiзичним особам   ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2437', '13', '3',  '111', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2438', '03', '1',  '111', 'Нарахованi доходи за iпотечними кредитами, що наданi фiзични' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2450', '11', '1',  '111', 'кредити на поточні потреби, що надані фізичним' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2451', '11', '1',  '111', 'Фiнансовий лiзинг (оренда), що наданий фiзичним особам' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2452', '11', '1',  '111', 'Кредити, що надані за врахованими векселями фізичним особам ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2453', '11', '1',  '111', 'iпотечнi кредити, що наданi фiзичним особам   ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2457', '13', '3',  '111', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2458', '03', '1',  '111', 'Нараховані доходи за кредитами на поточні потреби, що надані' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2600', '03', '1',  '111', 'Кошти на вимогу суб''єктів господарювання                   ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2605', '03', '1',  '111', 'Кошти на вимогу суб''єктів господарювання для здiйснення опер');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2607', '03', '1',  '111', 'Нараховані доходи за кредитами овердрафт, що надані суб''єкта');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2620', '03', '1',  '111', 'Кошти на вимогу фізичних осіб                               ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2625', '03', '1',  '111', 'Кошти на вимогу фізичних осіб для здiйснення операцiй з вико' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2627', '03', '1',  '111', 'Нараховані доходи за кредитами овердрафт, що надані фізичним' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2650', '03', '1',  '111', 'Кошти на вимогу небанківських фінансових установ            ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2655', '03', '1',  '111', 'Кошти на вимогу небанківських фінансових установ для здiйсне' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2657', '03', '1',  '111', 'Нараховані доходи за кредитами овердрафт, що надані небанків' );

insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1200', '11', '1',  '120', 'Кореспондентський рахунок банку в Національному банку Україн' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1203', '11', '1',  '120', 'Кошти обов''язкових резервiв банку в Нацiональному банку Укра');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1207', '11', '1',  '120', 'Накопичувальний рахунок банку в Національному банку України ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1208', '03', '1',  '120', 'Нараховані доходи за коштами на вимогу в Національному банку' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1211', '11', '1',  '120', 'Кошти, що надані Національному банку України за операціями р' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1212', '11', '1',  '120', 'Короткострокові вклади (депозити) у Національному банку Укра' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1218', '03', '1',  '120', 'Нараховані доходи за строковими вкладами (депозитами) у Наці' );

insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1500', '03', '2',  '121', 'Кореспондентські рахунки, що відкриті в інших банках        ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1502', '11', '2',  '121', 'Кошти банків у розрахунках                                  ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1508', '03', '2',  '121', 'Нараховані доходи за коштами на вимогу в інших банках       ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1600', '03', '1',  '121', 'Кореспондентські рахунки інших банків                       ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1607', '03', '1',  '121', 'Нараховані доходи за кредитами овердрафт, що надані іншим ба' );

insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1510', '11', '2',  '122', 'Депозити овернайт, що розміщені в інших банках              ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1513', '11', '2',  '122', 'вклади (депозити), що розміщені в інших банках' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1518', '03', '2',  '122', 'Нараховані доходи за строковими вкладами (депозитами), що ро' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1520', '11', '1',  '122', 'Фінансовий лізинг (оренда), що наданий іншим банкам         ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1521', '11', '1',  '122', 'Кредити овернайт, що надані іншим банкам                    ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1522', '11', '1',  '122', 'Кредити, що надані іншим банкам за операціями репо          ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1524', '11', '1',  '122', 'кредити, що надані іншим банкам               ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1524', '11', '2',  '122', 'вклади (депозити), що розміщені на умовах субо' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1528', '03', '2',  '122', 'Нараховані доходи за кредитами, що надані іншим банкам      ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1532', '11', '1',  '122', 'Кредити, що надані іншим банкам за операціями репо          ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1533', '11', '1',  '122', 'кредити, що надані іншим банкам               ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1533', '11', '2',  '122', 'вклади (депозити), що розміщені на умовах субо' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1535', '13', '3',  '122', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1538', '03', '2',  '122', 'Нараховані доходи за кредитами, що надані іншим банкам      ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1542', '11', '1',  '122', 'Кредити, що надані іншим банкам за операціями репо          ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1543', '11', '1',  '122', 'кредити, що надані іншим банкам               ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1543', '11', '2',  '122', 'вклади (депозити), що розміщені на умовах субо' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1545', '13', '3',  '122', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1548', '03', '2',  '122', 'Нараховані доходи за кредитами, що надані іншим банкам      ' );

insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1430', '11', '1',  '130', 'Боргові цiннi папери, емiтованi Національним банком України,' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1435', '13', '1',  '130', 'Переоцінка боргових цiнних паперів, емiтованих Національним ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1438', '03', '1',  '130', 'Нарахованi доходи за борговими цiнними паперами, емiтованими' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1440', '11', '1',  '130', 'Боргові цiннi папери, емiтованi Національним банком України,' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1448', '03', '1',  '130', 'Нарахованi доходи за борговими цiнними паперами, емiтованими' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3010', '11', '1',  '130', 'Боргові цінні папери органів державної влади в торговому пор' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3110', '11', '1',  '130', 'Боргові цінні папери органiв державної влади в портфелі банк' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3210', '11', '1',  '130', 'Боргові цінні папери органiв державної влади в портфелі банк' );

insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1400', '11', '1',  '130', 'Облігації внутрішньої державної позики, що рефінансуються На' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1401', '11', '1',  '130', 'Облiгацii зовнiшньоi державноi позики, рефiнанс,портфель    ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1402', '11', '1',  '133', 'Боргові цiннi папери органiв державної влади та місцевого са' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1403', '11', '1',  '133', 'Боргові цiннi папери, випущені банками та небанківськими фін' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1404', '11', '1',  '133', 'Борговi цiннi папери нефiнансових пiдприємств, що рефiнансую' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1405', '13', '1',  '133', 'Переоцінка боргових цiнних паперів, що рефінансуються Націон' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1408', '03', '1',  '133', 'Нараховані доходи за борговими цiнними паперами, що рефінанс' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1410', '11', '1',  '130', 'Облігації внутрішньої державної позики, що рефінансуються На' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1411', '11', '1',  '130', 'Облiгацii зовнiшньоi державноi позики, рефiнанс,на продаж   ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1412', '11', '1',  '138', 'Боргові цiннi папери органiв державної влади та місцевого са' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1413', '11', '1',  '138', 'Боргові цiннi папери, випущені банками та небанківськими фін' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1414', '11', '1',  '138', 'Борговi цiннi папери нефiнансових пiдприїмств, що рефiнансую' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1415', '13', '1',  '138', 'Переоцінка боргових цiнних паперів, що рефінансуються Націон' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1418', '03', '1',  '138', 'Нараховані доходи за борговими цiнними паперами, що рефінанс' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1420', '11', '1',  '130', 'Облігації внутрішньої державної позики, що рефінансуються На' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1421', '11', '1',  '130', 'Облiгацii зовнiшньоi державноi позики, рефiнанс,до погашення' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1422', '11', '1',  '135', 'Боргові цiннi папери органiв державної влади та місцевого са' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1423', '11', '1',  '135', 'Боргові цiннi папери, випущені банками та небанківськими фін' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1424', '11', '1',  '135', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1428', '03', '1',  '130', 'Нараховані доходи за борговими цiнними паперами, що рефінанс' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1430', '11', '1',  '130', 'Боргові цiннi папери, емiтованi Національним банком України,' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1435', '13', '1',  '130', 'Переоцінка боргових цiнних паперів, емiтованих Національним ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1438', '03', '1',  '130', 'Нарахованi доходи за борговими цiнними паперами, емiтованими' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1440', '11', '1',  '130', 'Боргові цiннi папери, емiтованi Національним банком України,' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1448', '03', '1',  '130', 'Нарахованi доходи за борговими цiнними паперами, емiтованими' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1450', '11', '1',  '130', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1455', '13', '3',  '130', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1458', '11', '1',  '130', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3010', '11', '1',  '130', 'Боргові цінні папери органів державної влади в торговому пор' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3011', '11', '1',  '133', 'Боргові цінні папери органів мiсцевого самоврядування в торг' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3012', '11', '1',  '133', 'Боргові цінні папери, випущені банками, у торговому портфелі' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3013', '11', '1',  '133', 'Борговi цiннi папери, випущенi небанкiвськими фiнансовими ус' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3014', '11', '1',  '133', 'Борговi цiннi папери нефiнансових пiдприємств у торговому по' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3015', '13', '1',  '133', 'Переоцінка боргових цінних паперів у торговому портфелі банк' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3018', '03', '1',  '133', 'Нараховані доходи за борговими цінними паперами в торговому ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3110', '11', '1',  '130', 'Боргові цінні папери органiв державної влади в портфелі банк' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3111', '11', '1',  '138', 'Боргові цінні папери органiв мiсцевого самоврядування в порт' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3112', '11', '1',  '138', 'Боргові цінні папери, випущені банками, у портфелі банку на ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3113', '11', '1',  '138', 'Борговi цiннi папери, випущенi небанкiвськими фiнансовими ус' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3114', '11', '1',  '138', 'Боргові цінні папери нефінансових пiдприємств у портфелі бан' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3115', '13', '1',  '138', 'Переоцінка боргових цінних паперів у портфелі банку на прода' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3118', '03', '1',  '138', 'Нараховані доходи за борговими цінними паперами в портфелі б' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3210', '11', '1',  '130', 'Боргові цінні папери органiв державної влади в портфелі банк' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3212', '11', '1',  '135', 'Боргові цінні папери, випущені банками, в портфелі банку до ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3213', '11', '1',  '135', 'Борговi цiннi папери, випущенi небанкiвськими фiнансовими ус' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3214', '11', '1',  '135', 'Боргові цінні папери нефінансових підприємств у портфелі бан' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3218', '03', '1',  '135', 'Нараховані доходи за борговими цінними паперами в портфелі б' );

insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3002', '11', '1',  '132', 'Акції та інші цінні папери з нефіксованим прибутком, що випу' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3003', '11', '1',  '132', 'Акції та iншi цiннi папери з нефiксованим прибутком,що випущ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3005', '11', '1',  '132', 'Інші акції та цінні папери з нефіксованим прибутком у торгов' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3007', '13', '1',  '132', 'Переоцінка акції та інших фінансових інвестиції, що облікову' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3008', '03', '1',  '132', 'Нараховані доходи за акціями та іншими фінансовими інвестиці' );

insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3102', '11', '1',  '137', 'Акції та інші цінні папери з нефіксованим прибутком, що випу' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3103', '11', '1',  '137', 'Акції та iншi цiннi папери з нефiксованим прибутком, що випу' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3105', '11', '1',  '137', 'Iнші акції та цінні папери з нефіксованим прибутком у портфе' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3107', '13', '1',  '137', 'Переоцінка акцій та інших фінансових інвестиції у портфелі б' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3108', '03', '1',  '137', 'Нараховані доходи за акціями та іншими фінансовими інвестиці' );

insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3040', '11', '1',  '161', 'Активи за придбаними опціонними контрактами в торговому порт' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3041', '11', '1',  '161', 'Активи за форвардними контрактами в торговому портфелі банку' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3042', '11', '1',  '161', 'Активи за ф''ючерсними контрактами в торговому портфелі банку');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3043', '11', '1',  '161', 'Активи за валютними своп-контрактами, справедлива вартiсть  ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3044', '11', '1',  '161', 'Активи за процентними своп-контрактами, справедлива вартiсть' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3049', '11', '1',  '161', 'Активи за iншими похiдними фiнансовими iнструментами        ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3140', '11', '1',  '161', 'Активи за придбаними опціонними контрактами, що призначені д' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3141', '11', '1',  '161', 'Активи за ф''ючерсними контрактами, що призначенідля обліку х');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3142', '11', '1',  '161', 'Активи за ф''ючерсними контрактами, що призначенідля обліку х');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3143', '11', '1',  '161', 'Активи за валютними своп-контрактами, хеджування            ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3144', '11', '1',  '161', 'Активи за процентними своп-контрактами, хеджування          ' );

insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2805', '11', '1',  '150', 'Дебіторська заборгованість за операціями з грошово-речовими ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2806', '11', '1',  '150', 'Дебіторська заборгованість за індексацією грошових заощаджен' );

insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1811', '11', '1',  '152', 'Дебiторська заборгованiсть за операцiями з готiвкою         ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '1819', '11', '1',  '152', 'Інша дебiторська заборгованiсть за операціями з банками     ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2800', '11', '1',  '152', 'Дебіторська заборгованість за операціями з купiвлi-продажу i' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2801', '11', '1',  '152', 'Дебіторська заборгованість за розрахунками за цiнними папера' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '2809', '11', '1',  '152', 'Iнша дебіторська заборгованість за операціями з клієнтами ба' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3540', '11', '1',  '152', 'Дебіторська заборгованість з придбання та продажу іноземної ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3541', '11', '1',  '152', 'Дебіторська заборгованість за розрахунками за цінними папера' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3542', '11', '1',  '152', 'Дебіторська заборгованість за кредитними операціями' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3548', '11', '1',  '152', 'Дебіторська заборгованість за операціями з іншими фінансовим' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3570', '03', '9',  '152', 'Нараховані доходи за розрахунково-касове обслуговування     ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3578', '03', '9',  '152', 'Iнші нараховані доходи                                      ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3710', '11', '9',  '152', 'Дебетові суми до з''ясування                                ' );

insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3510', '11', '1',  '153', 'Дебіторська заборгованість з придбання активiв              ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3511', '11', '1',  '153', 'Договшрний актив' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3519', '11', '1',  '153', 'Дебiторська заборгованiсть за послуги                       ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3550', '11', '1',  '153', 'Аванси працівникам банку на витрати з відрядження           ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3551', '11', '1',  '153', 'Аванси працівникам банку на господарські витрати            ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3552', '11', '1',  '153', 'Нестачі та інші нарахування на працівників банку            ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '3559', '11', '1',  '153', 'Iнша дебіторська заборгованість за розрахунками з працівника' );

insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9000', '91', '1',  '211', 'Гарантії, що надані банкам                                  ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9001', '91', '1',  '211', 'Підтверджені акредитиви                                     ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9002', '91', '1',  '211', 'Акцепти, що надані банкам                                   ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9003', '91', '1',  '211', 'Авалi, що надані банкам                                     ' );

insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9020', '91', '3',  '211', 'Гарантії, що надані клієнтам                                ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9023', '91', '3',  '211', 'Авалi, що надані клієнтам                                   ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9100', '91', '1',  '212', 'Зобов''язання з кредитування, що надані банкам              ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9122', '91', '1',  '212', 'Зобов''язання' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9129', '91', '3',  '212', 'Iнші зобов''язання з кредитування, що надані клієнтам       ' );

insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9200', '91', '1',  '215', 'Валюта та банківські метали до отримання за умовами спот    ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9201', '91', '1',  '215', 'Валюта та банківські метали до отримання за форвардними конт' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9202', '91', '1',  '215', 'Валюта та банківські метали до отримання за форвардними конт' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9203', '91', '1',  '215', 'Валюта та банківські метали до отримання за опцiонними контр' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9204', '91', '1',  '215', 'Валюта та банківські метали до отримання за опцiонними контр' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9206', '91', '1',  '215', 'Валюта та банківські метали до отримання за ф''ючерсними конт');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9207', '91', '1',  '215', 'Валюта та банківські метали до отримання за ф''ючерсними конт');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9208', '91', '1',  '215', 'Вимоги щодо отримання валюти за валютними своп-контрактами  ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9221', '91', '1',  '215', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9224', '91', '1',  '215', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9228', '91', '1',  '215', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9321', '91', '1',  '215', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9324', '91', '1',  '215', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9328', '91', '1',  '215', '' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9350', '91', '1',  '215', 'Активи до отримання та депозити до розмiщення за спотовими к' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9351', '91', '1',  '215', 'Активи до отримання за форвардними контрактами, що призначен' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9352', '91', '1',  '215', 'Активи до отримання за форвардними контрактами в торговому п' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9353', '91', '1',  '215', 'Активи до отримання за опцiонними контрактами, що призначені' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9354', '91', '1',  '215', 'Активи до отримання за опцiонними контрактами в торговому по' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9356', '91', '1',  '215', 'Активи до отримання за ф''ючерсними контрактами, що призначен');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9357', '91', '1',  '215', 'Активи до отримання за ф''ючерсними контрактами в торговому п');
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9358', '91', '1',  '215', 'Грошовi потоки до отримання за процентними своп-контрактами ' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9359', '91', '1',  '215', 'Активи до отримання за iншими похiдними фiнансовими iнструм.' );
insert into kl_f3_29 (kf, r020, r050, r012, ddd, txt )  values ('6B', '9300', '91', '1',  '219', 'Вимоги за андеррайтингом цiнних паперiв                     ' );

commit;

commit;
end;
/

PROMPT ===================================================================================== 
PROMPT *** End *** ========== Scripts /Sql/BARS/Script/UPD6299_KL_F3_29.sql =========*** End
PROMPT ===================================================================================== 

