[REM Шаблон для друку Прибутково-видаткового касового ордеру]
[REM Згідно Постанови Правління Національного банку України від 14 серпня 2003 року N 337] 
[REM Зареєстровано в Міністерстві юстиції України 5 вересня 2003 р. за N 768/8089]
[REM Із змінами і доповненнями, внесеними постановами Правління Національного банку України]
[REM від 18 лютого 2004 року N 62,  від 21 квітня 2004 року N 173,  від 17 листопада 2004 року N 553,]
[REM від 4 грудня 2004 року N 593,  від 14 червня 2005 року N 211,  від 11 січня]
[REM 2007 року N 2,  від 2 квітня 2007 року N 111]
[REM Додаток 7 до Інструкції про касові операції в банках України]
[REM -----------------------------------------------------------------]
[REM                                                                  ]
[REM Список ссылочных переменных:                                     ]
[REM        ONumber   - Номер документа                               ]
[REM        ODay      - День даты документа                           ]
[REM        OMonth    - Месяц даты документа (словом)                 ]
[REM        OYear     - Год даты документа                            ]
[REM        OPayer    - Имя/Название счета Отправителя                ]
[REM        ONLS-B    - Номер счета Отправителя                       ]
[REM        OCcyISO   - ISO код валюты                                ]
[REM        OCcyCode  - Код валюты НБУ                                ]
[REM        OSumm     - Сумма документа                               ]
[REM        OFSumm     - Сумма документа в грн эквиваленте            ]
[REM        OSumm-B   - Сумма документа во второй валюте              ]
[REM        OFSumm2   - Сумма документа во второй валюте в грн эквив. ]
[REM        OBank-A   - Наименование Банка Получателя                 ]
[REM        OMFO-A    - МФО Банка Получателя                          ]
[REM        OSender   - Имя/Название счета Получателя                 ]
[REM        ONLS-A    - Номер счета Получателя                        ]
[REM        OOKPO-A   - Код ОКПО Получателя                           ]
[REM        OSummLit  - Сумма прописью                                ]
[REM        OFSummLit - Сумма прописью в грн эквиваленте              ]
[REM        OFSummLit2- Сумма прописью во второй валюте в грн эквив.  ]
[REM        ONazn     - Назначение платежа                            ]
[REM        ODocument - Документ                                      ]
[REM        ODocProp  - Выданый                                       ]
[REM        OPAdres   - Адрес                                         ]
[REM        OPBrDate  - Дата рождения                                 ]
[REM -----------------------------------------------------------------]
[REM                                                                  ]
[WIDTH=91][ALIGN=CENTER][LMARGIN=3]M0
- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
[ALIGN=LEFT]GM2        ПРИБУТКОВО-ВИДАТКОВИЙ КАСОВИЙ ОРДЕР N  [REF=ONumber,C,25] H
        -----------
  [REF=ODay,N,2] [REF=OMonth,C,10] [REF=OYear,N,4] р.
 -----------------------
(дата здiйснення операцiї)
Найменування банку  [REF=OMyBankName,C,60]
                   -------------------------------------------------------------------
--------------------------------------------------------------------------------------
| Назва валюти |            |    № рахунку   |       Сума       |   Еквiвалент у     |
|              |            |                |                  |      гривнях       |
--------------------------------------------------------------------------------------
|     [REF=OCcyISO,N,3]      | Дебет      | [REF=ONLS-B,C,14] |   [REF=OSumm,N,12]   | [REF=OFSumm,N,12](980)  |
--------------------------------------------------------------------------------------
|              | Кредит     | [REF=ONLS-A,C,14] |                  |                    |
--------------------------------------------------------------------------------------
| Загальна сума (цифрами)                    |   [REF=OSumm,N,12]   | [REF=OFSumm,N,12](980)  |
--------------------------------------------------------------------------------------
Отримувач/Платник        [REF=DR_FIO,C,80,,TRUE] [REF=DR_OTRIM,C,80,,TRUE]  
(непотрібне закреслити)  -------------------------------------------------------------
#IF [REF=DR_FIO2,C,20]
                   [REF=DR_FIO2,C,160,,TRUE]
               -----------------------------------------------------------------------
#ENDIF

Загальна сума  [REF=OSummLit,C,69]
               -----------------------------------------------------------------------
                                               (словами)
Змiст операцiї  [REF=ONazn,C,160,,TRUE]
               -----------------------------------------------------------------------
Пред'явлений документ  [REF=DR_PASP,C,15,,TRUE] N [REF=DR_PASPN,C,45,,TRUE]
                     -----------------------------------------------------------------
[ALIGN=CENTER]		     (посвідчення, перепустка)
#IF [REF=DR_PASPS,C,45]

[ALIGN=LEFT]Пред'явлений документ  [REF=DR_PASP,C,15,,TRUE] N [REF=DR_PASPS,C,45,,TRUE]
                     -----------------------------------------------------------------
[ALIGN=CENTER]		     (посвідчення, перепустка)
#ENDIF
#IF [REF=UINK_K,N,2]
[ALIGN=LEFT]Кiлькiсть сумок [REF=UINK_K,N,2]( [REF=UINK_KLit,C,20,,TRUE] )
Отримали [REF=UINK_I,C,160,,TRUE]
#ENDIF

[ALIGN=LEFT]Підпис платника/отримувача ____________

[ALIGN=LEFT]Контролер ______________________    Касир ______________________
 
[ALIGN=CENTER]- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

