SET DEFINE OFF;
Insert into BARS.VOB
   (VOB, NAME, FLV, REP_PREFIX)
 Values
   (63, 'Заява на переказ/ видаток депозит я', 1, 'ORDER22');
COMMIT;




SKRN_DOGOVIR	Договір Депозитна скринька
SKRN_ZAYVA	Заява Депозитна скринька
SKRN_DOD1	Додаткова угода  Депозитна скринька(продовження)
SKRN_ZAYVA2	Заява на пролонгацію Депозитна скринька





SKRYNKA_MENU
0	В?дкриття нового договору											
1	Закриття договору											
10	Внесення застави за ключ (без ПДВ)	SKRN		          	SN1	32	SN4		63	6		
12	Повернення застави через кассу	SKRN			                SN2	61	SN5		63	6		
13	Повернення застави на поточний рахунок кл?єнта	SKRN			SN3		SN5		6			
14	Внесення орендної плати	SKRN	                        		SN1	5	SN3	SN3	222	6	6	
15	Внесення орендної плати (безгот?вковий переказ)	SKRN			SN1		SN3	SN3	6	6	6	
18	Пролонгац?я оренди	SKRN	Дата початку нової оренди	оренди	SN1	32	SN3	SN3	222	6	6	
19	Штраф	SKRN	Останн?й день штрафу	                          	SN1	32	SN3	SN3	222	6	6	
21	Орендна плата за пер?од		Дата початку пер?оду	          		32						



