
 
 PROMPT ===================================================================================== 
 PROMPT *** Run *** ========== Scripts /Sql/BARS/function/f_ret_type_r013.sql =========*** Ru
 PROMPT ===================================================================================== 
 
  CREATE OR REPLACE FUNCTION BARS.F_RET_TYPE_R013 (p_fdat in date,      -- звітна дата
                                           p_nbs  in varchar2,  -- балансовий рахунок
                                           p_r013 in varchar2   -- параметр R013
                                          ) return number
is
/*%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
             Допоміжна функція при формуванні #A7

 Повертає тип значення параметра p_r013 для балансового p_nbs

   l_ret =1 -для рахунків нарахованих відсотків, що неотримані до 30 днів
            -для усіх інших рахунків
   l_ret =2 -для рахунків нарахованих відсотків, що неотримані більше 30 днів

%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

05.12.2017   додано перевірку d_open для виключення двійників
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%*/

    l_ret   NUMBER;
begin
    select (case when lower(txt) like '%протягом%30%дн%' then 1
              when lower(txt) like '%понад%30%дн%' then 2
              else 1
            end)
    into l_ret
    from kl_r013
    where trim(prem) = 'КБ' and
          r020 = p_nbs and
          r013 = p_r013 and
          d_open < p_fdat and 
          (d_close IS NULL OR d_close >= p_fdat);

    return l_ret;
exception
    when no_data_found then
         return 1;
end;
/
 show err;
 
 
 
 PROMPT ===================================================================================== 
 PROMPT *** End *** ========== Scripts /Sql/BARS/function/f_ret_type_r013.sql =========*** En
 PROMPT ===================================================================================== 
 