
 
 PROMPT ===================================================================================== 
 PROMPT *** Run *** ========== Scripts /Sql/BARS/function/f_tarif_00f.sql =========*** Run **
 PROMPT ===================================================================================== 
 
  CREATE OR REPLACE FUNCTION BARS.F_TARIF_00F 
                 ( z_cek_  VARCHAR2,     -- Наличие предвар.Заявки ('0'-Да)
                   kv_     INTEGER,      -- валюта операции
                   nls_    VARCHAR2,     -- бух.номер счета
                   s_      NUMERIC )     -- сумма операции
-----------------------------------------------------------------------------
--    Ф-я рассчета суммы комиссии за выдачу нал. ВАЛЮТЫ операцией 00F
--
--   z_cek_  - Наличие предварительной Заявки на выдачу налички
--             ( '0'-Да, '1' - Нет)
-----------------------------------------------------------------------------
RETURN NUMERIC IS
  kod_  integer;    -- код тарифа
  sk_   numeric;    -- расчетная сумма комиссии
BEGIN


  if trim(z_cek_)='0' then
     kod_ :=  112;
  else
     kod_ :=  217;
  end if;


  sk_:=GL.P_ICURVAL( kv_, F_TARIF(kod_,kv_,nls_,s_*100.00)/100, SYSDATE );

  RETURN sk_;

END F_Tarif_00F ;
/
 show err;
 
 
 
 PROMPT ===================================================================================== 
 PROMPT *** End *** ========== Scripts /Sql/BARS/function/f_tarif_00f.sql =========*** End **
 PROMPT ===================================================================================== 
 