

PROMPT ===================================================================================== 
PROMPT *** Run *** ========== Scripts /Sql/BARS/Procedure/MODIFY_FIO.sql =========*** Run **
PROMPT ===================================================================================== 


PROMPT *** Create  procedure MODIFY_FIO ***

  CREATE OR REPLACE PROCEDURE BARS.MODIFY_FIO (p_str in varchar2, p_str_out out varchar2, cust number default 0 )
/*
17.02.2017 додана заміна ` на ', прибрано символ ` при видаленні
09.02.2017 додано параметр cust  - 0 - виконувати п1, 1 - не виконувати п1
09,02,2017 змінено цикл перебору для пошуку [1,!,?]  
08.02.2017 забрав "тире" прибивало подвійні ПІП
           додано заміну укр. подвійних лапок на chr(39)
           уточнено заміну для формату Ф109-ТАЛАНОВА ТЕТЯНА БОГДАНІВНА (після букви два і більше символів не букви)
           додано перевірку  чи є в строці символ … (три крапки) і заміна його на один пробіл
02,02,2017 процедура виправлення даних ПІП згідно заявки № COBUSUPABS-5248 (http://jira.unity-bars.com.ua:11000/browse/COBUSUPABS-5248)         

*/
is
l_nmk varchar2(70);
begin

l_nmk:=p_str;

l_nmk:=REGEXP_REPLACE(l_nmk, '( ){2,}', ' '); --забираємо подвійні пробіли
l_nmk:=trim(l_nmk); ---обрізаємо пробіли зі двох сторін

--insert into TMP_CUST_UPD (rnk,nmk,nmk_new) values (k.rnk,l_nmk,null); --записуємо інформацію до змін
--commit;

--1----------------
case when cust=0 then 
                    begin
                        if REGEXP_LIKE(l_nmk,'^[[:alpha:]]{1}[^[:alpha:]]{2,}') --перевірка на формат Ф109-ТАЛАНОВА ТЕТЯНА БОГДАНІВНА, але якщо 
                                                                    --НЕ букв більше чим дві після букви
                            then
                        --     DBMS_OUTPUT.PUT_LINE('Вирізка букви спочатку було: '||l_nmk);
                             l_nmk:= regexp_replace(l_nmk, '^[[:alpha:]]{1}[^[:alpha:]]{2,}', '', 1, 1, 'i');
                        --     DBMS_OUTPUT.PUT_LINE('Вирізка букви спочатку стало: '||l_nmk);
                        end if;
                   end;
     else null;
end case;               
--2-------------------
if REGEXP_LIKE(l_nmk,'\.+') --перевірка чи в l_nmk є крапки
    then
--    DBMS_OUTPUT.PUT_LINE('Вирізка букви спочатку було: '||l_nmk);
    l_nmk:= translate(l_nmk,'.',' '); --замінити . на 'пробіл'  
--    DBMS_OUTPUT.PUT_LINE('Вирізка букви спочатку стало: '||l_nmk);  
end if;
------ уточнення бек 08,02,2017 року
----select dump ('…') from dual ---Typ=96 Len=1: 133 
if REGEXP_LIKE(l_nmk,'[…]') --перевірки чи є в строці символ … (три крапки)
 then
-- DBMS_OUTPUT.PUT_LINE('Замінити " було: '||l_nmk);
 l_nmk:= translate(l_nmk,'…',' '); --замінити на один пробіл
-- DBMS_OUTPUT.PUT_LINE('Замінити " стало: '||l_nmk);
 end if ;
----------------------------------------
--5-----------------------------------
case when cust=1 then 
                  begin
                       if REGEXP_LIKE(l_nmk,'[^[:alpha:]]{3,}$') then null; --якщо передається значення з тега не SN_LN, н-д SN_MN перевіряємо чи дані не виду ГРИГОР1ВНА :23012003, якщо LIKE - нічого не робимо їх треба вирізати
                          else                                             -- перевіряється чи в кінці три (бо може бути пробіл 0. міняється на 0+пробіл) і більше символа не букви, щоб не зацепити дані виду А. (А і крапка)
                            if REGEXP_LIKE(l_nmk,'0+') --перевірки чи є в строці символ 0
                                    then
                            --        DBMS_OUTPUT.PUT_LINE('Замінити 0 на O було: '||l_nmk);
                                    l_nmk:= translate(l_nmk,'0','О'); --замінити 0 на O (Змінити всі нулі на букву кирилиці "О")
                            --        DBMS_OUTPUT.PUT_LINE('Замінити 0 на O стало: '||l_nmk);
                            end if;
                        end if;
                  end;
     else null;
end case;                    
--------------------------------------
--3----------------------------------
if REGEXP_LIKE(l_nmk,'[^[:alpha:]]+$') ---перевірка чи в кінці стоять не букви
        then
--        DBMS_OUTPUT.PUT_LINE('Видалення всіх НЕ букв з кінця до першої букви було: '||l_nmk);
        l_nmk:= REGEXP_REPLACE(l_nmk, '[^[:alpha:]]+$', '', 1, 1, 'i'); -- видалення всіх не букв з кінця
--        DBMS_OUTPUT.PUT_LINE('Видалення всіх НЕ букв з кінця до першої букви стало: '||l_nmk);  
end if;

------5 --------------------------
if REGEXP_LIKE(l_nmk,'0+') --перевірки чи є в строці символ 0
    then
--DBMS_OUTPUT.PUT_LINE('Замінити 0 на O було: '||l_nmk);
l_nmk:= translate(l_nmk,'0','О'); --замінити 0 на O (Змінити всі нулі на букву кирилиці "О")
--DBMS_OUTPUT.PUT_LINE('Замінити 0 на O стало: '||l_nmk);
end if;
--6----------------------------------
--6)    Замінити «*» або «/» або « ”», що зустрічаються в середині слова, на апостроф;
if REGEXP_LIKE(l_nmk,'[*]+')   --перевірки чи є в строці символ *
 then
-- DBMS_OUTPUT.PUT_LINE('Замінити * було: '||l_nmk);
 l_nmk:= translate(l_nmk,'*',chr(39));
-- DBMS_OUTPUT.PUT_LINE('Замінити * стало: '||l_nmk);
 end if ;
if REGEXP_LIKE(l_nmk,'[/]+')  --перевірки чи є в строці символ /
 then
-- DBMS_OUTPUT.PUT_LINE('Замінити / було: '||l_nmk);
 l_nmk:= translate(l_nmk,'/',chr(39));
-- DBMS_OUTPUT.PUT_LINE('Замінити / стало: '||l_nmk);
 end if ;
 --select dump ('”') from dual --Typ=96 Len=1: 148 анг. подвійні кавички
if REGEXP_LIKE(l_nmk,'[”]+') --перевірки чи є в строці символ "
 then
-- DBMS_OUTPUT.PUT_LINE('Замінити " було: '||l_nmk);
 l_nmk:= translate(l_nmk,'”',chr(39));
-- DBMS_OUTPUT.PUT_LINE('Замінити " стало: '||l_nmk);
 end if ;
-- select dump ('"') from dual --Typ=96 Len=1: 34 укр. подвійні кавички
if REGEXP_LIKE(l_nmk,'["]+') --перевірки чи є в строці символ "
 then
-- DBMS_OUTPUT.PUT_LINE('Замінити " було: '||l_nmk);
 l_nmk:= translate(l_nmk,'"',chr(39));
-- DBMS_OUTPUT.PUT_LINE('Замінити " стало: '||l_nmk);
 end if ;
 
if REGEXP_LIKE(l_nmk,'[`]+') --перевірки чи є в строці символ `
 then
-- DBMS_OUTPUT.PUT_LINE('Замінити " було: '||l_nmk);
 l_nmk:= translate(l_nmk,'`',chr(39));
-- DBMS_OUTPUT.PUT_LINE('Замінити " стало: '||l_nmk);
 end if ;
--------------------------------------
--7-----------------------------------
--7)    Змінити вказані літери англійського алфавіту на літери українського алфавіту:
if REGEXP_LIKE(l_nmk,'[IETOPAHKXCBM]+') --- для UPPER
then
  l_nmk:= translate(l_nmk,'IETOPAHKXCBM','ІЕТОРАНКХСВМ');
--  DBMS_OUTPUT.PUT_LINE('IETOPAHKXCBM: '||l_nmk);
end if;
--закомічено 01,02,2017 року по рекомендації ДІТ 
--if REGEXP_LIKE(l_nmk,'[ietopahkxcbm]+') --- для LOWER деякі букви можна викинути
--then
--  l_nmk:= translate(l_nmk,'ietopahkxcbm','іеторанкхсвм');
--  DBMS_OUTPUT.PUT_LINE('ietopahkxcbm: '||l_nmk);
--end if;
/*****************П.4 ******************************************************
4)    Змінити всі знайдені: 1 або "!" або "?" на:
-    букву кирилиці "І", якщо вони стоять після приголосної букви, або на початку слова;
-    букву кирилиці "Ї", якщо вони стоять після голосної букви
*/
if  regexp_LIKE(l_nmk, '[1!?]+') then
 begin
  --for i in 1..regexp_count(l_nmk,'[1,!,?]+') --к-ть входжень символів --прописати l_nmk
  while regexp_LIKE(l_nmk, '[1!?]+') --поки слово містить 1,!,?
    loop
--      dbms_output.put_line('П.4 Заміна всіх знайдених 1,!,? вхідне ПІП: '||l_nmk);
      ---------------------для 1---------------
      if regexp_instr(l_nmk,'1') <>0 -- є будь-яке вжодження 1(одиниці) в строку
         then
           if regexp_instr(l_nmk,'1') =1  --якщо це входження перше (на першій позиції. стрічка починається з символу)
              then 
                l_nmk:=regexp_replace(l_nmk, '^.{1}', 'І'); --замінити будь-який символ, який стоїть першим на І 
             else
            --якщо входження не перше
            --'а','є','є','и','і','ї','о','у','ю','я'
               if substr(l_nmk,regexp_instr(l_nmk,'1')-1,1) in ('а','А','е','Е','є','Є','и','И','і','І','ї','Ї','о','О','у','У','ю','Ю','я','Я') --якщо попередня голосна
                 then 
                   begin
                      --якщо попередня голосна, вираховуємо її АSCII код. Якщо буква велика міняємо на велику, якщо ні, то на маленьку
                     case 
                         when ASCII(substr(l_nmk,regexp_instr(l_nmk,'1')-1,1)) in (192,197,170,200,178,175,206,211,222,223) 
                           then l_nmk:=regexp_replace(l_nmk,'[1]', 'Ї', 1, 1, 'i');
                                else l_nmk:=regexp_replace(l_nmk,'[1]', 'ї', 1, 1, 'i'); --міняємо перше входження "1" на і маленьку
                     end case;
                     end;
                 else 
                   begin
                   case
                      --якщо попередня буква велика або пробіл (' ') міняємо перше входження на велику І
                      when ASCII(substr(l_nmk,regexp_instr(l_nmk,'1')-1,1)) in (193,194,195,165,196,198,51,201,202,203,204,205,207,208,209,210,212,88,214,215,216,217,32)
                         then l_nmk:=regexp_replace(l_nmk,'[1]', 'І', 1, 1, 'i');
                           else l_nmk:=regexp_replace(l_nmk,'[1]', 'і', 1, 1, 'i'); --міняємо перше входження "1" на і  (маленьку) --replace('апм1ва1','.{||regexp_instr('1апм1ва1','1')||}','і' )   --- якщо попередній символ приголосна - заміняємо на "і"
                    end case; 
                   end;
               end if;
             end if;
      end if;
      -----------------------для ! ---
  if regexp_instr(l_nmk,'!') <>0 -- є будь-яке вжодження !(знака оклику) в строку
         then 
           if regexp_instr(l_nmk,'!') =1  --якщо це входження перше (на першій позиції. стрічка починається з символу)
              then 
                l_nmk:=regexp_replace(l_nmk, '^.{1}', 'І'); --замінити будь-який символ, який стоїть першим на І 
             else
            --якщо входження не перше
            --'а','є','є','и','і','ї','о','у','ю','я'
               if substr(l_nmk,regexp_instr(l_nmk,'!')-1,1) in ('а','А','е','Е','є','Є','и','И','і','І','ї','Ї','о','О','у','У','ю','Ю','я','Я') --якщо попередня голосна
                 then 
                   begin
                      --якщо попередня голосна, вираховуємо її АSCII код. Якщо буква велика міняємо на велику, якщо ні, то на маленьку
                     case 
                         when ASCII(substr(l_nmk,regexp_instr(l_nmk,'!')-1,1)) in (192,197,170,200,178,175,206,211,222,223) 
                           then l_nmk:=regexp_replace(l_nmk,'[!]', 'Ї', 1, 1, 'i');
                                else l_nmk:=regexp_replace(l_nmk,'[!]', 'ї', 1, 1, 'i'); --міняємо перше входження "!" на і маленьку
                     end case;
                     end;
                 else 
                   begin
                   case
                      --якщо попередня буква велика або пробіл (' ')
                      when ASCII(substr(l_nmk,regexp_instr(l_nmk,'!')-1,1)) in (193,194,195,165,196,198,51,201,202,203,204,205,207,208,209,210,212,88,214,215,216,217,32)
                         then l_nmk:=regexp_replace(l_nmk,'[!]', 'І', 1, 1, 'i');
                           else l_nmk:=regexp_replace(l_nmk,'[!]', 'і', 1, 1, 'i');
                    end case; --міняємо перше входження "!" на і  (маленьку) --replace('апм1ва1','.{||regexp_instr('1апм1ва1','1')||}','і' )   --- якщо попередній символ приголосна - заміняємо на "і"
                   end;
               end if;
             end if;
      end if;

      ---------------------------для ?--------
   if regexp_instr(l_nmk,'\?') <>0 -- є будь-яке вжодження ? в строку
         then 
           if regexp_instr(l_nmk,'\?') =1  --якщо це входження перше (на першій позиції. стрічка починається з символу)
              then 
                l_nmk:=regexp_replace(l_nmk, '^.{1}', 'І'); --замінити будь-який символ, який стоїть першим на І 
             else
            --якщо входження не перше
            --'а','є','є','и','і','ї','о','у','ю','я'
               if substr(l_nmk,regexp_instr(l_nmk,'\?')-1,1) in ('а','А','е','Е','є','Є','и','И','і','І','ї','Ї','о','О','у','У','ю','Ю','я','Я') --якщо попередня голосна
                 then 
                   begin
                      --якщо попередня голосна, вираховуємо її АSCII код. Якщо буква велика міняємо на велику, якщо ні, то на маленьку
                     case 
                         when ASCII(substr(l_nmk,regexp_instr(l_nmk,'\?')-1,1)) in (192,197,170,200,178,175,206,211,222,223) 
                           then l_nmk:=regexp_replace(l_nmk,'[?]', 'Ї', 1, 1, 'i');
                                else l_nmk:=regexp_replace(l_nmk,'[?]', 'ї', 1, 1, 'i'); --міняємо перше входження "?" на і маленьку
                     end case;
                     end;
                 else 
                   begin
                   case
                      --якщо попередня буква велика або пробіл (' ')
                      when ASCII(substr(l_nmk,regexp_instr(l_nmk,'\?')-1,1)) in (193,194,195,165,196,198,51,201,202,203,204,205,207,208,209,210,212,88,214,215,216,217,32)
                         then l_nmk:=regexp_replace(l_nmk,'[?]', 'І', 1, 1, 'i');
                           else l_nmk:=regexp_replace(l_nmk,'[?]', 'і', 1, 1, 'i');
                    end case; --міняємо перше входження "?" на і  (маленьку) --replace('апм1ва1','.{||regexp_instr('1апм1ва1','1')||}','і' )   --- якщо попередній символ приголосна - заміняємо на "і"
                   end;
               end if;
             end if;
      end if;
--------------------------------
    end loop;
 end;
end if;
-- dbms_output.put_line('П.4 Заміна всіх знайдених 1,!,? вихідне ПІП: '||l_nmk);
/***********************************************************************/
---------------------------------------------------------
if REGEXP_LIKE(l_nmk,'[0-9]+') --- перевірка чи строчка містить цифри
then
--  DBMS_OUTPUT.PUT_LINE('Заміна всіх цифр, які лишилися на "_" було: '||l_nmk);
  l_nmk:= REGEXP_REPLACE(l_nmk, '[0-9]+', '_'); -- заміна всіх цифр, які лишилися на "_" (підкреслення)
--  DBMS_OUTPUT.PUT_LINE('Заміна всіх цифр, які лишилися на "_" стало: '||l_nmk);
end if;
--DBMS_OUTPUT.PUT_LINE('---------------------------------------------------------');

/**************************************уточнення ДІТ 01,02,2017****************************************************************/
--повторно для кожного ПІП робимо обрізку пробілів, які могли виникнути в процесі перетворень, н-д: було замінено ..(дві крапки) на пробіли.
l_nmk:=REGEXP_REPLACE(l_nmk, '( ){2,}', ' '); --забираємо подвійні пробіли
l_nmk:=trim(l_nmk); ---обрізаємо пробіли з двох сторін


--в кінцевому варіанті забрати всі не букви з ПІП, лишити треба '(апостроф)(міняли на нього вище) та "_" (нижнє підкреслення), як сказано в алгоритмі "Заміна всіх цифр, які лишилися на --"_"
--приклади:
--select REGEXP_REPLACE('"!,#,$,%,&,(,),*,wqe+,,,-,.,/,:,;,<,=,>,?,@,[,\,],^,`,{,|,},~asd\!,#$\!,#$%&()/*+.-[-\!,$%&()/*+.:;=<>@?\[{}#~\^\|`', '[-\!,$%&()/*+.:;=<>@?\[{}#~\^\|`"]+', '') from dual;
--select REGEXP_REPLACE('wqe]a]]]]s]d', ']', '') from dual; 
 
-- міняємо в строці всі символи на пробіл (задача ставилася їх видалити), бо якщо прибрати може бути випадок Марія<Іванівна отримаємо МаріяІванівна а це погано
--забрали - (тире) (08.02.2017)
if REGEXP_LIKE(l_nmk, '[\№!,$%&()/*+.:;=<>@?\[{}#~\^\|"]+') or REGEXP_LIKE(l_nmk, ']')
then  
    l_nmk:=REGEXP_REPLACE(l_nmk, '[\№!,$%&()/*+.:;=<>@?\[{}#~\^\|"]+', ' ');
    l_nmk:=REGEXP_REPLACE(l_nmk, ']', ' '); --дозаміняємо ] на пробіл оскільки видалення ] відсутнє в шаблоні зверху (при додаванні ламало шаблон)
end if;

----------------------------------------
--повторно для кожного ПІП робимо обрізку пробілів, які могли виникнути в процесі перетворень, н-д: було замінено №№ на пробіли.
l_nmk:=REGEXP_REPLACE(l_nmk, '( ){2,}', ' '); --забираємо подвійні пробіли
l_nmk:=trim(l_nmk); ---обрізаємо пробіли з двох сторін
/*---------------------------------------------------------------------------*/
p_str_out:=l_nmk;

end;
/
show err;



PROMPT ===================================================================================== 
PROMPT *** End *** ========== Scripts /Sql/BARS/Procedure/MODIFY_FIO.sql =========*** End **
PROMPT ===================================================================================== 
