

PROMPT ===================================================================================== 
PROMPT *** Run *** ========== Scripts /Sql/BARS/Procedure/P_F6B_ND.sql =========*** Run *** 
PROMPT ===================================================================================== 


PROMPT *** Create  procedure P_F6B_ND ***

  CREATE OR REPLACE PROCEDURE BARS.P_F6B_ND (Dat_ DATE)  IS
/*%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% DESCRIPTION :	Процедура формирования #6B для схема "D" 
% COPYRIGHT   :	Copyright UNITY-BARS Limited, 1999.  All Rights Reserved.
% VERSION     : 16.01.2017
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
  параметры: Dat_ - отчетная дата
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%*/
begin
   p_f6B_NN (Dat_, 'D');
end;
/
show err;

PROMPT *** Create  grants  P_F6B_ND ***
grant EXECUTE                                                                on P_F6B_ND        to RPBN002;



PROMPT ===================================================================================== 
PROMPT *** End *** ========== Scripts /Sql/BARS/Procedure/P_F6B_ND.sql =========*** End *** 
PROMPT ===================================================================================== 
