

PROMPT ===================================================================================== 
PROMPT *** Run *** ========== Scripts /Sql/BARS/Procedure/P_FC9_NN.sql =========*** Run *** 
PROMPT ===================================================================================== 


PROMPT *** Create  procedure P_FC9_NN ***

  CREATE OR REPLACE PROCEDURE BARS.P_FC9_NN (dat_      DATE,
                                           sheme_    VARCHAR2 DEFAULT 'G')
IS
   /*%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
   % DESCRIPTION : Процедура формирования #C9 для КБ
   % COPYRIGHT   : Copyright UNITY-BARS Limited, 1999.  All Rights Reserved.
   % VERSION     : 16/03/2016 (11/08/2015, 19/02/2015, 31/10/2014)
   %             : (по версии 06.09.2007 из УПБ)
   %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
   параметры: Dat_ - отчетная дата
              sheme_ - схема формирования

   Внимание !!!   Данная версия работает только в банке УПБ и доп.параметры
                  обрабатываем D1#C9 - "код мети надходження" (классификатор
                  KOD_C9_1) и D2#70 - DC#70.
                  Нужен доп.пармаметр DC#70 - номер ВМД.%
   %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
   16.03.2016 с 21.03.2016 (на 22.03.2016) закрывается показатель 41NNN
   11.08.2015 для всех РУ СБ при формировании будут включаться проводки
              Дт 1500, 1600, 3720, 3739, 3900, 2909
              Кт 2520,2530,2541,2542,2544,2545
   19.02.2015 для кода 36 мети переказу сумму для обязательной продажи
              определяем из поля S2 табл. ZAYAVKA и при отсутствии как ранее
   31.10.2014 для Ивано-Франковска 336503 включаем проводки
              Дт 2909 Кт 2603, 2620, 2625
   10.10.2014 для кода меты 36 будем формировать показатель для суммы 20NNNN
              не 75% от суммы а 100%
   22.09.2014 добавлен новый блок всех показателей с кодом мети '36'
   15.09.2014 для УПБ будут включаться проводки Дт 3739 Кт 2603
   04.09.2014 для Петрокоммерца будут включаться проводки Дт 1919 Кт 2603
              т.к. с 01.09.2014 100% объязательная продажа формирование
              переменной S_NOM_2603 будет формироваться до 31.08.2014
   02.09.2014 для Петрокоммерца будут включаться проводки Дт 1500 Кт 2603
   15.08.2014 для Петрокоммерца добавлены проводки Дт 1919,3720 Кт 2924
   09.04.2014 включались суммы док-тов >=1001$ а необходимо 1000.01$ и больше
   03.04.2014 будут отбираться суммы документов строго больше 1000$
   31.03.2014 для условия IF nlsk_ like '2603%' and nls_ like '2900%'
              добавлено условие ROWNUM = 1 (была ошибка в Петрокоммерце)
   25.03.2014 исключаем обработку доп.рек. 57A и добавляем обработку 50F
   20.03.2014 для Черновцов 356334 будем отбирать проводки
              Дт 3739 Кт 290969015
   03.03.2014 по просьбе для Черновцов 356334 возвратил отбор проводок
              Дт 3739 Кт 29090100250000 и убрал добавленные новые
   27.02.2014 для ГОУ не включаем проводки Дт 1500,1600 Кт 37396506
   26.02.2014 для Черновцов 356334 не удалаяем проводки Дт 29090100250000
              Кт любой
   25.02.2014 для Черновцов 356334 будем включать проводки
              Дт 2603 Кт 2600, 2620,2650,2909(обязательная продажа)
   21.02.2014 для проводок Дт 2603 Кт 2900 (обязательная продажа)
              не включались суммы <1000.00$ а общая сумма перевода >=1000.00
   20.02.2014 для Черновцов 356334 не будем включать проводки
              Дт 3739 Кт 29090100250000
   19.02.2014 для физлиц резидентов не имеющих ОКРО определяем серию и номер
              паспорта
   13.02.2014 будут включаться док-ты с суммой не менее 1000.00$
   08.01.2014 для ГОУ добавлены проводки Дт 1500,1600  Кт 37396506 для чеків
   18.10.2013 для ГОУ добавлены проводки Дт 1500,1600  Кт 373960365
   17.10.2013 корректировка комментария
   21.08.2013 дополнительно обрабатываем доп.реквизиты док-тов "n" - код
              країни Платника/Отримувача и другие доп.реквизиты
              предназначенные для кода страны
   19.08.2013 для Петрокоммерца не будут включаться все проводки
              Дт 2909 Кт 2909 а только Дт 2909400129 Кт 2909
   15.08.2013 для проводок объязательной продажи (Дт 2603 Кт 2900)
              сумму проводки формируем с кодом 20NNN и все остальные
              показатели не формируем. Код NNN формируем такой же как и для
              проводки Дт 2603 Кт 2600 (суммы проводок совпадают).
              Если проводка Дт 2603 Кт 2600 с такой суммой не существует то
              формируем все показатели по этому документу.
   26.07.2013 код страны поступления валюты еще будем определять
              по TAG='50F' и в значении проверяем символа 'UA'
              (не будем включать валютные переводы по Украине)
   27.05.2013 код 40 для указанных ниже проводок будет иметь значение "29"
   26.05.2013 для ГОУ добавлены проводки Дт 1500,1600 Кт 3739 (различные
              счета для переводов и коммисий)
   22.03.2013 для Демарка добавлены проводки Дт 3720 Кт 2909
   21.03.2013 для ГОУ (300465) добавил обработку проводок Дт 3739 - Кт 2603
              и исключаем проводки Дт 2603 - Кт 2600
   14.12.2012 для Петрокоммерца (300120) будем включать не все проводки
              Дт 1500 Кт 3540, а только Дт 1500 Кт 3540020153901
   10.12.2012 для Петрокоммерца добавлены проводки Дт 1500 Кт 2909 и не
              2909400129, Дт 1500 Кт 3540020153901, Дт 1500 Кт 3660
   29.11.2012 для Петрокоммерца добавлены проводки Дт 2909,3720 Кт 2909
   23.11.2012 для отбора из перечня счетов по Дт убрал счет 2603 и добавил
              данный счет по Кт т.к. с 21.11.2012 введена 50% обязательная
              продажа валюты и проводки Дт 2603 Кт 2600,2620 не должны
              включаться
   30.08.2012 для определения кода территории убрал условие "sheme_ = 'G'"
   11.08.2012 для ОПЕРУ СБ не включаем проводки Дт 3739 Кт 2924
   06.08.2012 для сумм комиссий включаем проводки Дт 1500,1600 Кт 60*,610*,
              611* (письмо Рощиной от 11.07.2012)
   30.07.2012 для 300465 вместо кода мети надходження 09 формируем 30.
              (письмо Рощиной от 11.07.2012)
              Если назначение "розрахунки за чеками" то код мети "09"
   29.09.2011 c 01/09/2011 код 62 формируем из параметра KOD_G
              и если пустой то из параметра D6#C9
   21.07.2011 для банка Демарк(353575) будем включать Дт1500-Кт3800
              назначение 'конверсия'
   25.06.2011 для банка Петрокоммерц(300120) будем включать Дт1919-Кт2600,
              2620,2650,2909
   13.05.2011 по предложению Запорожья СБ (313957) удалаяем проводки
              Дт 3739 Кт 2909 и OB22='66' для всех облуправлений СБ
   26.01.2011 изменил сумму с 100 на 1 т.к. у Демарка была сумма в
              эквиваленте меньше 100
   24.12.2010 для банка 313957 (Запорожье СБ) будем включать проводки
              Дт 3739 Кт 29091100070000
              (почему-то данное условие было закомментировано)
   13.12.2010 для Iвано-Франкiвська ОБ (336503) будемо включати проводки
              Дт 29098100080000 Кт 2909 .....56 (24), 2620, 2603*
              не будем включать Дт 2909 .....54 (24) Кт 2620
                                Дт 2603              Кт 2600
   15.11.2010 внесены изменения выполненные 20.09.2010
   26.10.2010 исключил для зачисления бал.счета 2630, 2635
   19.10.2010 для Рiвне ОБ (333368) будемо включати проводки
              Дт 29099100170000 Кт 2620
              не будем включать Дт 2909 (не равен 29099100170000) Кт 2620
   14.10.2010 для Крима ОБ (324805) будемо включати проводки
              Дт 29093000110000 Кт 2909 .....56 (24), 2603*
              не будем включать Дт 2909 ....54 Кт 2620
                                Дт 2603        Кт 2600
              для Рiвне ОБ (333368) будемо включати проводки
              Дт 29099100170000 Кт 2909 .....56 (24), 2603*
              не будем включать Дт 2909 ....54 Кт 2620
                                Дт 2603        Кт 2600
   20.09.2010 для заполненного параметра "de#c9" - надходження вiдповiдно до
              платiжного календаря не будем изменять его на 999
              для б/с отличных от 1522,1523,1524,1525,1621,1623,1624
              (замечание Демарка)
   07.09.2010 для банка 313957 (Запорожье СБ) будем вклюбчать проводки
              Дт 3739 Кт 29091100070000
   31.08.2010 для банка УПБ(300205) будем включать Дт1500-Кт1819,3540 и
              назначение платежа "конв" или 'net'
   16.08.2010 для ОПЕРУ ОБ будемо включати проводки вида Дт1600 - Кт 18199
   27.07.2010 для ОПЕРУ ОБ будемо включати проводки
              Дт 1500,1600 Кт 2909003101,29092000040557
   22.07.2010 для Чернiицi ОБ будемо включати проводки
              Дт 3739 Кт 29020100250000
   22.07.2010 для счетов  37394501547,37391006,373990351, 29096000541557
              значение показателя 31 формируем '006', показателя 40 - '09'
   16.07.2010 для ОПЕРУ СБ добавлены проводки вида Дт 1500,1600
              Кт 37394501547,37391006,373990351,
                 29096000541557, 29095000046547,29095000081557
   03.06.2010 для УПБ (300205) добавил поводки вида  Дт2602,3720  Кт2603
   31.05.2010 по просьбе банка УПБ не включаем проводки Дт2603-Кт2600
   25.05.2010 для УПБ (300205) добавил проводки вида  Дт1500,1600  Кт2603
   21.05.2010 для облуправлений Ощадбанка исключаем операцию "024" если
              Дт 3739  Кт 2600,2602,2620,2625,2630,2635,2650,2924
   02.03.2010 для облуправлений Ощадбанка исключаем операцию "АСВ"(русские)
   25.02.2010 исключил проводки вида  Дт1500,3720,3739,3900,2909  Кт2603
   24.02.2010 для банка Демарк 353575 будем включать проводки Дт1500-Кт6 кл.
   22.02.2010 дополнительно определяем код страны по SWIFT_CODE
              по доп.реквизитам 57A, 52A
   15.02.2010 для облуправлений Ощадбанка исключаем операцию "024"
   12.02.2010 для банка ОПЕРУ СБ будем включать Дт1500-Кт3540 и назначение
              платежа "конв" или 'net'
   12.01.2010 для банка ОПЕРУ СБ будем включать Дт1500-Кт1819 и назначение
              платежа "конв"
   11.01.2010 для банка ОПЕРУ СБ будем включать Дт1500-Кт1819
   17.11.2009 по просьбе банка Столица не включаем проводки Дт1500-Кт2924
              и будем включать Дт1500-Кт1819
   04.11.2009 по просьбе Житомира ОБ добавил обработку проводок вида
              Дт 3739 - Кт2909
   28.10.2009 по просьбе Петрокоммерца добавила обработку проводок вида
              д2603-к2900
   27.10.2009 по просьбе Житомира ОБ добавил обработку проводок вида
              Дт 3720,2909- Кт2603
   23.10.2009 по просьбе Демарка добавил обработку проводок вида д3720-к1819
              только для МФО=353575
   21.10.2009 по просьбе УПБ добавила обработку проводок вида д1500-к2809
              (зарахування покриття по WESTERN UNION)
   04.09.2009 для ОПЕРУ СБ удалаяем проводки вида Дт 1500 Кт 1600,
              Дт 1600 Кт 1600
   13.08.2009 для клиентов БАНКИ определяем код банка поле GLB из RCUKRU
              по IKOD=коду ОКПО
   03.08.2009 код NNN (условный порядковий номер) формировался не сквозной
              т.к. выбирался код страны не "804" и не "UKR"
              замечание Демарка
   30.07.2009 для МФО=300465 не включаем проводки Дт 1500 Кт 1600
   29.07.2009 для кода "99" будем формировать назначение платежа только для
              МФО=300465
   27.07.2009 для ОПЕРУ СБ указан перечень счетов для которых формируем
              определенные коды "мети переказу"
   25.07.2009 для Демарка добавил проводки Дт 1500 Кт 1819 (покрытие денежных
              переводов)
   23.06.2009 для ОПЕРУ СБ добавила проводки Дт 1500 Кт 2909 (клиринговые расчеты)
   16.06.2009 для ОПЕРУ СБ убрал отбор проводок Дт 1500 Кт 1819 опер. FX3,F02
   10.06.2009 изменен блок формирования кода ОКПО
              для ФЛ предпринимателей код ОКПО формировался 8 симв. вместо 10
              (обнаружилось в Ровно СБ). Исправлено 16.06.2009
   05.06.2009 для ОПЕРУ СБ выбираем проводки Дт 1500 Кт 1819 операции FX3,F02
   04.06.2009 для Ровно СБ исключаем проводки Дт 3739 Кт 2620
   24.05.2009 с 01.06.2009 добавляется новый код 41-"код надходження вiдповiдно
              до платiжного календаря"
              и не должны формироваться коды 51,52,69,60,70.
   19.02.2009 добавил для наполнения TMP_NBU перечень полей
   18.09.2008 изменил формирование показателей 40, 60, 99 (аналогично как
              для файла #E2)
   10.09.2008 для Кт счета добавили бал.счет 2924
   05.08.2008 формировался ошибочно только один показатель код "35NNN",
              а другие показатели не формировались. Исправил.
   30.07.2008 по замечанию банка Демарк изменил условие для строки 467
   07.02.2008 для УПБ убираем проводки Дт 1500 Кт 2602, Дт 2602 Кт 2603
   20.11.2007 будем обрабатывать доп.параметры DD#70 - вiдомостi про операцiю
              и формировать код "99"
   до 13.08.07 в файл #C9 включалась сумма поступления от нерезидентов
               100 тыс.долларов общая по клиенту, а
               с 13.08.2007 50 тыс.долларов только одной операции
   01.06.06 по просьбе Петрокоммерц для поступ. от нерезид. код '3' включен
            в перечень счетов Дт б/с 3739
   16.06.06 по просьбе Сбербанка для файла #C9 не будут включаться проводки,
            если код страны перечисления валюты 804 (доп.реквизит D6#70)
   29.06.2006 для файлов #70 и #C9 с 03.07.06 добавляется новый показатель
              "70" - код товарної групи
   17.04.2007 добавляем ведущие нули для кода ОКПО (до 8 символов для ЮЛ,
              до 10 символов для ФЛ (показатель 31XXX))
   26.04.2007 добавлен счет 1600 (по дебету) для "надходження валюти вiд
              нерезидентiв" по замечанию банка УПБ
   11.06.2007 код банка при отсутствии в RC_BNK определяем как <код страны+
              '0000000' и название страны выбираем из поля BENEFBANK табл.
              TOP_CONTRACTS
   01.08.2007 для файла #70 если код мети (D1#70=('03','07)), то показатели
              65,66 должны заполняться "0".
   05.10.2007 Если платеж(сумма док-та в OPER) по нескольким контрактам, то
              выбираем максимальный ID из CONTRACT_P и максимальный ID
              из TAMOZHDOC.
   %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%*/
   kodf_        VARCHAR2 (2) := 'C9';
   sql_z        VARCHAR2 (200);
   typ_         NUMBER;
   --для покупки
   gr_sum_      NUMBER := 5000000;
   -- для продажу i надходження вiд нерезидентiв
   gr_sumn_     NUMBER := 5000000;              --до 13.08.2007 было 10000000;
   sum_kom      NUMBER;                                -- сума комiciї 100000$
   flag_        NUMBER;
   -- флаг для определения наличия поля BENEFCOUNTRY т.TOP_CONTRACTS
   -- (из модуля биржевые операции)
   pr_s3_       NUMBER;   -- флаг для определение наличия поля S3 табл.ZAYAVKA
   -- (из модуля биржевые операции)
   s3_          NUMBER;
   ko_          VARCHAR2 (2);     -- ознака операцii з безготiвковою iнвалютою
   ko_1         VARCHAR2 (2);     -- ознака операцii з безготiвковою iнвалютою
   kod_b        VARCHAR2 (10);                         -- код iноземного банку
   nam_b        VARCHAR2 (70);                       -- назва iноземного банку
   -- кол-во доп.параметров до 03.07.2006 после n_=11
   n_           NUMBER := 10;
   acc_         NUMBER;
   accd_        NUMBER;
   kv_          NUMBER;
   kv1_         NUMBER;
   nls_         VARCHAR2 (15);
   nls1_        VARCHAR2 (15);
   nlsk_        VARCHAR2 (15);
   nlsk1_       VARCHAR2 (15);
   nbuc1_       VARCHAR2 (12);
   nbuc_        VARCHAR2 (12);
   country_     VARCHAR2 (3);
   b010_        VARCHAR2 (10);
   bic_code     VARCHAR2 (14);
   rnk_         NUMBER;
   okpo_        VARCHAR2 (14);
   ourOKPO_     VARCHAR2 (14);
   ourGLB_      VARCHAR2 (3);
   nmk_         VARCHAR2 (70);
   adr_         VARCHAR2 (70);
   k040_        VARCHAR2 (3);
   k110_        VARCHAR2 (5);
   nd_          VARCHAR2 (10);
   val_         VARCHAR2 (70);
   d1#C9_       VARCHAR2 (70);
   d2#C9_       VARCHAR2 (70);
   d3#C9_       VARCHAR2 (70);
   d4#C9_       VARCHAR2 (70);
   d6#C9_       VARCHAR2 (70);
   dc#C9_       VARCHAR2 (70);
   dc#C9_max    VARCHAR2 (70);
   dc1#C9_      VARCHAR2 (70);
   d99#C9_      VARCHAR2 (170);
   de#C9_       VARCHAR2 (3);
   nazn_        VARCHAR2 (160);
   kol_99       NUMBER;
   kod_g_       VARCHAR2 (3);
   a1_          VARCHAR2 (70);
   a2_          VARCHAR2 (70);
   a3_          VARCHAR2 (70);
   a4_          VARCHAR2 (70);
   a5_          VARCHAR2 (70);
   a6_          VARCHAR2 (70);
   a7_          VARCHAR2 (70);
   nb_          VARCHAR2 (70);
   tg_          VARCHAR2 (70);
   data_        DATE;
   dig_         NUMBER;
   bsum_        NUMBER;
   bsu_         NUMBER;
   sum1_        DECIMAL (24);
   sum0_        DECIMAL (24);
   sumk1_       DECIMAL (24);                --ком_с_я в ц_лому по контрагенту
   sumk0_       DECIMAL (24);                           --ком_с_я по контракту
   kodp_        VARCHAR2 (10);
   znap_        VARCHAR2 (70);
   kurs_        NUMBER;
   tag_         VARCHAR2 (5);
   nnnn_        NUMBER := 0;
   nnnn1_       NUMBER := 0;
   userid_      NUMBER;
   ref_         NUMBER;
   refd_        NUMBER;
   refd1_       NUMBER;
   rez_         NUMBER;
   codc_        NUMBER;
   mfo_         NUMBER;
   mfou_        NUMBER;
   pid_         NUMBER;
   id_          NUMBER;
   name_        VARCHAR2 (70);
   datedoc_     VARCHAR2 (10);
   swift_k_     VARCHAR2 (12);
   ser_         person.ser%TYPE;
   numdoc_      person.numdoc%TYPE;
   s_nom_2603   NUMBER;
   dat_Izm1_  DATE := TO_DATE('18032016','ddmmyyyy'); -- закривається показник
                                                      -- 41000

   --курсор по контрагентам
   CURSOR c_main
   IS
        SELECT t.ko,
               c.rnk,
               c.okpo,
               c.nmk,
               TO_CHAR (c.country),
               c.adr,
               NVL (c.ved, '00000'),
               c.codcagent,
               SUM (t.s_eqv),
               SUM (gl.p_icurval (t.kv, t.s_kom, dat_))
          --сумма в формате грн.коп
          FROM otcn_f70_temp t, customer c
         WHERE t.rnk = c.rnk
      GROUP BY t.ko,
               c.rnk,
               c.okpo,
               c.nmk,
               TO_CHAR (c.country),
               c.adr,
               NVL (c.ved, '00000'),
               c.codcagent;

   --- надходження вiд нерезидентiв безгот?вково? валюти
   CURSOR opl_dok
   IS
        SELECT t.ko,
               t.REF,
               t.acck,
               t.nlsk,
               t.kv,
               t.nlsd,
               t.accd,
               t.nazn,
               SUM (t.s_nom),
               SUM (t.s_eqv)
          FROM otcn_f70_temp t
         WHERE t.rnk = rnk_
      GROUP BY t.ko,
               t.REF,
               t.acck,
               t.nlsk,
               t.kv,
               t.nlsd,
               t.accd,
               t.nazn
      ORDER BY 6, 4, 2;

   -------------------------------------------------------------------
   PROCEDURE p_ins (p_np_     IN NUMBER,
                    p_kodp_   IN VARCHAR2,
                    p_znap_   IN VARCHAR2)
   IS
      l_kodp_    VARCHAR2 (10);
      p_znap1_   VARCHAR2 (70);
   BEGIN
      IF p_kodp_ = '31' AND LENGTH (TRIM (p_znap_)) < 3
      THEN
         p_znap1_ := LPAD (p_znap_, 3, '0');
      ELSE
         p_znap1_ := p_znap_;
      END IF;

      IF mfo_ = 300465 AND p_kodp_ = '31'
      THEN
         IF     (nlsk_ LIKE '1500%' OR nlsk_ LIKE '1600%')
            AND TRIM (nls_) IN
                   ('29091000580557',
                    '29092000040557',
                    '29095000081557',
                    '29091927',
                    '2909003101',
                    '29095000046547',
                    '292460205',
                    '292490204',
                    '29096000541557',
                    '37394501547',
                    '37391006',
                    '373990351')
         THEN
            p_znap1_ := '006';
         END IF;
      END IF;

      l_kodp_ := p_kodp_ || LPAD (TO_CHAR (p_np_), 3, '0');

      INSERT INTO rnbu_trace (nls,
                              kv,
                              odate,
                              kodp,
                              znap,
                              nbuc,
                              REF)
           VALUES (nls_,
                   kv_,
                   dat_,
                   l_kodp_,
                   p_znap1_,
                   nbuc_,
                   ref_);
   END;

   -------------------------------------------------------------------
   PROCEDURE p_tag (p_i_       IN     NUMBER,
                    p_value_   IN OUT VARCHAR2,
                    p_kodp_       OUT VARCHAR2,
                    p_ref_     IN     NUMBER DEFAULT NULL)
   IS
   BEGIN
      IF p_i_ = 1
      THEN
         p_kodp_ := '40';

         IF mfo_ = 300465
         THEN
            IF     (nlsk_ LIKE '1500%' OR nlsk_ LIKE '1600%')
               AND TRIM (nls_) IN
                      ('29091000580557',
                       '29092000040557',
                       '29095000081557',
                       '29091927',
                       '2909003101',
                       '29095000046547',
                       '292460205',
                       '292490204',
                       '29096000541557',
                       '373900354',
                       '373910357',
                       '373910360',
                       '373920363',
                       '373930353',
                       '373940356',
                       '373950359',                           --'37394501547',
                       '373950362',
                       '37395358',
                       '373960352',
                       '37397906547',
                       '373980361',
                       '37398355',
                       '373990351',
                       '373990364',
                       '37391006')
            THEN
               --d1#C9_ := '09';  -- было до 26.07.2012
               d1#C9_ := '29'; -- с 26.07.2012 согласно письма Рощиной от 11.07.2012
            END IF;

            IF     (nlsk_ LIKE '1500%' OR nlsk_ LIKE '1600%')
               AND nls_ IN ('37394501547') --and  --,'37396506') -- 30.12.2013 добавлен счет 37396506
            --(instr(lower(nazn_),'розрахунки за чеками') > 0 or  instr(lower(nazn_),'розрахунки по чеках') > 0)
            THEN
               d1#C9_ := '09'; -- с 26.07.2012 согласно письма Рощиной от 11.07.2012
            END IF;
         END IF;

         IF TRIM (p_value_) IS NULL AND d1#C9_ IS NULL AND nazn_ IS NOT NULL
         THEN
            IF INSTR (LOWER (nazn_), 'грош') > 0
            THEN
               --d1#C9_ := '09';  -- было до 26.07.2012
               d1#C9_ := '30'; -- с 26.07.2012 согласно письма Рощиной от 11.07.2012
            END IF;

            IF mfo_ <> 300120 AND INSTR (LOWER (nazn_), 'комерц') > 0
            THEN
               --d1#C9_ := '01';  -- было до 26.07.2012
               d1#C9_ := '30'; -- с 26.07.2012 согласно письма Рощиной от 11.07.2012
            END IF;

            IF INSTR (LOWER (nazn_), 'соц_альний переказ') >
                  0
            THEN
               --d1#C9_ := '05';  -- было до 26.07.2012
               d1#C9_ := '30'; -- с 26.07.2012 согласно письма Рощиной от 11.07.2012
            END IF;

            IF     d1#C9_ IS NULL
               AND INSTR (LOWER (nazn_), 'переказ') > 0
               AND TRIM (nls_) LIKE '2620%'
            THEN
               --d1#C9_ := '09';  -- было до 26.07.2012
               d1#C9_ := '30'; -- с 26.07.2012 согласно письма Рощиной от 11.07.2012
            END IF;
         END IF;

         IF TRIM (p_value_) IS NULL AND d1#C9_ IS NOT NULL
         THEN
            p_value_ := NVL (SUBSTR (TRIM (d1#C9_), 1, 70), '00');
         ELSE
            p_value_ :=
               NVL (LPAD (SUBSTR (TRIM (p_value_), 1, 2), 2, '0'), '00');
         END IF;

         d1#C9_ := p_value_;
      ELSIF p_i_ = 2
      THEN
         p_kodp_ := '51';

         IF TRIM (p_value_) IS NULL AND d2#C9_ IS NOT NULL
         THEN
            p_value_ := NVL (SUBSTR (TRIM (d2#C9_), 1, 70), 'N контр.');
         ELSE
            p_value_ := NVL (SUBSTR (TRIM (p_value_), 1, 70), 'N контр.');
         END IF;
      ELSIF p_i_ = 3
      THEN
         p_kodp_ := '52';

         IF TRIM (p_value_) IS NULL AND d3#C9_ IS NOT NULL
         THEN
            p_value_ :=
               NVL (SUBSTR (TRIM (d3#C9_), 1, 70), 'дата контр.');
         ELSE
            p_value_ :=
               NVL (SUBSTR (TRIM (p_value_), 1, 70), 'дата контр.');
         END IF;
      ELSIF p_i_ = 4
      THEN
         p_kodp_ := '60';

         IF TRIM (p_value_) IS NULL AND d4#C9_ IS NOT NULL
         THEN
            p_value_ := NVL (SUBSTR (TRIM (d4#C9_), 1, 70), '');
         ELSE
            p_value_ := NVL (SUBSTR (TRIM (p_value_), 1, 70), ''); --'DDMMYYYY');
         END IF;
      ELSIF p_i_ = 6
      THEN
         p_kodp_ := '62';

         IF p_value_ IS NOT NULL
         THEN
            p_value_ := LPAD (p_value_, 3, '0');
         ELSE
            p_value_ := TRIM (D6#C9_);
         END IF;

         IF     Dat_ >= TO_DATE ('01092011', 'ddmmyyyy')
            AND TRIM (kod_g_) IS NOT NULL
         THEN
            p_value_ := TRIM (kod_g_);
         END IF;

         IF p_value_ IS NULL
         THEN
            BEGIN
               SELECT SUBSTR (TRIM (VALUE),
                              INSTR (UPPER (TRIM (VALUE)), '3/') + 2,
                              2)
                 INTO swift_k_
                 FROM OPERW
                WHERE REF = REF_ AND TAG LIKE '50F%' AND ROWNUM = 1;

               SELECT TRIM (b.k040)
                 INTO p_value_
                 FROM kl_k040 b
                WHERE b.A2 = swift_k_;
            EXCEPTION
               WHEN NO_DATA_FOUND
               THEN
                  BEGIN
                     SELECT SUBSTR (TRIM (VALUE), 1, 10)
                       INTO swift_k_
                       FROM OPERW
                      WHERE     REF = REF_
                            AND TAG = '52A'
                            AND LENGTH (TRIM (VALUE)) > 3
                            AND ROWNUM = 1;

                     BEGIN
                        SELECT k040
                          INTO p_value_
                          FROM RC_BNK
                         WHERE SWIFT_CODE LIKE swift_k_ || '%' AND ROWNUM = 1;
                     EXCEPTION
                        WHEN NO_DATA_FOUND
                        THEN
                           swift_k_ :=
                                 SUBSTR (swift_k_, 1, 4)
                              || ' '
                              || SUBSTR (swift_k_, 5, 2)
                              || ' '
                              || SUBSTR (swift_k_, 7, 2);

                           BEGIN
                              SELECT k040
                                INTO p_value_
                                FROM RC_BNK
                               WHERE     SWIFT_CODE LIKE swift_k_ || '%'
                                     AND ROWNUM = 1;
                           EXCEPTION
                              WHEN NO_DATA_FOUND
                              THEN
                                 NULL;
                           END;
                     END;
                  EXCEPTION
                     WHEN NO_DATA_FOUND
                     THEN
                        NULL;
                  END;
            END;
         END IF;

         IF p_value_ IS NULL
         THEN
            BEGIN
               SELECT SUBSTR (TRIM (VALUE), 6, 11)
                 INTO bic_code
                 FROM OPERW
                WHERE     REF = REF_
                      AND VALUE LIKE '%52A%'
                      AND LENGTH (TRIM (VALUE)) > 3
                      AND INSTR (TRIM (VALUE), 'F52A:/') = 0
                      AND ROWNUM = 1;

               SELECT TRIM (b.k040)
                 INTO p_value_
                 FROM SW_BANKS a, kl_k040 b
                WHERE     a.bic = bic_code
                      AND b.A2(+) = SUBSTR (a.bic, 5, 2)
                      AND ROWNUM = 1;
            EXCEPTION
               WHEN NO_DATA_FOUND
               THEN
                  NULL;
            END;
         END IF;

         IF p_value_ IS NULL
         THEN
            BEGIN
               SELECT SUBSTR (TRIM (VALUE), 8, 2)
                 INTO swift_k_
                 FROM OPERW
                WHERE     REF = REF_
                      AND VALUE LIKE '%52D:/%'
                      AND LENGTH (TRIM (VALUE)) > 3
                      AND ROWNUM = 1;

               BEGIN
                  SELECT k040
                    INTO p_value_
                    FROM KL_K040
                   WHERE A2 = swift_k_ AND ROWNUM = 1;
               EXCEPTION
                  WHEN NO_DATA_FOUND
                  THEN
                     NULL;
               END;
            EXCEPTION
               WHEN NO_DATA_FOUND
               THEN
                  NULL;
            END;
         END IF;

         p_value_ :=
            NVL (
               SUBSTR (TRIM (p_value_), 1, 70),
               'код краiни з якоi була переказана валюта');
         country_ := SUBSTR (TRIM (p_value_), 1, 3);
      ELSIF p_i_ = 11
      THEN
         IF dat_ >= TO_DATE ('03-07-2006', 'dd-mm-yyyy')
         THEN
            p_kodp_ := '70';
            p_value_ :=
               NVL (SUBSTR (TRIM (p_value_), 1, 70),
                    'код товарної групи');
         END IF;
      --         IF trim(d1#C9_)<>'01' THEN
      --            p_value_:='0';
      --         end if;
      ELSIF p_i_ = 12
      THEN
         p_kodp_ := '69';

         IF TRIM (p_value_) IS NULL AND dc#C9_ IS NOT NULL
         THEN
            p_value_ :=
               NVL (SUBSTR (TRIM (dc#C9_), 1, 70), 'номер ВМД');
         ELSE
            p_value_ := NVL (SUBSTR (TRIM (p_value_), 1, 70), 'б/н');
         END IF;
      ELSIF p_i_ = 13
      THEN
         --новий код 99 - "вiдомостi про операцiю"
         p_kodp_ := '99';

         IF TRIM (p_value_) IS NULL AND d99#C9_ IS NOT NULL
         THEN
            IF LENGTH (TRIM (d99#C9_)) > 70
            THEN
               n_ := 70;
            ELSE
               n_ := LENGTH (TRIM (d99#C9_)) - 1;
            END IF;

            p_value_ := NVL (SUBSTR (TRIM (d99#C9_), 1, n_), '');
         ELSE
            p_value_ := NVL (SUBSTR (TRIM (p_value_), 1, 70), '');
         END IF;

         IF TRIM (p_value_) IS NULL AND mfo_ = 300465
         THEN
            p_value_ := SUBSTR (nazn_, 1, 70);
         END IF;
      ELSIF p_i_ = 14
      THEN
         IF Dat_ <= dat_Izm1_
         THEN
            --новий код 41 - "код надходження вiдповiдно до платiжного календаря"    "
            p_kodp_ := '41';

            IF TRIM (p_value_) IS NULL AND de#C9_ IS NOT NULL
            THEN
               p_value_ :=
                  NVL (SUBSTR (TRIM (de#C9_), 1, 3),
                       'код надходження');
            ELSE
               p_value_ :=
                  NVL (SUBSTR (TRIM (p_value_), 1, 3),
                       'код надходження');
            END IF;

            IF     (   p_value_ IS NULL
                    OR p_value_ = 'код надходження')
               AND SUBSTR (nlsk_, 1, 4) NOT IN
                      ('1522', '1523', '1524', '1525', '1621', '1623', '1624')
            THEN
               p_value_ := '999';
            END IF;

            IF TRIM (d1#C9_) NOT IN ('00', '03')
            THEN
               p_value_ := '999';
            END IF;

            IF TRIM (d1#C9_) = '03' AND p_value_ = '999'
            THEN
               p_value_ := '000';
            END IF;
         END IF;
      ELSE
         p_kodp_ := 'NN';
      END IF;
   END;

-----------------------------------------------------------------------------
BEGIN
   EXECUTE IMMEDIATE 'ALTER SESSION SET NLS_NUMERIC_CHARACTERS=''.,''';

   -------------------------------------------------------------------
   userid_ := user_id;

   EXECUTE IMMEDIATE 'TRUNCATE TABLE RNBU_TRACE';

   EXECUTE IMMEDIATE 'TRUNCATE TABLE OTCN_F70_TEMP';

   -------------------------------------------------------------------
   -- свой МФО
   mfo_ := F_Ourmfo ();

   -- МФО "родителя"
   BEGIN
      SELECT mfou
        INTO mfou_
        FROM BANKS
       WHERE mfo = mfo_;
   EXCEPTION
      WHEN NO_DATA_FOUND
      THEN
         mfou_ := mfo_;
   END;

   -------------------------------------------------------------------
   --   IF pr_op_ = 2
   --   THEN
   --      kodf_ := 'C9';
   --   END IF;

   --   IF pr_op_ = 3
   --   THEN
   --      kodf_ := 'D3';
   --   END IF;

   -- параметры формирования файла
   p_proc_set (kodf_,
               sheme_,
               nbuc1_,
               typ_);
   --- выбор курса долара для пересчета суммы
   kurs_ := f_ret_kurs (840, dat_);
   sum_kom := gl.p_icurval (840, 100000, dat_);                -- сума комiсiї

   ourOKPO_ := LPAD (F_Get_Params ('OKPO', NULL), 8, '0');

   BEGIN
      SELECT LPAD (TO_CHAR (GLB), 3, '0')
        INTO ourGLB_
        FROM rcukru
       WHERE mfo = mfo_ AND ROWNUM = 1;
   EXCEPTION
      WHEN NO_DATA_FOUND
      THEN
         ourGLB_ := NULL;
   END;

   -- з 01.06.2009 для надходження вал. вiд нерезид. вкл-ся операцii >=1000000$
   -- з 13.08.2007 (було 5000000$)
   -- 26.01.2011 изменил сумму с 100 на 1 т.к. у Демарка была сумма в эквиваленте меньше 100
   IF dat_ >= TO_DATE ('01062009', 'ddmmyyyy')
   THEN
      gr_sumn_ := 1;                                       --100;   --1000000;
   END IF;

   -- з 11.02.2014 для надходження вал. вiд нерезид. вкл-ся операцii >=100000$
   IF dat_ >= TO_DATE ('11022014', 'ddmmyyyy')
   THEN
      gr_sumn_ := 100000;
   END IF;

   -- отбор проводок, удовлетворяющих условию
   -- надходження вiд нерезидентiв
   INSERT INTO otcn_f70_temp (ko,
                              rnk,
                              REF,
                              acck,
                              nlsk,
                              kv,
                              nlsd,
                              accd,
                              nazn,
                              s_nom,
                              s_eqv)
      SELECT *
        FROM (  SELECT '3' ko,
                       ca.rnk,
                       o.REF,
                       o.acck,
                       o.nlsk,
                       o.kv,
                       o.nlsd,
                       o.accd,
                       o.nazn,
                       SUM (o.s * 100) s_nom,
                       SUM (gl.p_icurval (o.kv, o.s * 100, dat_)) s_eqv
                  FROM provodki o, cust_acc ca
                 WHERE     o.fdat = dat_
                       AND o.kv <> 980
                       AND (   (    (   (    SUBSTR (o.nlsd, 1, 4) IN
                                                ('1500',
                                                 '1600',
                                                 '3720',
                                                 '3739',
                                                 '3900',
                                                 '2909') --'2603'  --исключил 23.11.2012 т.к
                                         AND SUBSTR (o.nlsk, 1, 4) IN --введена 50% обязат.продажа
                                                ('1511',
                                                 '1512',
                                                 '1515',
                                                 '1516',
                                                 '1600',
                                                 '1602',
                                                 '2520', --добавил 11.08.2015 (службова 52-18/1047 Рощиної)
                                                 '2530',
                                                 '2541',
                                                 '2542',
                                                 '2544',
                                                 '2545',
                                                 '2600',
                                                 '2602',
                                                 '2603', --добавил 23.11.2012 т.к. введена 50% обязат.продажа
                                                 '2620',
                                                 '2625',
                                                 '2650',
                                                 '2901',
                                                 '2924'))
                                     OR (    SUBSTR (o.nlsd, 1, 4) = '1919' -- 24/06/2011 Петрокоммерц
                                         AND SUBSTR (o.nlsk, 1, 4) IN
                                                ('2600',
                                                 '2603',
                                                 '2620',
                                                 '2650',
                                                 '2909',
                                                 '2924')
                                         AND mfo_ = 300120)
                                     OR (    SUBSTR (o.nlsd, 1, 4) = '2602'
                                         AND SUBSTR (o.nlsk, 1, 4) = '2603')
                                     OR (    SUBSTR (o.nlsd, 1, 4) = '1500' -- 21/10/2009 УПБ
                                         AND SUBSTR (o.nlsk, 1, 4) = '2809'
                                         AND mfo_ = 300205)
                                     OR ( o.nlsd LIKE '260013011667%'    -- 14/03/2016 ГОУ
                                         AND SUBSTR (o.nlsk, 1, 4) in ('2603')
                                         AND mfo_ = 300465)
                                     OR (    SUBSTR (o.nlsd, 1, 4) IN
                                                ('1500', '1600') -- 23/06/2009
                                         AND SUBSTR (o.nlsk, 1, 4) = '2909'
                                         AND mfo_ <> 300120)
                                     OR (    SUBSTR (o.nlsd, 1, 4) = '1500' -- 10/12/2012 Петрокоммерц
                                         AND (   SUBSTR (o.nlsk, 1, 4) IN
                                                    ('2909', '3660')
                                              OR o.nlsk LIKE '3540020153901%')
                                         AND o.nlsk NOT LIKE '2909400129%'
                                         AND mfo_ = 300120)
                                     OR (    SUBSTR (o.nlsd, 1, 4) = '1500' -- 25/07/2009
                                         AND SUBSTR (o.nlsk, 1, 4) = '1819'
                                         AND mfo_ IN (380623, 300465))
                                     OR (    SUBSTR (o.nlsd, 1, 4) = '3739' -- 07/09/2010
                                         AND o.nlsk = '29091100070000' -- Запорiжжя ОБ
                                         AND mfo_ = 313957)
                                     OR (    SUBSTR (o.nlsd, 1, 4) IN
                                                ('2909', '3720') -- 29/11/2012
                                         AND SUBSTR (o.nlsk, 1, 4) IN
                                                ('2909', '2924') -- Петрокоммерц
                                         AND mfo_ = 300120)
                                     OR (    o.nlsd = '29093000110000' -- 12/10/2010
                                         AND (   o.nlsk LIKE '2909%'
                                              OR o.nlsk LIKE '2603%') -- Крим ОБ
                                         AND mfo_ = 324805)
                                     OR (    o.nlsd = '29099100170000' -- 19/10/2010
                                         AND (   o.nlsk LIKE '2909%'
                                              OR o.nlsk LIKE '2603%'
                                              OR o.nlsk LIKE '2620%'
                                              OR o.nlsk LIKE '2600%') -- Рiвне ОБ
                                         AND mfo_ = 333368)
                                     OR (    o.nlsd LIKE '2909%' -- 31/10/2014
                                         AND (   o.nlsk LIKE '2603%'
                                              OR o.nlsk LIKE '2620%'
                                              OR o.nlsk LIKE '2625%') -- Iвано-Франкывськ ОБ
                                         AND mfo_ = 336503)
                                     OR (    SUBSTR (o.nlsd, 1, 4) IN
                                                ('1500',
                                                 '3720',
                                                 '3739',
                                                 '3900',
                                                 '2909')         -- 04/11/2009
                                         AND SUBSTR (o.nlsk, 1, 4) = '2603' -- Житомир ОБ
                                         AND mfo_ IN
                                                (300465, 303398, 311647, 313957))
                                     OR (    SUBSTR (o.nlsd, 1, 4) IN
                                                ('1500', '1600', '3720', '3739') -- 03/06/2010
                                         AND SUBSTR (o.nlsk, 1, 4) = '2603' -- УПБ
                                         AND mfo_ IN (300205))
                                     OR (    SUBSTR (o.nlsd, 1, 4) IN
                                                ('1500', '1600') -- 16/07/2010  OAB
                                         AND (   o.nlsk LIKE '373900354%'
                                              OR            -- 26/05/2013  OAB
                                                o.nlsk LIKE '373910357%'
                                              OR o.nlsk LIKE '373910360%'
                                              OR o.nlsk LIKE '373920363%'
                                              OR o.nlsk LIKE '373930353%'
                                              OR o.nlsk LIKE '373940356%'
                                              OR o.nlsk LIKE '37394501547%'
                                              OR o.nlsk LIKE '373950359%'
                                              OR o.nlsk LIKE '373950362%'
                                              OR o.nlsk LIKE '37395358%'
                                              OR o.nlsk LIKE '373960352%'
                                              OR o.nlsk LIKE '37397906547%'
                                              OR o.nlsk LIKE '373980361%'
                                              OR o.nlsk LIKE '37398355%'
                                              OR o.nlsk LIKE '373990351%'
                                              OR o.nlsk LIKE '373990364%'
                                              OR o.nlsk LIKE '37391006%'
                                              OR o.nlsk LIKE '373960365%')
                                         AND mfo_ IN (300465))
                                     OR (    SUBSTR (o.nlsd, 1, 4) = '1600' -- 16/08/2010 Вирко
                                         AND o.nlsk = '18199'
                                         AND mfo_ IN (300465))
                                     OR (    SUBSTR (o.nlsd, 1, 4) = '3739' -- 22/07/2010
                                         AND (   o.nlsk LIKE '29090100250000%'
                                              OR o.nlsk LIKE '290969015%') -- Чернiвцi ОБ
                                         AND mfo_ = 356334)
                                     OR (    SUBSTR (o.nlsd, 1, 4) = '1819'
                                         AND SUBSTR (o.nlsk, 1, 4) IN
                                                ('1522',
                                                 '1523',
                                                 '1524',
                                                 '1525',
                                                 '1621',
                                                 '1623',
                                                 '1624')))
                                AND SUBSTR (LOWER (TRIM (o.nazn)), 1, 4) <>
                                       'конв')
                            OR (    SUBSTR (o.nlsd, 1, 4) = '1500' -- 12/01/2010
                                AND SUBSTR (o.nlsk, 1, 4) IN ('1819', '3540')
                                AND mfo_ IN (300465, 300205)
                                AND SUBSTR (LOWER (TRIM (o.nazn)), 1, 4) =
                                       'конв')
                            OR (    SUBSTR (o.nlsd, 1, 4) IN ('1500', '1600') -- 29/07/2012
                                AND SUBSTR (o.nlsk, 1, 4) = '2603'
                                AND mfo_ IN (300465))
                            OR (    SUBSTR (o.nlsd, 1, 4) = '1500' -- 12/01/2010
                                AND SUBSTR (o.nlsk, 1, 4) = '3540'
                                AND mfo_ IN (300465)
                                AND SUBSTR (LOWER (TRIM (o.nazn)), 1, 3) =
                                       'net')
                            OR (    o.nlsd LIKE '1502%' -- 30/07/2012 лист Шпирки вiд 24.07.2012
                                AND o.nlsk LIKE '1518%'
                                AND mfo_ = 300465)
                            OR (    o.nlsd LIKE '1502%'          -- 30/07/2012
                                AND o.nlsk LIKE '3800%'
                                AND mfo_ = 300465
                                AND REF IN
                                       (SELECT REF
                                          FROM oper
                                         WHERE     nlsa LIKE '1502%'
                                               AND nlsb LIKE '6010%')
                                AND gl.p_icurval (o.kv, o.s * 100, dat_) >
                                       sum_kom)
                            OR (    SUBSTR (o.nlsd, 1, 4) IN ('1500', '1600') -- 29/07/2012
                                AND o.nlsk LIKE '16_8%'
                                AND mfo_ = 300465)
                            -- службова Рощиної від 10.12.2015 52-18/1672
                            OR     o.nlsd LIKE '3739%'           -- 11/12/2015
                               AND o.nlsk LIKE '260013011667%'
                               AND mfo_ = 300465
                            OR (    SUBSTR (o.nlsd, 1, 4) IN ('1500', '1600') -- 29/07/2012
                                AND o.nlsk LIKE '3800%'
                                AND mfo_ = 300465
                                AND REF IN
                                       (SELECT REF
                                          FROM oper
                                         WHERE (   (    SUBSTR (nlsa, 1, 4) IN
                                                           ('1500', '1600')
                                                    AND (   nlsb LIKE '60%'
                                                         OR nlsb LIKE '610%'
                                                         OR nlsb LIKE '611%'))
                                                OR (    (   nlsa LIKE '60%'
                                                         OR nlsa LIKE '610%'
                                                         OR nlsa LIKE '611%')
                                                    AND SUBSTR (nlsb, 1, 4) IN
                                                           ('1500', '1600'))))
                                AND gl.p_icurval (o.kv, o.s * 100, dat_) >
                                       sum_kom))
                       AND DECODE (SUBSTR (o.nlsd, 1, 4),
                                   '2603', o.accd,
                                   o.acck) = ca.acc
              GROUP BY '3',
                       ca.rnk,
                       o.REF,
                       o.acck,
                       o.nlsk,
                       o.kv,
                       o.nlsd,
                       o.accd,
                       o.nazn);

   IF mfo_ = 300205
   THEN
      DELETE FROM otcn_f70_temp
            WHERE nlsd LIKE '1500%' AND nlsk LIKE '2602%';

      DELETE FROM otcn_f70_temp
            WHERE nlsd LIKE '2603%' AND nlsk LIKE '2600%';
   END IF;

   -- 11.08.2012 для всех всех РУ СБ и для ОПЕРУ также
   IF mfou_ = 300465
   THEN
      DELETE FROM otcn_f70_temp
            WHERE     nlsd LIKE '3739%'
                  AND SUBSTR (nlsk, 1, 4) IN ('2620', '2630', '2635', '2924');
   END IF;

   IF mfo_ IN (300465, 333368, 303398, 311647, 324805, 336503)
   THEN
      DELETE FROM otcn_f70_temp
            WHERE nlsd LIKE '2603%' AND nlsk LIKE '2600%';
   END IF;

   -- удаляем проводки которые не с коррсчета (Дт 1500 Кт 2909) Житомир СБ
   IF mfo_ IN (311647, 356334)
   THEN
      DELETE FROM otcn_f70_temp
            WHERE     nlsd LIKE '3739%'
                  AND nlsk LIKE '2909%'
                  AND REF IN (SELECT a.REF
                                FROM oper a
                               WHERE     a.REF IN (SELECT b.REF
                                                     FROM otcn_f70_temp b)
                                     AND a.nlsa NOT LIKE '1500%'
                                     AND a.nlsb NOT LIKE '2909%');
   END IF;

   -- удаляем проводки пополнения ЛОРО счета с коррсчета (Дт 1500 Кт 1600)
   IF mfo_ = 300465
   THEN
      DELETE FROM otcn_f70_temp
            WHERE REF IN (SELECT a.REF
                            FROM oper a
                           WHERE     a.REF IN (SELECT b.REF
                                                 FROM otcn_f70_temp b)
                                 AND a.nlsa LIKE '1500%'
                                 AND a.nlsb LIKE '1600%');
   END IF;

   -- удаляем проводки перевода отделения в ОБЛУПРАВЛЕНИЕ
   IF mfou_ = 300465
   THEN
      DELETE FROM otcn_f70_temp
            WHERE REF IN (SELECT a.REF
                            FROM oper a
                           WHERE     a.REF IN (SELECT b.REF
                                                 FROM otcn_f70_temp b)
                                 AND a.tt IN ('АСВ'));
   END IF;

   -- удаляем проводки перевода отделения в ОБЛУПРАВЛЕНИЕ
   IF mfou_ = 300465
   THEN
      DELETE FROM otcn_f70_temp
            WHERE     nlsd LIKE '3739%'
                  AND SUBSTR (nlsk, 1, 4) IN
                         ('2600',
                          '2602',
                          '2620',
                          '2625',
                          '2630',
                          '2635',
                          '2650',
                          '2924')
                  AND REF IN (SELECT a.REF
                                FROM oper a
                               WHERE     a.REF IN (SELECT b.REF
                                                     FROM otcn_f70_temp b)
                                     AND a.tt IN ('024')
                                     AND nlsk != '260013011667');
   END IF;

   -- удаляем проводки перевода для РОДОВИД
   IF mfou_ = 300465
   THEN
      DELETE FROM otcn_f70_temp
            WHERE     nlsd LIKE '2909%'
                  AND SUBSTR (nlsk, 1, 4) IN ('2630', '2635')
                  AND REF IN (SELECT a.REF
                                FROM oper a
                               WHERE     a.REF IN (SELECT b.REF
                                                     FROM otcn_f70_temp b)
                                     AND a.tt IN ('024'));
   END IF;

   -- удаляем проводки Дт 1500,1600 Кт 2909
   IF mfo_ = 300465
   THEN
      DELETE FROM otcn_f70_temp
            WHERE     (nlsd LIKE '1500%' OR nlsd LIKE '1600%')
                  AND nlsk LIKE '2909%'
                  AND nlsk NOT IN
                         ('29096000541557',
                          '29095000046547',
                          '29095000081557',
                          '29091000580557',
                          '2909003101',
                          '29092000040557',
                          '29091927');
   END IF;

   -- удаляем проводки Дт 29090100250000 Кт любой   Чернiвцi ОБ
   IF mfo_ = 356334
   THEN
      DELETE FROM otcn_f70_temp
            WHERE nlsd LIKE '29090100250000%' AND nlsk NOT LIKE '2909%';
   END IF;

   -- удаляем проводки Дт 3739 Кт 29099100170000 Запорожье ОБ
   IF mfou_ = 300465
   THEN
      DELETE FROM otcn_f70_temp
            WHERE     nlsd LIKE '3739%'
                  AND nlsk LIKE '2909%'
                  AND nlsk IN
                         (SELECT a.nls
                            FROM accounts a, specparam_int s
                           WHERE     a.nbs = '2909'
                                 AND a.acc = s.acc(+)
                                 AND s.ob22 = '66');
   END IF;

   -- удаляем проводки Дт 2909 Кт 2620 Рiвне ОБ
   IF mfo_ = 333368
   THEN
      DELETE FROM otcn_f70_temp
            WHERE     nlsd LIKE '2909%'
                  AND nlsd != '29099100170000'
                  AND SUBSTR (nlsk, 1, 4) IN ('2620', '2600', '2603', '2909');
   END IF;

   -- удаляем проводки Дт 3739 Кт 29090100250000 Крим ОБ
   IF mfo_ = 324805
   THEN
      DELETE FROM otcn_f70_temp
            WHERE nlsd LIKE '3739%' AND nlsk LIKE '29093000110000%';
   END IF;

   -- удаляем проводки Дт 2909 Кт 2620 Крим ОБ
   IF mfo_ = 324805
   THEN
      DELETE FROM otcn_f70_temp
            WHERE nlsd LIKE '2909%' AND nlsk LIKE '2620%';
   END IF;

   -- удаляем проводки Дт 1500 Кт 1600
   IF mfo_ = 300465
   THEN
      DELETE FROM otcn_f70_temp
            WHERE nlsd LIKE '1500%' AND nlsk LIKE '1600%';
   END IF;

   -- удаляем проводки Дт 1600 Кт 1600
   IF mfo_ = 300465
   THEN
      DELETE FROM otcn_f70_temp
            WHERE nlsd LIKE '1600%' AND nlsk LIKE '1600%';
   END IF;

   -- удаляем проводки Дт 1500 Кт 2924 для Столицы
   IF mfo_ = 380623
   THEN
      DELETE FROM otcn_f70_temp
            WHERE nlsd LIKE '1500%' AND nlsk LIKE '2924%';
   END IF;

   -- для Петрокоммерца удаляем проводки для которых Дт 2909 но не 2909400129
   --                                                Кт 2620, 2924, 2909
   IF mfo_ = 300120
   THEN
      DELETE FROM otcn_f70_temp
            WHERE     nlsd LIKE '2909%'
                  AND nlsd != '2909400129'
                  AND SUBSTR (nlsk, 1, 4) IN ('2620', '2924', '2909');
   END IF;

   OPEN c_main;

   LOOP
      FETCH c_main
         INTO ko_,
              rnk_,
              okpo_,
              nmk_,
              k040_,
              adr_,
              k110_,
              codc_,
              sum1_,
              sumk1_;

      EXIT WHEN c_main%NOTFOUND;
      sum1_ := sum1_ - NVL (sumk1_, 0);
      rez_ := MOD (codc_, 2);

      -- 10.06.2009 изменил на следующее
      IF LENGTH (TRIM (okpo_)) <= 8
      THEN
         okpo_ := LPAD (TRIM (okpo_), 8, '0');
      ELSE
         okpo_ := LPAD (TRIM (okpo_), 10, '0');
      END IF;

      -- для банков по коду ОКПО из RCUKRU(IKOD)
      -- определяем код банка поле GLB
      IF codc_ IN (1, 2)
      THEN
         BEGIN
            SELECT GLB
              INTO okpo_
              FROM rcukru
             WHERE TRIM (ikod) = TRIM (okpo_) AND ROWNUM = 1;
         EXCEPTION
            WHEN NO_DATA_FOUND
            THEN
               NULL;
         END;
      END IF;

      -- для физлиц резидентов не имеющих OKPO
      --определяем серию и номер паспорта из PERSON
      IF     codc_ = 5
         AND TRIM (okpo_) IN
                ('99999', '999999999', '00000', '000000000', '0000000000')
      THEN
         BEGIN
            SELECT ser, numdoc
              INTO ser_, numdoc_
              FROM person
             WHERE rnk = rnk_ AND ROWNUM = 1;

            okpo_ := TRIM (ser_) || ' ' || TRIM (numdoc_);
         EXCEPTION
            WHEN NO_DATA_FOUND
            THEN
               NULL;
         END;
      END IF;

      -- до 13.08.07 в файл #C9 включалась сумма поступления от нерезидентов
      -- 100 тыс.долларов общая по клиенту, а
      -- с 13.08.2007 50 тыс.долларов только одной операции

      ---надходження в?д нерезидент?в безгот?вково? валюти
      OPEN opl_dok;

      LOOP
         FETCH opl_dok
            INTO ko_1,
                 ref_,
                 acc_,
                 nls_,
                 kv_,
                 nlsk_,
                 accd_,
                 nazn_,
                 sum0_,
                 sumk0_;

         EXIT WHEN opl_dok%NOTFOUND;

         nls1_ := SUBSTR (nls_, 1, 2);
         d1#C9_ := NULL;
         d2#C9_ := NULL;
         d3#C9_ := NULL;
         d4#C9_ := NULL;
         d6#C9_ := NULL;
         dc#C9_ := NULL;
         d99#C9_ := NULL;
         de#C9_ := NULL;
         val_ := NULL;
         kod_g_ := NULL;
         kol_99 := 0;
         refd1_ := ref_;
         s_nom_2603 := 0;

         IF     dat_ <= TO_DATE ('31082014', 'ddmmyyyy')
            AND nlsk_ LIKE '2603%'
            AND (nls_ LIKE '2900%' OR nls_ LIKE '2600%' OR nls_ LIKE '2650%')
         THEN
            BEGIN
               SELECT s_nom * 2
                 INTO s_nom_2603
                 FROM otcn_f70_temp
                WHERE REF = ref_;
            EXCEPTION
               WHEN NO_DATA_FOUND
               THEN
                  NULL;
            END;
         END IF;

         IF nlsk_ LIKE '2603%' AND nls_ LIKE '2900%'
         THEN
            BEGIN
               SELECT REF
                 INTO refd1_
                 FROM otcn_f70_temp
                WHERE     nlsd LIKE '2603%'
                      AND (nlsk LIKE '2600%' OR nlsk LIKE '2650%')
                      AND kv = kv_
                      AND ROUND (s_nom / 100, 0) = ROUND (sum0_ / 100, 0)
                      AND rnk = rnk_
                      AND ROWNUM = 1;
            EXCEPTION
               WHEN NO_DATA_FOUND
               THEN
                  NULL;
            END;
         END IF;

         IF    (    ko_ = '3'
                AND ROUND (sumk0_ / kurs_, 0) > gr_sumn_
                AND (   nls1_ NOT IN ('15', '16')
                     OR (nls1_ IN ('15', '16') AND codc_ IN (2, 4, 6))))
            OR ROUND (GL.p_icurval (kv_, s_nom_2603, dat_) / kurs_, 0) >
                  gr_sumn_
         THEN
            dig_ := f_ret_dig (kv_) * 100;

            -- сумма должна быть в единицах валюты

            IF ko_ = ko_1
            THEN
               IF typ_ > 0
               THEN
                  nbuc_ := NVL (f_codobl_tobo (acc_, typ_), nbuc1_);
               ELSE
                  nbuc_ := nbuc1_;
               END IF;

               -- OAB добавил 16.06.06 по просьбе Сбербанка
               -- определяем код страны перечисления валюты
               IF ko_ = 3
               THEN
                  BEGIN
                     SELECT SUBSTR (VALUE, 1, 70)
                       INTO d6#c9_
                       FROM operw
                      WHERE REF = refd1_ AND tag = 'D6#70';
                  EXCEPTION
                     WHEN NO_DATA_FOUND
                     THEN
                        d6#C9_ := NULL;
                  END;
               END IF;

               FOR k IN (SELECT *
                           FROM operw
                          WHERE REF = refd1_)
               LOOP
                  -- с 01.08.2012 добавляется код страны отправителя или получателя перевода
                  IF     k.tag LIKE 'n%'
                     AND SUBSTR (TRIM (k.VALUE), 1, 1) IN
                            ('O', 'P', 'О', 'П')
                  THEN
                     kod_g_ := SUBSTR (TRIM (k.VALUE), 2, 3);
                  END IF;

                  IF     kod_g_ IS NULL
                     AND k.tag LIKE 'n%'
                     AND SUBSTR (TRIM (k.VALUE), 1, 1) NOT IN
                            ('O', 'P', 'О', 'П')
                  THEN
                     kod_g_ := SUBSTR (TRIM (k.VALUE), 1, 3);
                  END IF;

                  IF     kod_g_ IS NULL
                     AND k.tag LIKE 'D6#70%'
                     AND SUBSTR (TRIM (k.VALUE), 1, 1) IN
                            ('O', 'P', 'О', 'П')
                  THEN
                     kod_g_ := SUBSTR (TRIM (k.VALUE), 2, 3);
                  END IF;

                  IF     kod_g_ IS NULL
                     AND k.tag LIKE 'D6#70%'
                     AND SUBSTR (TRIM (k.VALUE), 1, 1) NOT IN
                            ('O', 'P', 'О', 'П')
                  THEN
                     kod_g_ := SUBSTR (TRIM (k.VALUE), 1, 3);
                  END IF;

                  IF     kod_g_ IS NULL
                     AND k.tag LIKE 'D6#E2%'
                     AND SUBSTR (TRIM (k.VALUE), 1, 1) IN
                            ('O', 'P', 'О', 'П')
                  THEN
                     kod_g_ := SUBSTR (TRIM (k.VALUE), 2, 3);
                  END IF;

                  IF     kod_g_ IS NULL
                     AND k.tag LIKE 'D6#E2%'
                     AND SUBSTR (TRIM (k.VALUE), 1, 1) NOT IN
                            ('O', 'P', 'О', 'П')
                  THEN
                     kod_g_ := SUBSTR (TRIM (k.VALUE), 1, 3);
                  END IF;

                  IF     kod_g_ IS NULL
                     AND k.tag LIKE 'D1#E9%'
                     AND SUBSTR (TRIM (k.VALUE), 1, 1) IN
                            ('O', 'P', 'О', 'П')
                  THEN
                     kod_g_ := SUBSTR (TRIM (k.VALUE), 2, 3);
                  END IF;

                  IF     kod_g_ IS NULL
                     AND k.tag LIKE 'D1#E9%'
                     AND SUBSTR (TRIM (k.VALUE), 1, 1) NOT IN
                            ('O', 'P', 'О', 'П')
                  THEN
                     kod_g_ := SUBSTR (TRIM (k.VALUE), 1, 3);
                  END IF;
               END LOOP;

               IF kod_g_ IS NULL
               THEN
                  BEGIN
                     SELECT SUBSTR (VALUE, 1, 3)
                       INTO kod_g_
                       FROM OPERW
                      WHERE REF = refd1_ AND tag = 'KOD_G';
                  EXCEPTION
                     WHEN NO_DATA_FOUND
                     THEN
                        BEGIN
                           SELECT '804'
                             INTO kod_g_
                             FROM OPERW
                            WHERE     REF = refd1_
                                  AND tag = '50F'
                                  AND INSTR (UPPER (TRIM (VALUE)), '3/UA') >
                                         0;
                        EXCEPTION
                           WHEN NO_DATA_FOUND
                           THEN
                              kod_g_ := NULL;
                        END;
                  END;
               END IF;

               IF d6#C9_ IS NULL AND TRIM (kod_g_) IS NOT NULL
               THEN
                  d6#C9_ := kod_g_;
               END IF;

               IF d6#C9_ IS NULL OR d6#C9_ NOT IN ('804', 'UKR')
               THEN
                  IF ref_ = refd1_
                  THEN
                     nnnn_ := nnnn_ + 1;

                     -- код валюти
                     p_ins (nnnn_, '10', LPAD (kv_, 3, '0'));

                     -- сума в единицах валюты (код 12)
                     -- округлять будем общую сумму по клиенту в TMP_NBU
                     --p_ins (nnnn_, '20', TO_CHAR (ROUND (sum0_ / dig_, 0)));
                     p_ins (nnnn_, '20', TO_CHAR (sum0_));

                     -- ОКПО клiєнта
                     IF rez_ = 0 AND TRIM (okpo_) IS NULL  -- для нерезидентiв
                     THEN
                        okpo_ := '0';
                     END IF;

                     IF okpo_ = ourOKPO_
                     THEN
                        okpo_ := ourGLB_;
                        codc_ := 1;
                     END IF;

                     p_ins (nnnn_, '31', TRIM (okpo_));

                     IF dat_ >= TO_DATE ('13082007', 'ddmmyyyy')
                     THEN
                        -- код резидентностi
                        p_ins (nnnn_, '35', TO_CHAR (2 - MOD (codc_, 2)));
                     END IF;
                  ELSE
                     BEGIN
                        SELECT SUBSTR (kodp, 3, 3)
                          INTO nnnn1_
                          FROM rnbu_trace
                         WHERE REF = refd1_ AND SUBSTR (kodp, 1, 2) = '20';
                     EXCEPTION
                        WHEN NO_DATA_FOUND
                        THEN
                           nnnn1_ := nnnn_ + 1;
                     END;

                     -- сума в единицах валюты (код 12)
                     -- округлять будем общую сумму по клиенту в TMP_NBU
                     --p_ins (nnnn1_, '20', TO_CHAR (ROUND (sum0_ / dig_, 0)));
                     p_ins (nnnn1_, '20', TO_CHAR (sum0_));
                  END IF;
               END IF;

               refd_ := TO_NUMBER (TRIM (f_dop (ref_, 'NOS_R')));

               BEGIN
                  SELECT TRIM (nd)
                    INTO nd_
                    FROM oper
                   WHERE REF = ref_;
               EXCEPTION
                  WHEN NO_DATA_FOUND
                  THEN
                     nd_ := '0';
               END;

               IF refd_ IS NULL
               THEN
                  BEGIN
                     SELECT REF
                       INTO refd_
                       FROM oper
                      WHERE     vdat BETWEEN TO_DATE (dat_) - 7 AND dat_
                            AND nlsb = nls_
                            AND kv = kv_
                            AND refl IN (ref_);
                  EXCEPTION
                     WHEN NO_DATA_FOUND
                     THEN
                        BEGIN
                           SELECT REF
                             INTO refd_
                             FROM oper
                            WHERE     vdat BETWEEN TO_DATE (dat_) - 7
                                               AND dat_
                                  AND nlsb = nls_
                                  AND kv = kv_
                                  AND TO_CHAR (REF) IN nd_;
                        --                              ref in to_number(nd_);
                        EXCEPTION
                           WHEN NO_DATA_FOUND
                           THEN
                              refd_ := NULL;
                        END;
                  END;
               END IF;

               BEGIN
                    SELECT p.pid, MAX (p.id)
                      INTO pid_, id_
                      FROM contract_p p
                     WHERE p.REF = ref_
                  GROUP BY p.pid;

                  SELECT LPAD (TO_CHAR (t.id_oper), 2, '0'),
                         t.name,
                         TO_CHAR (t.dateopen, 'ddmmyyyy'),
                         t.bankcountry
                    INTO D1#C9_,
                         D2#C9_,
                         D3#C9_,
                         D6#C9_
                    FROM top_contracts t
                   WHERE t.pid = pid_; --and p.kv=t.kv - Инна сказала, что это условие лишнее (платеж м.б. в другой валюте)

                  BEGIN
                     SELECT MAX (TRIM (name))
                       INTO DC#C9_max
                       FROM tamozhdoc
                      WHERE pid = pid_ AND id = id_;

                     SELECT COUNT (*)
                       INTO kol_99
                       FROM contract_p
                      WHERE REF = ref_;
                  EXCEPTION
                     WHEN NO_DATA_FOUND
                     THEN
                        DC#C9_ := NULL;
                  END;

                  IF DC#C9_max IS NOT NULL
                  THEN
                     BEGIN
                        SELECT TO_CHAR (t.datedoc, 'ddmmyyyy'),
                                  LPAD (TRIM (c.cnum_cst), 9, '#')
                               || '/'
                               || SUBSTR (c.cnum_year, -1)
                               || '/'
                               || LPAD (DC#C9_max, 6, '0')
                          INTO D4#C9_, DC#C9_
                          FROM tamozhdoc t, customs_decl c
                         WHERE     t.pid = pid_
                               AND t.id = id_
                               AND TRIM (t.name) = TRIM (DC#C9_max)
                               AND TRIM (c.cnum_num) = TRIM (t.name)
                               AND TRIM (c.f_okpo) = TRIM (okpo_)
                               AND ROWNUM = 1;
                     EXCEPTION
                        WHEN NO_DATA_FOUND
                        THEN
                           dc#c9_ := dc#c9_max;                        --null;
                     END;

                     IF kol_99 <= 3
                     THEN
                        FOR k IN (  SELECT pid, id
                                      FROM contract_p
                                     WHERE REF = ref_ AND id <> id_
                                  ORDER BY pid, id)
                        LOOP
                           SELECT t.name,
                                  TO_CHAR (t.datedoc, 'dd/mm/yyyy'),
                                     LPAD (TRIM (c.cnum_cst), 9, '#')
                                  || '/'
                                  || SUBSTR (c.cnum_year, -1)
                                  || '/'
                             INTO name_, datedoc_, DC1#C9_
                             FROM tamozhdoc t, customs_decl c
                            WHERE     t.pid = k.pid
                                  AND t.id = k.id
                                  AND TRIM (c.cnum_num) = TRIM (t.name)
                                  AND TRIM (c.f_okpo) = TRIM (okpo_)
                                  AND ROWNUM = 1;

                           D99#C9_ :=
                                 D99#C9_
                              || DC1#C9_
                              || TRIM (name_)
                              || ' '
                              || datedoc_
                              || ',';
                        END LOOP;
                     --                        insert into otcn_log (kodf,userid, txt)
                     --                           values (kodf_, userid_, d99#c9_);

                     ELSE
                        D99#C9_ :=
                              'оплата за'
                           || TO_CHAR (kol_99)
                           || '-ма ВМД';
                     END IF;
                  END IF;
               EXCEPTION
                  WHEN NO_DATA_FOUND
                  THEN
                     NULL;
                  WHEN TOO_MANY_ROWS
                  THEN
                     NULL; -- если платеж по нескольким контрактам, то пусть разбивают сумму и вводят реквизиты сами
               END;

               IF refd_ IS NULL
               THEN
                  refd_ := ref_;
               END IF;

               -- додатковi параметри
               IF dat_ < TO_DATE ('13-08-2007', 'dd-mm-yyyy')
               THEN
                  n_ := 11;
               ELSE
                  n_ := 13;
               END IF;

               IF dat_ >= TO_DATE ('01062009', 'ddmmyyyy') and dat_ <= Dat_Izm1_
               THEN
                  n_ := 14;
               END IF;

               IF ref_ = refd1_
               THEN
                  FOR i IN 1 .. n_
                  LOOP
                     IF i < 10
                     THEN
                        tag_ := 'D' || TO_CHAR (i) || '#70';
                     ELSIF i = 10
                     THEN
                        tag_ := 'DA#70';
                     ELSIF i = 11
                     THEN
                        tag_ := 'DB#70';
                     ELSIF i = 12
                     THEN
                        tag_ := 'DC#70';
                     ELSIF i = 13
                     THEN
                        tag_ := 'DD#70';
                     ELSE
                        tag_ := 'DE#C9';
                     END IF;

                     IF i = 1
                     THEN
                        tag_ := 'D1#C9';
                     END IF;

                     -- с 01.07.2005 для поступлений от нерезидентов нужны
                     -- доп.реквизиты (D1#70,D6#70,D9#70,DA#70)
                     -- с 28.02.2006 нужны доп.реквизиты (D1#70,D6#70,DB#70)
                     -- с 13.08.2007 нужны доп.реквизиты (D1#70, D2#70, D3#70,
                     --                                   D4#70, D6#70, DB#70,
                     --                                   DC#70)

                     IF    (    dat_ < TO_DATE ('13-08-2007', 'dd-mm-yyyy')
                            AND ko_ = 3
                            AND i IN (1, 6, 11))
                        OR (       dat_ >=
                                      TO_DATE ('13-08-2007', 'dd-mm-yyyy')
                               AND dat_ <
                                      TO_DATE ('01-06-2009', 'dd-mm-yyyy')
                               AND ko_ = 3
                               AND i IN (1, 2, 3, 4, 6, 11, 12, 13)
                            OR (    dat_ >=
                                       TO_DATE ('01-06-2009', 'dd-mm-yyyy')
                                AND ko_ = 3
                                AND i IN (1, 6, 13, 14)))
                     THEN
                        -- 16.06.06 OAB добавил условие, если Украина, то не формируем
                        IF    d6#C9_ IS NULL
                           OR TRIM (d6#C9_) NOT IN ('804', 'UKR')
                        THEN
                           BEGIN
                              SELECT SUBSTR (VALUE, 1, 70)
                                INTO val_
                                FROM operw
                               WHERE REF = refd_ AND tag = tag_;
                           EXCEPTION
                              WHEN NO_DATA_FOUND
                              THEN
                                 val_ := NULL;
                           END;

                           -- код показника та default-значення
                           p_tag (i,
                                  val_,
                                  kodp_,
                                  ref_);
                           -- запис показника
                           p_ins (nnnn_, kodp_, val_);
                        END IF;
                     END IF;
                  END LOOP;
               END IF;
            --               IF dat_ >=TO_DATE('13082007','ddmmyyyy')
            --               THEN
            --                  -- вiдомостi про операцiю
            --                  p_ins (nnnn_, '99', '');
            --               END IF;

            END IF;
         END IF;
      END LOOP;

      CLOSE opl_dok;
   END LOOP;

   CLOSE c_main;

   ---------------------------------------------------
   -- с 23.09.2014 будет формироваться новый блок с кодом мети надходження 36
   -- общая сумма в разрезе валют всех поступлений в том числе меньше 1000.00$
   IF Dat_ >= TO_DATE ('23092014', 'ddmmyyyy')
   THEN
      kv_ := '000';
      nbuc_ := nbuc1_;

      FOR k
         IN ( SELECT t.kv,
                     t.REF,
                     SUM (NVL (ROUND (z.s2 / 0.75, 0), t.s_nom)) s_nom,
                     SUM (t.s_eqv) s_eqv
                --FROM otcn_f70_temp t, zayavka z
                FROM (select a.kv, a.nls nlsk, o.ref, o.s s_nom,o.sq s_eqv
                      from opldok o, accounts a
                      where o.fdat = dat_
                        and o.acc = a.acc
                        and a.nbs = '2603'
                        and a.kv <> 980
                        and o.dk = 1 ) t, zayavka z
                WHERE t.nlsk LIKE '2603%'
                  AND t.REF = z.refoper(+)
                  AND z.dk = 2
                  AND z.obz = 1
                  AND z.sos <> -1
              GROUP BY t.kv, t.REF
              ORDER BY 1, 2)
      LOOP
         ref_ := k.REF;

         IF k.kv <> kv_
         THEN
            nnnn_ := nnnn_ + 1;
            kv_ := k.kv;

            -- код валюти
            p_ins (nnnn_, '10', LPAD (k.kv, 3, '0'));

            -- сума в единицах валюты (код 12)
            --p_ins (nnnn_, '20', TO_CHAR (round(k.s_nom*0.75,0)));

            -- ОКПО клiєнта
            p_ins (nnnn_, '31', '0');

            -- код резидентностi
            p_ins (nnnn_, '35', '1');

            -- код мети
            p_ins (nnnn_, '40', '36');

           IF Dat_ <= dat_Izm1_
           THEN
            -- код надходження відп. до плат.календаря
            p_ins (nnnn_, '41', '999');
           END IF;

            -- код країни
            p_ins (nnnn_, '62', '804');

            -- відомості про операцію
            p_ins (nnnn_,
                   '99',
                   'обовязковий продаж валюти');
         END IF;

         -- сума в единицах валюты (код 12)
         --p_ins (nnnn_, '20', TO_CHAR (round(k.s_nom*0.75,0)));
         p_ins (nnnn_, '20', TO_CHAR (k.s_nom));
      END LOOP;
   END IF;

   ---------------------------------------------------
   DELETE FROM tmp_nbu
         WHERE kodf = kodf_ AND datf = dat_;

   ---------------------------------------------------
   INSERT INTO tmp_nbu (kodp,
                        datf,
                        kodf,
                        znap,
                        nbuc)
      (  SELECT kodp,
                dat_,
                kodf_,
                TO_CHAR (ROUND (SUM (znap) / 100, 0)) znap,
                nbuc
           FROM rnbu_trace
          WHERE userid = userid_ AND kodp LIKE '20%'
       GROUP BY kodp,
                dat_,
                kodf_,
                nbuc
       UNION ALL
       SELECT kodp,
              dat_,
              kodf_,
              znap,
              nbuc
         FROM rnbu_trace
        WHERE userid = userid_ AND kodp NOT LIKE '20%');
--EXCEPTION
--   WHEN OTHERS
--   THEN
--      raise_application_error (-20000, 'Error in p_fc9_nn: ' || SQLERRM);
----------------------------------------
END p_fc9_nn;
/
show err;

PROMPT *** Create  grants  P_FC9_NN ***
grant EXECUTE                                                                on P_FC9_NN        to BARS_ACCESS_DEFROLE;



PROMPT ===================================================================================== 
PROMPT *** End *** ========== Scripts /Sql/BARS/Procedure/P_FC9_NN.sql =========*** End *** 
PROMPT ===================================================================================== 
