

PROMPT ===================================================================================== 
PROMPT *** Run *** ========== Scripts /Sql/BARS/Procedure/P_REP_DOD5.sql =========*** Run **
PROMPT ===================================================================================== 


PROMPT *** Create  procedure P_REP_DOD5 ***

  CREATE OR REPLACE PROCEDURE BARS.P_REP_DOD5 (dat_ date) is
begin
  execute immediate 'truncate table RNBU_TRACE';

  insert into RNBU_TRACE
    (znap,acc,ref,comm, kodp)
    select "Показники","Вхідн_залишок","Сума_до_погаш",substr("Перелік_рахунків",1,200),substr("Перелік_рахунків",201)
    from
    (
    select '   АКТИВИ  Н4:' "Показники", null "Вхідн_залишок", null "Сума_до_погаш", null "Перелік_рахунків" from dual
       union all
    select nbs_pr||' '||kv "Показники", sum(ostq)/100 "Вхідн_залишок", null "Сума_до_погаш", nbs_name "Перелік_рахунків"
    from
     (select decode(kv,980,'UAH','VAL') kv, gl.p_icurval(a.kv, s.ostf,dat_) ostq,
                decode(nbs,'1200','1200','1203','1200','1001','кошти в касі','1002','кошти в касі', '1003','кошти в касі','1004','кошти в касі',
                           '1005','кошти в касі','1007','кошти в касі','1011','дорожні чеки','1012','дорожні чеки','1013','дорожні чеки','1017','дорожні чеки',nbs
                      ) nbs_pr,
               decode(nbs,'1200','1200,1203','1203','1200,1203','1001','1001,1002,1003,1004,1005,1007','1002','1001,1002,1003,1004,1005,1007',
                          '1003','1001,1002,1003,1004,1005,1007','1004','1001,1002,1003,1004,1005,1007','1005','1001,1002,1003,1004,1005,1007',
                           '1007','1001,1002,1003,1004,1005,1007','1011','1011,1012,1013,1017','1012','1011,1012,1013,1017',
                           '1013','1011,1012,1013,1017','1017','1011,1012,1013,1017' ,nbs
                          ) nbs_name
        from accounts a, saldoa s
        where a.acc = s.acc and
            (s.acc, s.fdat) = (select s1.acc, max(s1.fdat) from saldoa s1 where s.acc = s1.acc and s1.fdat <= dat_ group by s1.acc) and
            nbs in (1200,1203,1500,1510,1521,1001,1002,1003,1004,1005,1007,1011,1012,1013,1017)
            and s.ostf < 0
    )
    group by nbs_pr, kv,  nbs_name
      union all
    select '   АКТИВИ  Н5:' "Показники", null "Вхідн_залишок", null "Сума_до_погаш", null "Перелік_рахунків" from dual
       union all
     select nbs_pr "Показники", null "Вхідн_залишок", sum(ostq)/100 "Сума_до_погаш", nbs_name "Перелік_рахунків"
     from
     (   select kv, gl.p_icurval(a.kv, s.ostf,dat_) ostq, nbs,
                  decode(instr('1207,1211,1212', nbs), 0,
                         decode(instr('1101,1102,1107', nbs), 0,
                                decode(instr('1400,1401,1402,1403,1404,1405,1407,1410,1411,1412,1413,1414,1415,1417,1420,1421,1422,1423,1424,1427,1430,1435,1437,1440,1447,1522,3110,3011,3012,3013,3014,3115,3117,3210,3211,3212,3213,3214, 3217,3010,3011,3012,3013,3014,3015,3017,', nbs), 0,
                                       decode(instr('1512,1523,', nbs), 0,
                                               decode(instr('1600,2010,2020,2030,2062,2063,2065,2071,2072,2073,2074,2075 ,2082,2083,2085,2102,2103,2105,2112,2113,2115 ,2122,2123,2125,2132,2133,2135,2202,2203,2205 ,2211,2212,2213,2215,2220,2232,2233,2235,2600,2605,2620,2625,2650,2655,', nbs), 0,
                                                      'ІНШІ','погашення кредитів')
                                              ,'МБК')
                                      ,'цінні папери, РЕПО')
                                ,'банківські метали')
                         ,'кошти в НБУ'
                         )nbs_pr,
                  decode(instr('1207,1211,1212', nbs), 0,
                         decode(instr('1101,1102,1107', nbs), 0,
                                decode(instr('1400,1401,1402,1403,1404,1405,1407,1410,1411,1412,1413,1414,1415,1417,1420,1421,1422,1423,1424,1427,1430,1435,1437,1440,1447,1522,3110,3011,3012,3013,3014,3115,3117,3210,3211,3212,3213,3214, 3217,3010,3011,3012,3013,3014,3015,3017,', nbs), 0,
                                       decode(instr('1512,1523,', nbs), 0,
                                               decode(instr('1600,2010,2020,2030,2062,2063,2065,2071,2072,2073,2074,2075 ,2082,2083,2085,2102,2103,2105,2112,2113,2115 ,2122,2123,2125,2132,2133,2135,2202,2203,2205 ,2211,2212,2213,2215,2220,2232,2233,2235,2600,2605,2620,2625,2650,2655,', nbs), 0,
                                                      '1502,1515,1524,1525', '1600,2010,2020,2030,2062,2063,2065,2071:2075 ,2082,2083,2085,2102,2103,2105,2112,2113,2115 ,2122,2123,2125,2132,2133,2135,2202,2203,2205 ,2211,2212,2213,2215,2220,2232,2233,2235,2600,2605,2620,2625,2650,2655')
                                              ,'1512,1523')
                                      ,'1400:1405,1407,1410:1415,1417,1420:1424,1427,1430, 1435,1437,1440,1447,1522,3110:3115,3117,3210:3214, 3217,3010:3015,3017')
                                ,'1101,1102,1107')
                         ,'1207,1211,1212'
                         )nbs_name
        from accounts a,
             saldoa s
        where
            a.acc = s.acc and
            (s.acc, s.fdat) = (select s1.acc, max(s1.fdat) from saldoa s1 where s.acc = s1.acc and s1.fdat <= dat_ group by s1.acc) and
            nbs in
                (
                    1207,1211,1212,
                    1101,1102,1107,
                    1400,1401,1402,1403,1404,1405,1407,1410,1411,1412,1413,1414,1415,1417,1420,1421,1422,1423,1424,1427,1430,1435,1437,1440,1447,1522,3110,3011,3012,3013,3014,3115,3117,3210,3211,3212,3213,3214, 3217,3010,3011,3012,3013,3014,3015,3017,
                    1512,1523,
                    1600,2010,2020,2030,2062,2063,2065,2071,2072,2073,2074,2075 ,2082,2083,2085,2102,2103,2105,2112,2113,2115 ,2122,2123,2125,2132,2133,2135,2202,2203,2205 ,2211,2212,2213,2215,2220,2232,2233,2235,2600,2605,2620,2625,2650,2655,
                    1502,1515,1524,1525
                )
            and s.ostf < 0
            and a.MDATE between dat_ and dat_ + 31
    )
    group by nbs_pr, nbs_name
     union all
     select null "Показники", null "Вхідн_залишок", null "Сума_до_погаш", null "Перелік_рахунків" from dual
       union all
     select '   ПАСИВИ  Н4:' "Показники", null "Вхідн_залишок", null "Сума_до_погаш", null "Перелік_рахунків" from dual
       union all
     select nbs_pr||' '||kv "Показники", sum(ostq)/100 "Вхідн_залишок", null "Сума_до_погаш", nbs_name "Перелік_рахунків"
     from
     (   select decode(kv,980,'UAH','VAL') kv, gl.p_icurval(a.kv, s.ostf,dat_) ostq, nbs,
                  decode(instr('1300,1310,1602,2512,2513,2520,2523,2526,2530,2531,2540,2541,2542,2543,2544,2545,2550,2551,2552,2553,2554,2555,2560,2561,2562,2565,2570,2571,2572,2600,2601,2602,2603,2604,2605,2606,2620,2622,2625,2650,2655,3720,3340,3341,3342,3343,3344,3345,3346,3347,2920,2924,3739,', nbs
                              ), 0, nbs, 'Поточні рахунки'
                         )  nbs_pr,
                  decode(instr('1300,1310,1602,2512,2513,2520,2523,2526,2530,2531,2540,2541,2542,2543,2544,2545,2550,2551,2552,2553,2554,2555,2560:2562,2565,2570,2571,2572,2600,2601,2602,2603,2604,2605,2606,2620,2622,2625,2650,2655,3720,3340,3341,3342,3343,3344,3345,3346,3347,2920,2924,3739,', nbs
                                   ), 0, nbs, '1300,1310,1602,2512,2513,2520,2523,2526,2530,2531,2540:2545,2550:2555,2560:2562,2565,2570:2572,2600:2606,2620,2622,2625,2650,2655,3720,3340:3347,2920,2924,3739'
                              )  nbs_name
        from accounts a,
             saldoa s
        where
            a.acc = s.acc and
            (s.acc, s.fdat) = (select s1.acc, max(s1.fdat) from saldoa s1 where s.acc = s1.acc and s1.fdat <= dat_ group by s1.acc) and
            nbs in
                (
                1600,
                1610,
                1621,
                1300,1310,1602,2512,2513,2520,2523,2526,2530,2531,2540,2541,2542,2543,2544,2545,2550,2551,2552,2553,2554,2555,2560,2561,2562,2565,2570,2571,2572,2600,2601,2602,2603,2604,2605,2606,2620,2622,2625,2650,2655,3720,3340,3341,3342,3343,3344,3345,3346,3347,2920,2924,3739
                )
            and s.ostf > 0
    )
    group by nbs_pr, kv,  nbs_name
    union all
     select '   ПАСИВИ  Н5:' "Показники", null "Вхідн_залишок", null "Сума_до_погаш", null "Перелік_рахунків" from dual
       union all
     select nbs_pr "Показники", null "Вхідн_залишок", sum(ostq)/100 "Сума_до_погаш", nbs_name "Перелік_рахунків"
     from
     (   select kv, gl.p_icurval(a.kv, s.ostf,dat_) ostq, nbs,
                  decode(instr('1612,1623,', nbs), 0,
                         decode(instr('2630,2635,2637,', nbs), 0,
                                decode(instr('9000,9001,9002,9003,9020,9023,9090,9091,', nbs), 0,
                                       decode(instr('9100,9122,9129,', nbs), 0,
                                               decode(instr('9300,9350,9351,9352,9353,9354,9390,', nbs), 0,
                                                      'ІНШІ','Позабалансові рахунки')
                                              ,'Зобов"язання з кредитування')
                                      ,'Зобов"язання і вимоги')
                                ,'Депозити')
                         ,'МБК'
                         )nbs_pr,
                  decode(instr('1612,1623,', nbs), 0,
                         decode(instr('2630,2635,2637,', nbs), 0,
                                decode(instr('9000,9001,9002,9003,9020,9023,9090,9091,', nbs), 0,
                                       decode(instr('9100,9122,9129,', nbs), 0,
                                               decode(instr('9300,9350,9351,9352,9353,9354,9390,', nbs), 0,
                                                      '1310:1313,1322,1323,1325,1332,1335,1500,1610,1615, 1622,1624,2525,2546,2610,2611,2615,2617,2640:2643, 2651:2653,2656,2700,2701,2707,3300,3301,3305,3307, 3310,3311,3315,3317,3320,3327,3330,3337,3660', '9300,9350:9354,9390')
                                              ,'9100,9122,9129')
                                      ,'9000:9003,9020,9023,9090,9091')
                                ,'2630,2635,2637')
                         ,'1612,1623'
                         )nbs_name
        from accounts a,
             saldoa s
        where
            a.acc = s.acc and
            (s.acc, s.fdat) = (select s1.acc, max(s1.fdat) from saldoa s1 where s.acc = s1.acc and s1.fdat <= dat_ group by s1.acc) and
            nbs in
                (
                    1612,1623,
                    2630,2635,2637,
                    9000,9001,9002,9003,9020,9023,9090,9091,
                    9100,9122,9129,
                    9300,9350,9351,9352,9353,9354,9390,
                    1310,1311,1312,1313,1322,1323,1325,1332,1335,1500,1610,1615, 1622,1624,2525,2546,2610,2611,2615,2617,2640,2641,2642,2643, 2651,2651,2652,2653,2656,2700,2701,2707,3300,3301,3305,3307, 3310,3311,3315,3317,3320,3327,3330,3337,3660
                )
            and s.ostf > 0
            and a.MDATE between dat_ and dat_ + 31
    )
    group by nbs_pr, nbs_name
    )  t
    ;

end;
/
show err;



PROMPT ===================================================================================== 
PROMPT *** End *** ========== Scripts /Sql/BARS/Procedure/P_REP_DOD5.sql =========*** End **
PROMPT ===================================================================================== 
