set lines 1000
set trimspool on
set serveroutput on size 1000000

prompt Создание / Обновление операции 932
prompt Наименование операции: 932d (дочірня до операції 432)
declare
  cnt_  number;
begin
  --------------------------------
  -- Основные свойства операции --
  --------------------------------
  begin
    insert into tts(tt, name, dk, nlsm, kv, nlsk, kvk, nlss, nlsa, nlsb, mfob, flc, fli, flv, flr, s, s2, sk, proc, s3800, rang, flags, nazn)
    values ('932', '932d (дочірня до операції 432)', 1, '#(nbs_ob22 (''9615'',''01''))', null, '#(nbs_ob22 (''9910'',''01''))', null, null, null, null, null, 0, 0, 0, 1, null, null, null, null, null, null, '0101100000000000000000000000000000010000000000000000000000000000', 'Списання безнадійної дебіторської заборгованості за операціями з іншими активами банку за рахунок спец.резерву');
  exception
    when dup_val_on_index then 
      update tts
         set tt='932', name='932d (дочірня до операції 432)', dk=1, nlsm='#(nbs_ob22 (''9615'',''01''))', kv=null, nlsk='#(nbs_ob22 (''9910'',''01''))', kvk=null, nlss=null, nlsa=null, nlsb=null, mfob=null, flc=0, fli=0, flv=0, flr=1, s=null, s2=null, sk=null, proc=null, s3800=null, rang=null, flags='0101100000000000000000000000000000010000000000000000000000000000', nazn='Списання безнадійної дебіторської заборгованості за операціями з іншими активами банку за рахунок спец.резерву'
       where tt='932';
  end;
  --------------------------------
  ----------- Реквизиты ----------
  --------------------------------
  delete from op_rules where tt='932';
  --------------------------------
  ------ Связанные операции ------
  --------------------------------
  delete from ttsap where tt='932';
  --------------------------------
  ------- Балансовые счета -------
  --------------------------------
  delete from ps_tts where tt='932';
  --------------------------------
  -------- Виды документов -------
  --------------------------------
  delete from tts_vob where tt='932';
  --------------------------------
  -------- Группы контроля -------
  --------------------------------
  delete from chklist_tts where tt='932';
  --------------------------------
  ------------- Папки ------------
  --------------------------------
  delete from folders_tts where tt='932';
end;
/
commit;
