

PROMPT ===================================================================================== 
PROMPT *** Run *** ========== Scripts /Sql/BARS/View/V_GRC_STAFF.sql =========*** Run *** ==
PROMPT ===================================================================================== 


PROMPT *** Create  view V_GRC_STAFF ***

  CREATE OR REPLACE FORCE VIEW BARS.V_GRC_STAFF ("ID", "FIO") AS 
  SELECT s.ID, s.FIO
       FROM STAFF$BASE s
      WHERE s.id IN
               (1,                                        -- Администратор АБС
                55,                                               ---- Макаров
                71,                                             ---- Царалунга
                100,                                              ---- Ляшенко
                102,                                             ---- Пашкевич
                105,                                                 ---- Яцик
                107,                                              ---- Хихлуха
                108,                                                 ---- Ешан
                109,                                           ---- Шаповалова
                110,                                            ---- Макаренко
                111,                                              ---- Лебедев
                114,                                               -- Стешенко
                115,                                               ---- Кикоть
                116,                                               ---- Анохин
                143,                                            -- Лоенко Лена
                535,                                               -- Толмачов
                550,                                               -- Литвинов
                590,                                                  -- Семак
                601, -- Захараш
                75,                                     -- вертушка коммуналка
                97,                                        -- реестр боржникив
                98,                                  -- подкрепление коррсчета
                99,                                             -- клиент-банк
                70,                                                -- вертушка
                52,                                             -- СЭП НБУ - 1
                53,                                             -- СЭП НБУ - 2
                123,                                              -- СЕП НБУ 3
                124,                                              -- СЕП НБУ 4
                106,                              -- исполнитель журнала задач
                125,                                              -- СЕП НБУ 5
                150,                                       -- Разработчик БАРС
                888,                                       -- SWIFT процессинг
                889,                                       -- ПРИОКОМ вертушка
                890,                                       -- ПРИОКОМ вертушка
                999                                             -- БАРС-Тестер
                   )
   ORDER BY s.id;

PROMPT *** Create  grants  V_GRC_STAFF ***
grant SELECT                                                                 on V_GRC_STAFF     to BARSREADER_ROLE;
grant SELECT                                                                 on V_GRC_STAFF     to BARS_ACCESS_DEFROLE;
grant SELECT                                                                 on V_GRC_STAFF     to START1;
grant SELECT                                                                 on V_GRC_STAFF     to UPLD;



PROMPT ===================================================================================== 
PROMPT *** End *** ========== Scripts /Sql/BARS/View/V_GRC_STAFF.sql =========*** End *** ==
PROMPT ===================================================================================== 
