CREATE OR REPLACE FORCE VIEW BARS.V_STZAH
(
   ID,
   ZAHID,
   PRODU
)
AS
   SELECT '1' id,
          '1 Котли з використанням будь-яких видів палива та енергії (за винятком природного газу та електроенергії (крім  електричного теплоакумуляційного обігріву та гарячого водопостачання) та відповідного додаткового обладнання і матеріалів до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220257','220380') PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          '1 Котли з використанням будь-яких видів палива та енергії (за винятком природного газу та електроенергії (крім  електричного теплоакумуляційного обігріву та гарячого водопостачання) та відповідного додаткового обладнання і матеріалів до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220257','220380') PRODU
     FROM DUAL
   UNION ALL
   SELECT '3' id,
          '1 Котли з використанням будь-яких видів палива та енергії (за винятком природного газу та електроенергії (крім  електричного теплоакумуляційного обігріву та гарячого водопостачання) та відповідного додаткового обладнання і матеріалів до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220257','220380') PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          '1 Котли з використанням будь-яких видів палива та енергії (за винятком природного газу та електроенергії (крім  електричного теплоакумуляційного обігріву та гарячого водопостачання) та відповідного додаткового обладнання і матеріалів до них'
             ZAHID,
          '220347' PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          '1 Котли з використанням будь-яких видів палива та енергії (за винятком природного газу та електроенергії (крім  електричного теплоакумуляційного обігріву та гарячого водопостачання) та відповідного додаткового обладнання і матеріалів до них'
             ZAHID,
          '220347' PRODU
     FROM DUAL
   UNION ALL
   SELECT '3' id,
          '1 Котли з використанням будь-яких видів палива та енергії (за винятком природного газу та електроенергії (крім  електричного теплоакумуляційного обігріву та гарячого водопостачання) та відповідного додаткового обладнання і матеріалів до них'
             ZAHID,
          '220347' PRODU
     FROM DUAL
   UNION ALL
   SELECT '3' id,
          '1 Радіатори опалення, регулятори температури повітря (в тому числі автоматичні) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '3' id,
          '2 Вікна та балконні двері з енергозберігаючим склом (крім однокамерних) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '3' id,
          '3 Вузли обліку води (гарячої, холодної) та теплової енергії, зокрема засоби вимірювальної техніки (прилади обліку, лічильники) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '3' id,
          '4 Багатозонний (багатотарифний) прилад обліку електричної енергії (лічильник активної електричної енергії) та відповідне додаткове обладнання і матеріали до нього'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '3' id,
          '1 Радіатори опалення, регулятори температури повітря (в тому числі автоматичні) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '3' id,
          '2 Вікна та балконні двері з енергозберігаючим склом (крім однокамерних) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '3' id,
          '3 Вузли обліку води (гарячої, холодної) та теплової енергії, зокрема засоби вимірювальної техніки (прилади обліку, лічильники) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '3' id,
          '4 Багатозонний (багатотарифний) прилад обліку електричної енергії (лічильник активної електричної енергії) та відповідне додаткове обладнання і матеріали до нього'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          '1 Радіатори опалення, регулятори температури повітря (в тому числі автоматичні) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          '2 Вікна та балконні двері з енергозберігаючим склом (крім однокамерних) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          '3 Рекуператори тепла вентиляційного повітря та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          '4 Вузли обліку води (гарячої, холодної), зокрема засоби вимірювальної техніки (прилади обліку, лічильники) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          '5 Багатозонний (багатотарифний) прилад обліку електричної енергії (лічильник активної електричної енергії) та відповідне додаткове обладнання і матеріали до нього'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          '6 Обладнання і матеріали для проведення робіт з теплоізоляції (термомодернізації) зовнішніх стін, підвальних приміщень, горищ, покрівель та фундаментів'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          '7 Теплонасосна система опалення та/або гарячого водопостачання та відповідне додаткове обладнання і матеріали до неї'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          '8 Система сонячного теплопостачання та/або гарячого водопостачання та відповідне додаткове обладнання і матеріали до неї'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          '1 Радіатори опалення, регулятори температури повітря (в тому числі автоматичні) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          '2 Вікна та балконні двері з енергозберігаючим склом (крім однокамерних) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          '3 Рекуператори тепла вентиляційного повітря та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          '4 Вузли обліку води (гарячої, холодної), зокрема засоби вимірювальної техніки (прилади обліку, лічильники) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          '5 Багатозонний (багатотарифний) прилад обліку електричної енергії (лічильник активної електричної енергії) та відповідне додаткове обладнання і матеріали до нього'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          '6 Обладнання і матеріали для проведення робіт з теплоізоляції (термомодернізації) зовнішніх стін, підвальних приміщень, горищ, покрівель та фундаментів'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          '7 Теплонасосна система опалення та/або гарячого водопостачання та відповідне додаткове обладнання і матеріали до неї'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '1' id,
          '8 Система сонячного теплопостачання та/або гарячого водопостачання та відповідне додаткове обладнання і матеріали до неї'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          '1 Радіатори опалення, регулятори температури повітря (в тому числі автоматичні) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          '2 Вікна та балконні двері з енергозберігаючим склом (крім однокамерних) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          '3 Рекуператори тепла вентиляційного повітря та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          '4 Вузли обліку води (гарячої, холодної), зокрема засоби вимірювальної техніки (прилади обліку, лічильники) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          '5 Багатозонний (багатотарифний) прилад обліку електричної енергії (лічильник активної електричної енергії) та відповідне додаткове обладнання і матеріали до нього'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          '6 Обладнання і матеріали для проведення робіт з теплоізоляції (термомодернізації) зовнішніх стін, підвальних приміщень, горищ, покрівель та фундаментів'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          '7 Теплонасосна система опалення та/або гарячого водопостачання та відповідне додаткове обладнання і матеріали до неї'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          '8 Система сонячного теплопостачання та/або гарячого водопостачання та відповідне додаткове обладнання і матеріали до неї'
             ZAHID,
          decode(NEWNBS.GET_STATE,0,'220258','220381') PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          '1 Радіатори опалення, регулятори температури повітря (в тому числі автоматичні) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          '2 Вікна та балконні двері з енергозберігаючим склом (крім однокамерних) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          '3 Рекуператори тепла вентиляційного повітря та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          '4 Вузли обліку води (гарячої, холодної), зокрема засоби вимірювальної техніки (прилади обліку, лічильники) та відповідне додаткове обладнання і матеріали до них'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          '5 Багатозонний (багатотарифний) прилад обліку електричної енергії (лічильник активної електричної енергії) та відповідне додаткове обладнання і матеріали до нього'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          '6 Обладнання і матеріали для проведення робіт з теплоізоляції (термомодернізації) зовнішніх стін, підвальних приміщень, горищ, покрівель та фундаментів'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          '7 Теплонасосна система опалення та/або гарячого водопостачання та відповідне додаткове обладнання і матеріали до неї'
             ZAHID,
          '220348' PRODU
     FROM DUAL
   UNION ALL
   SELECT '2' id,
          '8 Система сонячного теплопостачання та/або гарячого водопостачання та відповідне додаткове обладнання і матеріали до неї'
             ZAHID,
          '220348' PRODU
     FROM DUAL;



GRANT SELECT ON BARS.V_STZAH TO BARS_ACCESS_DEFROLE;

GRANT SELECT ON BARS.V_STZAH TO START1;
