PROMPT *** Run *** ========== Scripts SQL\Data\data_fin_question.sql  =========*** Run *** =====

begin 
  execute immediate 
    ' ALTER TABLE BARS.FIN_QUESTION MODIFY(NAME VARCHAR2(512 BYTE))';
exception when others then 
  if sqlcode=-904 then null; else raise; end if;
end;
/

declare

procedure add_question ( p_name       fin_question.name%type,
                         p_ord        fin_question.ord%type,
                         p_kod        fin_question.kod%type,
                         p_idf        fin_question.idf%type,
						 p_descript   fin_question.descript%type default null, 
						 p_pob        fin_question.pob%type default 0
						 
                    )
as
l_ques  fin_question%rowtype;
begin

   l_ques.name       :=   p_name     ;
   l_ques.ord        :=   p_ord      ;
   l_ques.kod        :=   p_kod      ;
   l_ques.idf        :=   p_idf      ;
   l_ques.pob        :=   p_pob      ;
   l_ques.descript   :=   p_descript ;
   
   
      
 insert into fin_question 
      values l_ques;
exception when dup_val_on_index then 
  update fin_question
    set  row  = l_ques
  where  kod  = l_ques.kod and
         idf  = l_ques.idf ;    
end;

procedure add_question_rep ( p_kod        fin_question_reply.kod%type,
                             p_name       fin_question_reply.name%type,
                             p_ord        fin_question_reply.ord%type,
							 p_val        fin_question_reply.val%type,
                             p_idf        fin_question_reply.idf%type
							 
                    )
as
l_ques  fin_question_reply%rowtype;
begin

   l_ques.name       :=   p_name     ;
   l_ques.ord        :=   p_ord      ;
   l_ques.kod        :=   p_kod      ;
   l_ques.idf        :=   p_idf      ;
   l_ques.val        :=   p_val      ;
   
      
 insert into fin_question_reply 
      values l_ques;
exception when dup_val_on_index then 
  update fin_question_reply
    set  row  = l_ques
  where  kod  = l_ques.kod and
         ord  = l_ques.ord and
         idf  = l_ques.idf ;    
end;


Begin



add_question('Прострочка від 30 до 90 днів', 6,'FP6', 32 );
add_question_rep('FP6','Ні'           ,1,0,32);
add_question_rep('FP6','Так'          ,2,1,32);

add_question('прострочка 90 днів і більше', 7,'FP7', 32 );
add_question_rep('FP7','Ні'           ,1,0,32);
add_question_rep('FP7','Так'          ,2,1,32);
 
/* ************************************
   Групи під спільним контролем
************************************* */


add_question('Відємне значення капіталу', 1,'RG1', 59, null, 1 );
add_question_rep('RG1','Ні'           ,1,0,59);
add_question_rep('RG1','Так'          ,2,1,59);

add_question('Співідношення зобовязань до чистого доходу від реалізованої продкуції більше 2,5', 2,'RG2', 59, null, 1 );
add_question_rep('RG2','Ні'           ,1,0,59);
add_question_rep('RG2','Так'          ,2,1,59);

add_question('Співідношення зобовязання до операціного прибутку ', 3,'RG3', 59, null, 1 ); --більше 5 або  рівне 0
add_question_rep('RG3','Ні'           ,1,0,59);
add_question_rep('RG3','Так'          ,2,1,59);

add_question('Відсутня достатність виручки Групи', 4,'RG4', 59, null, 0 );
add_question_rep('RG4','Ні'           ,1,0,59);
add_question_rep('RG4','Так'          ,2,1,59);

delete from  fin_question_reply where  kod = 'RG4' and idf = 59;
delete from  fin_question where  kod = 'RG4' and idf = 59;



/* ***************************************
   Юридичні особи
***************************************** */
delete from  fin_question_reply where  kod = 'NGRK' and idf = 51;
add_question('Належність до групи під спільним контролем', 1,'NGRK', 51 );
add_question_rep('NGRK','Ні' ,0,0,51);
add_question_rep('NGRK','Так',1,1,51);

add_question('Належність до групи пов`язаних осіб', 1,'NGRP', 51 );
add_question_rep('NGRP','Ні' ,0,0,51);
add_question_rep('NGRP','Так',1,1,51);


add_question('Відсутня можливість здійснити аналіз впливу', 1,'GRPA', 51 );
add_question_rep('GRPA','Ні' ,0,0,51);
add_question_rep('GRPA','Так',1,1,51);

add_question('Наявність консолідованої звітності', 1,'NKZV', 51 );
add_question_rep('NKZV','Ні' ,1,0,51);
add_question_rep('NKZV','Так',2,1,51);





--  Наявність консолідованої звітності - No
add_question('Вплив групи', 1,'GK20', 51 );
add_question_rep('GK20','Ні' ,1,0,51);
add_question_rep('GK20','Так',2,1,51);


-- "Клас контрагента нижчий за клас групи під спільним контролем
add_question('Вплив групи', 1,'GK21', 51 );
add_question_rep('GK21','Ні' ,1,0,51);
add_question_rep('GK21','Так',2,1,51);

add_question('Наявність судження банку', 1,'GK11', 51 );
add_question_rep('GK11','Ні' ,1,0,51);
add_question_rep('GK11','Так',2,1,51);

-- Клас контрагента вищий за клас групи під спільним контролем
add_question('Вплив групи', 1,'GK22', 51 );
add_question_rep('GK22','Ні' ,1,0,51);
add_question_rep('GK22','Так',2,1,51);

add_question('Наявність судження банку', 1,'GK12', 51 );
add_question_rep('GK12','Ні' ,1,0,51);
add_question_rep('GK12','Так',2,1,51);


add_question('Консолідована фінансова звітність групи має позитивний висновок аудиторського звіту', 1,'GK3', 51 );
add_question_rep('GK3','Ні' ,1,0,51);
add_question_rep('GK3','Так',2,1,51);

add_question('Висновок аудиторського звіту не містить застереженьщодо периметра консолідованої звітності групи', 1,'GK4', 51 );
add_question_rep('GK4','Ні' ,1,0,51);
add_question_rep('GK4','Так',2,1,51);

add_question('Борг контрагента в повній сумі забезпечено гарантією материнською компанією та учасника групи', 1,'GK5', 51 );
add_question_rep('GK5','Ні' ,1,0,51);
add_question_rep('GK5','Так',2,1,51);


-- ******Належність до групи пов`язаних осіб
 delete from BARS.FIN_QUESTION_REPLY where idf = 5 and kod like 'GP_';
 delete from BARS.FIN_QUESTION where idf = 5 and kod like 'GP_';
 
add_question('Позичальник входить до групи під спільним контролем та надана консолідованафінансова звітність', 1,'GP1', 51 );
add_question_rep('GP1','Ні' ,1,0,51);
add_question_rep('GP1','Так',2,1,51);

add_question('Контрагент належить до ОСББ/ЖБК', 2,'GP2', 51 );
add_question_rep('GP2','Ні' ,1,0,51);
add_question_rep('GP2','Так',2,1,51);

add_question('Забезпечення за кредитною операцією Позичальнника є грошові кошти (у т.ч. грошове покриття) та/або майнові права на грошові кошти, що розміщені на депозитному рахунку  в установі банку, коофіциент покритт я заборгованості за основною сумою становить не менше 1,0', 3,'GP3', 51 );
add_question_rep('GP3','Ні' ,1,0,51);
add_question_rep('GP3','Так',2,1,51);

add_question('Контрагент є Ключовим учасником группи пов`язаних контрагентів', 4,'GP4', 51 );
add_question_rep('GP4','Ні' ,1,0,51);
add_question_rep('GP4','Так',2,1,51);

add_question('Відсутня можливість здійснити аналіз впливу', 5,'GP5', 51 );
add_question_rep('GP5','Ні' ,1,0,51);
add_question_rep('GP5','Так',2,1,51);
--****** 5
add_question('Функціонування Ключового учасника менше одного року (для Контрагентів, функціонування яких менше одного року з дати державної реєстрації, крім випадків реструктуризації)', 6,'GP6', 51 );
add_question_rep('GP6','Ні' ,1,0,51);
add_question_rep('GP6','Так',2,1,51);

add_question('У Ключового учасника наявна прострочена заборгованість перед Банком та/або іншими банківськими установами строком більше 30 днів', 7,'GP7', 51 );
add_question_rep('GP7','Ні' ,1,0,51);
add_question_rep('GP7','Так',2,1,51);

add_question('У Ключового учасника від’ємне значення власного капіталу на дату оцінки фінансового стану Контрагента та/або за останній звітній рік', 8,'GP8', 51 );
add_question_rep('GP8','Ні' ,1,0,51);
add_question_rep('GP8','Так',2,1,51);

add_question('У Ключового учасника наявна збиткова діяльність за останній звітний період та/або останній звітний рік', 9,'GP9', 51 );
add_question_rep('GP9','Ні' ,1,0,51);
add_question_rep('GP9','Так',2,1,51);
--*** 8
add_question('У Ключового учасника, що є нерезидентом, відсутній рейтинг, підтверджений провідним світовим рейтинговим агентством', 10,'GP10', 51 );
add_question_rep('GP10','Ні' ,1,0,51);
add_question_rep('GP10','Так',2,1,51);

add_question('У будь-якого учасника (крім Ключового учасника) групи пов’язаних контрагентів наявна прострочена заборгованість перед Банком та/або іншими банківськими установами строком більше 90 днів', 11,'GP11', 51 );
add_question_rep('GP11','Ні' ,1,0,51);
add_question_rep('GP11','Так',2,1,51);

add_question('У Ключового учасника від’ємне значення власного капіталу на дату оцінки фінансового стану Контрагента та протягом трьох останніх звітних років', 12,'GP12', 51 );
add_question_rep('GP12','Ні' ,1,0,51);
add_question_rep('GP12','Так',2,1,51);

add_question('У Ключового учасника наявна збиткова діяльність за останній звітний період та за результатами діяльності трьох останніх звітних років', 13,'GP13', 51 );
add_question_rep('GP13','Ні' ,1,0,51);
add_question_rep('GP13','Так',2,1,51);
--*** 10
add_question('У ключового учасника наявна прострочена заборгованість перед Банком та/або іншими банківськими установами строком більше  90 днів', 14,'GP14', 51 );
add_question_rep('GP14','Ні' ,1,0,51);
add_question_rep('GP14','Так',2,1,51);

add_question('Ключовий учасник, заявив про банкрутство', 15,'GP15', 51 );
add_question_rep('GP15','Ні' ,1,0,51);
add_question_rep('GP15','Так',2,1,51);

add_question(' Ключового учасника визнано банкрутом/розпочато процедуру ліквідації (припинення) в установленому законодавством порядку', 16,'GP16', 51 );
add_question_rep('GP16','Ні' ,1,0,51);
add_question_rep('GP16','Так',2,1,51);

add_question('Банк порушив проти Ключового учасника, справу про банкрутство у встановленому законодавством України порядку', 17,'GP17', 51 );
add_question_rep('GP17','Ні' ,1,0,51);
add_question_rep('GP17','Так',2,1,51);

add_question('У Ключового учасника хоча б один із зовнішніх рейтингів боржника згідно з міжнародною рейтинговою шкалою', 18,'GP18', 51 );
add_question_rep('GP18','Ні' ,1,0,51);
add_question_rep('GP18','Так',2,1,51);












 
/*
add_question('Забезпеченням за кредитом  Позичальника є грошові кошти, коофіциент покриття заборгованості за основною сумою становить не менше 1,0 ', 6,'GP6', 51 );
add_question_rep('GP6','Ні' ,1,0,51);
add_question_rep('GP6','Так',2,1,51);


add_question('Валюта балансу Контрагента  становить 60% та більше валюти балансу групи пов`явзаних контрагентів', 2,'GP2', 51 );
add_question_rep('GP2','Ні' ,1,0,51);
add_question_rep('GP2','Так',2,1,51);


add_question('Чиста виручка від реалізації товару  Контрагента  становить 60% та більше Чиста виручка від реалізації товару  групи пов`явзаних контрагентів', 3,'GP3', 51 );
add_question_rep('GP3','Ні' ,1,0,51);
add_question_rep('GP3','Так',2,1,51);


add_question('До аналізу групи пов`язаних контрагентів включено  юридичних осіб, валюта балансу яких становить не менше 80% валюти балансу групи пов`явзаних контрагентів', 4,'GP4', 51 );
add_question_rep('GP4','Ні' ,1,0,51);
add_question_rep('GP4','Так',2,1,51);


add_question('До аналізу групи включено юр.особа, Чиста виручка від реалізації товару яких становить не менше 80% Чиста виручка групи пов`явзаних контрагентів', 5,'GP5', 51 );
add_question_rep('GP5','Ні' ,1,0,51);
add_question_rep('GP5','Так',2,1,51);

--********

add_question('Функціонування материнської компанії, яка генерує більше 60% грошових потоків групи або володіє активами групи не менше 60% менше 2х років', 7,'GP7', 51 );
add_question_rep('GP7','Ні' ,1,0,51);
add_question_rep('GP7','Так',2,1,51);

add_question('70% або більше виручки від реалізації товарів Котрагентів забезпечуєтсья учасниками групи пов`язаних контрагентів ', 8,'GP8', 51 );
add_question_rep('GP8','Ні' ,1,0,51);
add_question_rep('GP8','Так',2,1,51);

add_question('70% чи більше  витрат Контрагента фінансуються за рахунок групи пов`язаних контрагентів ', 9,'GP9', 51 );
add_question_rep('GP9','Ні' ,1,0,51);
add_question_rep('GP9','Так',2,1,51);


--********

add_question('Материнська компанія/контролер/провідний учасник групи є нерезедентом та немає рейтенгу, підтвердженого провідним світовим рейтинговим агенством ', 10,'GP10', 51 );
add_question_rep('GP10','Ні' ,1,0,51);
add_question_rep('GP10','Так',2,1,51);

add_question('У будь-якого учасника групи наявна прострочена заборгованість перед Банком або іншими банківськитми установами строком більше 90 днів', 11,'GP11', 51 );
add_question_rep('GP11','Ні' ,1,0,51);
add_question_rep('GP11','Так',2,1,51);

add_question('Кредит надається Контрагенту на погашення кредиту іншого учасника групи, який використаний для погашення кредиту третього учасника групи', 12,'GP12', 51 );
add_question_rep('GP12','Ні' ,1,0,51);
add_question_rep('GP12','Так',2,1,51);


--********
add_question('Материнська компанія/контролер/провідний учасник групи є нерезедентом та її рейтенг, підтверджений провідним світовим рейтинговим агенством, понижено до рівня дефолту', 13,'GP13', 51 );
add_question_rep('GP13','Ні' ,1,0,51);
add_question_rep('GP13','Так',2,1,51);

add_question('Материнська компанія або провідний учасник групи заявила про банкрутсво', 14,'GP14', 51 );
add_question_rep('GP14','Ні' ,1,0,51);
add_question_rep('GP14','Так',2,1,51);

add_question('Материнську компанію або провідного учасника группи визнано банкрутом/ розпочато процедуру ліквідації (припинення) в установленому законодавством порядку', 15,'GP15', 51 );
add_question_rep('GP15','Ні' ,1,0,51);
add_question_rep('GP15','Так',2,1,51);

add_question('Банк порушив проти материнської компанії або провідного учасника групи справу про банкрутство у встановленому законодавством України порядку ', 16,'GP16', 51 );
add_question_rep('GP16','Ні' ,1,0,51);
add_question_rep('GP16','Так',2,1,51);

add_question('Аналіз грошових надходжень групи пов`язаних контрагентів свідчить про відсутність фінансових можливостей виконати фінансові зобов`язання групи пов`язаних контрагентів в цілому', 17,'GP17', 51 );
add_question_rep('GP17','Ні' ,1,0,51);
add_question_rep('GP17','Так',2,1,51);
*/
-- **************************************************************************************

add_question('Період подання звітності', 1,'TZVT', 6 );
delete from  fin_question_reply where  kod = 'TZVT' and idf = 6;
add_question_rep('TZVT','Квартальна' ,1,3,6);
add_question_rep('TZVT','Річна',3,12,6);

/*
add_question('Наявність джерел надходження валютної виручки в обсязі, достатньому для погашення боргу протягом дії договору ', 6,'KP61', 5 );
add_question_rep('KP61','Ні' ,1,0,5);
add_question_rep('KP61','Так',2,1,5);
*/

 delete from BARS.FIN_QUESTION_REPLY where idf = 5 and kod = 'KP6';
 delete from BARS.FIN_QUESTION where idf = 5 and kod = 'KP6';

 delete from FIN_QUESTION_REPLY where kod = 'KP61' and idf = 5;
 delete from FIN_QUESTION where kod = 'KP61' and idf = 5;
 commit;

 


--==    Ознаки кредитного ризику
add_question('Контрагент створений шляхом реорганізації', 1,'KSR', 52 );
add_question_rep('KSR','Ні'           ,1,0,52);
add_question_rep('KSR','Так'          ,2,1,52);

add_question('Спрямування кредиту наданого Конраг.А на погашення Кредиту Контраг.Б, що був використаний для погашення кредиту Контраг.С', 2,'SKK', 52 );
add_question_rep('SKK','Ні'           ,1,0,52);
add_question_rep('SKK','Так'          ,2,1,52);

add_question('Контрагент має від`ємне значення капіталу протягом 3 останніх років', 3,'KVZK', 52, null, 1 );
add_question_rep('KVZK','Ні'           ,1,0,52);
add_question_rep('KVZK','Так'          ,2,1,52);

add_question('Порушення вимогщодо одночасного виконання співідношення чистої кредитної заборгованості до чистої виручки від реалізації', 4,'PVKZ', 52, null, 1 );
add_question_rep('PVKZ','Ні'           ,1,0,52);
add_question_rep('PVKZ','Так'          ,2,1,52);

add_question('Наявність у Банку інформації щодо кредитної історії Контрагента в частині його класифікації за класом 10 ', 5,'KIKK', 52, '', 1 );
add_question_rep('KIKK','Ні'           ,1,0,52);
add_question_rep('KIKK','Так'          ,2,1,52);

--==

add_question('Динаміка фактичних значень інтегрального показника', 7,'IP1', 50, 'Позитивна-Відбулося збільшення значення інтегрального показника
Незмінна-Значення інтегрального показника не зазнало змін
Негативна-Відбулося зменшення значення інтегрального показника
', 1 );
add_question_rep('IP1','Позитивна'          ,1,1,50);
add_question_rep('IP1','Незмінна'           ,2,2,50);
add_question_rep('IP1','Негативна'          ,3,3,50);

add_question('Зважений коефіцієнт покриття боргу забезпеченням', 8,'IP2', 50, 'Високий-Покриття основної суми боргу забезпеченням, зваженим на ризик та визначеним в п. 1-26 додатку 4, становить >=  1,3
Добрий-Покриття основної суми боргу забезпеченням, зваженим на ризик та визначеним в п. 1-26 додатку 4, становить >=  1,0
Низький-Покриття основної суми боргу забезпеченням, зваженим на ризик та визначеним в п. 1-26 додатку 4, становить < 1,0, Покриття основної суми боргу іншим забезпеченням ніж визначено в п. 1-26 додатку 4 або забезпечення відсутнє
', 0 );
add_question_rep('IP2','Високий'          ,1,1,50);
add_question_rep('IP2','Добрий'           ,2,2,50);
add_question_rep('IP2','Низький'          ,3,3,50);


add_question('Наявність та активність ринків збуту продукції', 9,'IP3', 50, 'Позитивна-Спостерігається збільшення темпу приросту виручки від реалізації контрагентом Банку продукції (товарів/робіт/послуг) в порівнянні з попереднім звітним періодом (DДВ > 0) 
Незмінна-Темп приросту виручки від реалізації контрагентом Банку продукції (товарів/робіт/послуг) в порівнянні з попереднім звітним періодом не зазнала змін (DДВ = 0) 
Негативна-Спостерігається зменшення темпу приросту виручки від реалізації контрагентом Банку продукції (товарів/робіт/послуг) в порівнянні з попереднім звітним періодом (DДВ < 0) 
', 1 );
add_question_rep('IP3','Позитивна'         ,1,1,50);
add_question_rep('IP3','Незмінна'          ,2,2,50);
add_question_rep('IP3','Негативна'         ,3,3,50);

add_question('Якість менеджменту', 10,'IP4', 50, 'Виключно позитивна-генеральний менеджер знаходиться у бізнесі більше 7 років, з них більше 4 років в даній компанії; досконала фінансова звітність; добре організований фінансовий план та бюджет; добре організований бізнес
Позитивна-генеральний менеджер знаходиться у бізнесі більше 4 років, з них більше 2 в даній компанії; адекватна фінансова звітність; достатньо добре організований фінансовий план та бюджет; організаційні недоліки не виявлені
Добра-генеральний менеджер може справлятися з бізнесом даного типу; адекватна фінансова звітність; часто не виконується фінансовий план та бюджет; наявні випадкові неочікувані потреби у великому капіталі; організаційні недоліки не виявлені
Задовільна-здатність генерального менеджера управляти бізнесом сумнівна; неадекватна фінансова звітність; невідповідний фінансовий план та бюджет 
Негативна-генеральний менеджер має слабку уяву про свою роботу; не складаються фінансові звіти; невідповідний фінансовий план та бюджет
', 0 );
add_question_rep('IP4','Виключно позитивна'  ,1,1,50);
add_question_rep('IP4','Позитивна'           ,2,2,50);
add_question_rep('IP4','Добра'               ,3,3,50);
add_question_rep('IP4','Задовільна'          ,4,4,50);
add_question_rep('IP4','Негативна'           ,5,5,50);

add_question('Наявність та стан виконання бізнес-плану/ТЕО', 11,'IP5', 50, 'Добрий-Бізнес-план/ТЕО виконуються
Задовільний-Бізнес-план/ТЕО виконується частково
Негативний-Бізнес-план/ТЕО не виконуються
', 0 );
add_question_rep('IP5','Добрий'              ,1,1,50);
add_question_rep('IP5','Задовільний'         ,2,2,50);
add_question_rep('IP5','Негативний'          ,3,3,50); 



-- ===== Подія дефолту
add_question('Резерв під зменшення корисності наданого Контрагенту фінансового активу становить 50 та більше відсотків боргу', 1,'PD1', 53,
'сформований Банком резерв під зменшення корисності 
наданого Контрагенту фінансового активу становить 50 
та більше відсотків боргу', 1 );
add_question_rep('PD1','Ні'           ,1,0,53);
add_question_rep('PD1','Так'          ,2,1,53);


add_question('Реструктуризація передбачає прощення частини боргу та/або капіталізацію або заміну на інший актив нарахованих та несплачених відс. > 90 кал.дн. поспіль', 2,'PD2', 53,
'внесені зміни до умов договору, в тому числі пов’язані 
з реструктуризацією боргу [крім: реструктуризації боргу, 
яка проводиться згідно з вимогами Законів України “Про 
фінансову реструктуризацію” та за якою Контрагентом 
виконуються умови договору], передбачають:
•	прощення частини боргу та/або,
•	капіталізацію або заміну на інший актив нарахованих 
    та несплачених відсотків за більш ніж 90 календарних 
	днів поспіль ' );
add_question_rep('PD2','Ні'           ,1,0,53);
add_question_rep('PD2','Так'          ,2,1,53);

add_question('Контрагент заявив про банкрутство', 3,'PD3', 53 );
add_question_rep('PD3','Ні'           ,1,0,53);
add_question_rep('PD3','Так'          ,2,1,53);


add_question('Контрагента визнано банкрутом/розпочато процедуру ліквідації (припинення) юридичної особи в установленому законодавством порядку', 4,'PD4', 53 );
add_question_rep('PD4','Ні'           ,1,0,53);
add_question_rep('PD4','Так'          ,2,1,53);


add_question('Банк порушив проти Контрагента справу про банкрутство у встановленому законодавством України порядку', 5,'PD5', 53 );
add_question_rep('PD5','Ні'           ,1,0,53);
add_question_rep('PD5','Так'          ,2,1,53);



add_question('Банком ухвалено рішення про конвертацію (переведення) частини або всієї суми боргу Контрагента в капітал Контрагента', 6,'PD6', 53,
'Банком ухвалено рішення про конвертацію (переведення) 
частини або всієї суми боргу Контрагента в капітал 
Контрагента(за виключенням випадків, передбачених 
Законом України “Про фінансову реструктуризацію”);' );
add_question_rep('PD6','Ні'           ,1,0,53);
add_question_rep('PD6','Так'          ,2,1,53);

add_question('Рейтинг боржника згідно з міжнародною рейтинговою шкалою', 7,'PD7', 53,
'Рейтинг боржника згідно з міжнародною рейтинговою шкалою, 
підтверджений агентством (компанією) Standard$Poor’s, 
або іншим провідним світовим рейтинговим агентством (компанією)' );
add_question_rep('PD7','AAA'           ,1 ,2,53);
add_question_rep('PD7','AA'            ,2 ,3,53);
add_question_rep('PD7','A'             ,3 ,4,53);
add_question_rep('PD7','BBB'           ,4 ,5,53);
add_question_rep('PD7','BB'            ,5 ,6,53);
add_question_rep('PD7','B'             ,6 ,7,53);
add_question_rep('PD7','CCC'           ,7 ,8,53);
add_question_rep('PD7','CC'            ,8 ,9,53);
add_question_rep('PD7','C'             ,9 ,10,53);
add_question_rep('PD7','SD'            ,10,11,53);
add_question_rep('PD7','D'             ,11,1,53);
add_question_rep('PD7','NR'            ,0, 0,53);

add_question('Відбулась повторна/наступна заміна активу на інший актив', 8,'PD8', 53 );
add_question_rep('PD8','Ні'           ,1,0,53);
add_question_rep('PD8','Так'          ,2,1,53);

add_question('Внесені зміни до умов договору, не пов’язані з реструктуризацією, в частині збільшення строків користування активом', 9,'PD9', 53,
'Внесені зміни до умов договору, не пов’язані з 
реструктуризацією, в частині збільшення строків 
користування активом, наданим Контрагенту, який 
не спроможний погасити борг без реалізації застави, 
попри відсутність на дату оцінки кредитного ризику 
прострочення погашення боргу' );
add_question_rep('PD9','Ні'           ,1,0,53);
add_question_rep('PD9','Так'          ,2,1,53);

add_question('За одним із активів боржника/контрагента відбулось списання боргу за рахунок сформованого резерву', 10,'PD10', 53 );
add_question_rep('PD10','Ні'           ,1,0,53);
add_question_rep('PD10','Так'          ,2,1,53);


add_question('За одним із активів Контрагента відбувся продаж зі збитком в обсязі 20 або більше відсотків боргу', 11,'PD11', 53 );
add_question_rep('PD11','Ні'           ,1,0,53);
add_question_rep('PD11','Так'          ,2,1,53);

add_question('За одним із активів Контрагента, який є лізингоотримувачем, відбулось анулювання Банком лізингового договору', 12,'PD12', 53,
'За одним із активів/часткою активу Контрагента, який 
є лізингоотримувачем, відбулось анулювання Банком 
лізингового договору в зв’язку з порушенням Контрагентом 
(лізингоотримувачем) умов договору' );
add_question_rep('PD12','Ні'           ,1,0,53);
add_question_rep('PD12','Так'          ,2,1,53);

add_question('Продаж Банком активу з відстроченням платежу більш ніж на 7 календарних днів, на дату оцінки сплачено <30% його вартості', 13,'PD13', 53,
'продаж Банком активу з відстроченням платежу більш ніж 
на 7 календарних днів відповідно до умов договору про 
продаж активу (у т.ч. із урахуванням внесених змін до 
договору про продаж активу), при цьому на дату оцінки 
кредитного ризику Контрагент, що купує актив, сплатив 
Банку менше 30% його вартості або сплату за активом не здійснював ' );
add_question_rep('PD13','Ні'           ,1,0,53);
add_question_rep('PD13','Так'          ,2,1,53);

add_question('Продаж Банком активу з відстроченням платежу більш ніж на 7 календарних днів, при цьому Контрагент сплачує за активом одним платежем у кінці строку дії договору', 14,'PD14', 53,
'продаж Банком активу з відстроченням платежу більш ніж 
на 7 календарних днів відповідно до умов договору про 
продаж активу (у т.ч. із урахуванням внесених змін до 
договору про продаж активу), при цьому Контрагент сплачує 
за активом одним платежем у кінці строку дії договору про 
продаж активу або сплачує більшу частку вартості активу 
наближено до кінця строку дії договору про продаж активу' );
add_question_rep('PD14','Ні'           ,1,0,53);
add_question_rep('PD14','Так'          ,2,1,53);

add_question('Контрагент, що є емітентом цінних паперів,  включений до списку емітентів, що мають ознаки фіктивності', 15,'PD15', 53,
'Контрагент, що є емітентом цінних паперів, згідно 
з порядком, передбаченим нормативно-правовим актом 
Національної комісії з цінних паперів та фондового 
ринку, включений до списку емітентів, що мають ознаки 
фіктивності' );
add_question_rep('PD15','Ні'           ,1,0,53);
add_question_rep('PD15','Так'          ,2,1,53);

add_question('Контрагент має затримку погашення номінальної вартості або процентів понад сім календарних днів за борговими цінними паперами', 16,'PD16', 53 );
add_question_rep('PD16','Ні'           ,1,0,53);
add_question_rep('PD16','Так'          ,2,1,53);


add_question('Немає фінансової звітності боржника – юридичної особи за останній звітний період понад три місяці після термінів подання ', 17,'PD17', 53 ,
'', 1);
add_question_rep('PD17','Ні'           ,1,0,53);
add_question_rep('PD17','Так'          ,2,1,53);

add_question('Немає розшифрування даних форми № 2 (2-м, 2-мс) “Звіт про фінансові результати” (графа 2000) за останній звітний рік щодо структури доходів', 18,'PD20', 53 ,
'Немає розшифрування даних форми № 2 (2-м, 2-мс) “Звіт про фінансові результати” (графа 2000) Положень (стандартів) бухгалтерського обліку 1 або 25 річної фінансової звітності боржника – юридичної особи за останній звітний рік щодо структури доходів
', 1);
add_question_rep('PD20','Ні'           ,1,0,53);
add_question_rep('PD20','Так'          ,2,1,53);


add_question('Фінансова звітність боржника, не відповідає вимогам Закону України “Про бухгалтерський облік та фінансову звітність в Україні”/вимогам законодавства країни місцезнаходження боржника-нерезидента', 19,'PD18', 53,
'фінансова звітність боржника, не відповідає вимогам Закону України “Про бухгалтерський облік та фінансову звітність в Україні”/вимогам законодавства країни місцезнаходження боржника-нерезидента');
add_question_rep('PD18','Ні'           ,1,0,53);
add_question_rep('PD18','Так'          ,2,1,53);

add_question('Фінансова звітність, надана боржником, має негативний висновокаудитора/не має висновку аудитора в зв''язку з відмовоюаудитора від висловдення думки щодо фінансовї звітності боржника', 20,'PD21', 53,
'Фінансова звітність, надана боржником, має негативний висновокаудитора/не має висновку аудитора в зв''язку з відмовоюаудитора від висловдення думки щодо фінансовї звітності боржника');
add_question_rep('PD21','Ні'           ,1,0,53);
add_question_rep('PD21','Так'          ,2,1,53);

add_question('Контрагент скористався передбаченою умовами договору про надання кредиту можливістю змін попередніх умов виконання ним зобов’язань', 21,'PD19', 53,
'Контрагент скористався передбаченою умовами 
договору про надання кредиту можливістю змін 
попередніх умов виконання ним зобов’язань на 
такі, що відповідають ознакам, визначеним у 
цьому пункті' );
add_question_rep('PD19','Ні'           ,1,0,53);
add_question_rep('PD19','Так'          ,2,1,53);

/*
add_question('Банк направив Лист-вимогу про відкликання кредиту (можна додати до ознак кредитного ризику)', 22,'PD22', 53,
'');
add_question_rep('PD22','Ні'           ,1,0,53);
add_question_rep('PD22','Так'          ,2,1,53);*/

add_question('Банк володіє іншою інформацією, що свідчить про факт настання події дефолту', 22,'PD23', 53,
'');
add_question_rep('PD23','Ні'           ,1,0,53);
add_question_rep('PD23','Так'          ,2,1,53);

-- ===== Ознаки визнання події дефолту

add_question('Сплата боргу Контрагентом в обсязі, меншому, ніж обсяг доходів, визнаних Банком', 1,'VD1', 54,
'Сплата боргу Контрагентом в обсязі, 
меншому, ніж обсяг доходів, визнаних 
Банком згідно з нормативно-правовими 
актами Національного банку з 
бухгалтерського обліку', 0);
add_question_rep('VD1','Ні'           ,1,0,54);
add_question_rep('VD1','Так'          ,2,1,54);


add_question('Внесення змін до умов договору, пов’язаних із реструктуризацією боргу', 2,'VD2', 54,
'Внесення змін до умов договору, пов’язаних 
із реструктуризацією боргу 
[крім: реструктуризації боргу, пов’язаної з 
фінансовою реструктуризацією Контрагента або реструктуризації зобов’язань за кредитами в іноземній валюті], 
яка пов’язана з фінансовими труднощами боржника, 
що мають такі ознаки
 «ТАК» проставляється якщо:
 - клас Контрагента на момент проведення 
   реструктуризації, - вище 8, та, або
 - на момент проведення реструктуризації 
   Контрагент прострочив погашення боргу 
   більш ніж на 30 календарних днів

',0 );
add_question_rep('VD2','Ні'           ,1,0,54);
add_question_rep('VD2','Так'          ,2,1,54);

add_question('Внесення змін до умов договору за відсутності яких актив був би віднесений Банком до категорії непрацюючих (NPL)', 3,'VD3', 54 );
add_question_rep('VD3','Ні'           ,1,0,54);
add_question_rep('VD3','Так'          ,2,1,54);

add_question('Зменшення відсоткової ставки більш ніж на 30% від первинних умов договору', 4,'VD4', 54,
'Зменшення відсоткової ставки більш ніж 
на 30% від первинних умов договору внаслідок 
зміни попередніх умов договору, не пов’язаних 
із реструктуризацією, не спричинене зміною 
ринкових умов',0 );
add_question_rep('VD4','Ні'           ,1,0,54);
add_question_rep('VD4','Так'          ,2,1,54);

add_question('Відсутність в Контрагента на звітну дату власних/орендованих основних засобів або іншого майна, необхідного для здійснення діяльності', 5,'VD5', 54,
'Відсутність в Контрагента на звітну дату 
власних/орендованих основних засобів або 
іншого майна, необхідного для здійснення 
діяльності (виробничого обладнання, складських 
приміщень, транспортних засобів, торгових 
або офісних приміщень тощо), що генерує 
грошові потоки в обсягах, необхідних для 
погашення кредиту' );
add_question_rep('VD5','Ні'           ,1,0,54);
add_question_rep('VD5','Так'          ,2,1,54);

add_question('Відсутність в штаті Контрагента персоналу, необхідного для здійснення операційної діяльності', 6,'VD6', 54 );
add_question_rep('VD6','Ні'           ,1,0,54);
add_question_rep('VD6','Так'          ,2,1,54);

add_question('Відсутність Контрагента за вказаною ним адресою місцезнаходження', 7,'VD7', 54 );
add_question_rep('VD7','Ні'           ,1,0,54);
add_question_rep('VD7','Так'          ,2,1,54);

add_question('в банку немає інформації щодо кінцевих бенефіціарних власників (контролерів) боржника – юридичної особи', 8,'VD8', 54 );
add_question_rep('VD8','Ні'           ,1,0,54);
add_question_rep('VD8','Так'          ,2,1,54);

add_question('Боржник скористався передбаченою умовами договору про надання кредиту можливістю змін попередніх умов виконання ним зобов’язань', 9,'VD9', 54,
'боржник скористався передбаченою умовами договору 
про надання кредиту можливістю змін попередніх умов 
виконання ним зобов’язань на такі, що відповідають 
ознакам, визначеним у цьому пункті.' );
add_question_rep('VD9','Ні'           ,1,0,54);
add_question_rep('VD9','Так'          ,2,1,54);



-- ===== Ознаки припинення події дефолту

add_question('Контрагент поновив регулярні платежі', 1,'ZD1', 55,
'Контрагент поновив регулярні платежі, тобто 
впродовж щонайменше 180 календарних днів 
поспіль від дня запровадження банком заходів, 
спрямованих на відновлення його здатності 
обслуговувати борг, забезпечує щомісячне або 
впродовж 365 днів – щоквартальне погашення 
основного боргу, або процентів у сумі, не меншій 
ніж сума нарахованих процентів за ставкою, 
визначеною в договорі, за відповідний період (місяць, квартал)', 0 );   --1
add_question_rep('ZD1','Ні'           ,1,0,55);
add_question_rep('ZD1','Так'          ,2,1,55);


add_question('Жодне з зобов’язань Контрагента на дату ухвалення рішення про припинення визнання дефолту не є простроченим більше ніж на 30 календарних днів', 2,'ZD2', 55,
'Жодне з зобов’язань Контрагента на дату ухвалення рішення про припинення визнання дефолту боржника/контрагента не є простроченим більше ніж на 30 календарних днів',0 ); --1
add_question_rep('ZD2','Ні'           ,1,0,55);
add_question_rep('ZD2','Так'          ,2,1,55);


add_question('Банк має документально підтверджене обґрунтоване судження, що Контрагент, попри наявні фінансові труднощі, спроможний обслуговувати борг', 3,'ZD3', 55,
'' );
add_question_rep('ZD3','Ні'           ,1,0,55);
add_question_rep('ZD3','Так'          ,2,1,55);


-- ===== Розрахунок

add_question('Подія дефолту настала', 1,'RK1', 56, '', 1 );
add_question_rep('RK1','Ні'           ,1,0,56);
add_question_rep('RK1','Так'          ,2,1,56);

add_question('Наявність ознак для визнання події дефолту', 2,'RK2', 56, '', 1 );
add_question_rep('RK2','Ні'           ,1,0,56);
add_question_rep('RK2','Так'          ,2,1,56);

add_question('Припинення визнання дефолту ', 3,'RK3', 56, '', 1 );
add_question_rep('RK3','Ні'           ,1,0,56);
add_question_rep('RK3','Так'          ,2,1,56);

--  інші питання .....

add_question('Наявність судження Банку про відстутність  умовних ознак визнання дефолту боржника ', 3,'VD0', 56, '', 1 );
add_question_rep('VD0','Ні'           ,1,0,56);
add_question_rep('VD0','Так'          ,2,1,56);
 


-- ===============================Фізособи============================================================================================
add_question('Кредитна історія', 1,'IP1', 60, '', 1 );
add_question_rep('IP1','Позитивна'      ,1,1,60);
add_question_rep('IP1','Добра'          ,2,2,60);
add_question_rep('IP1','Задовільна'     ,3,3,60);
add_question_rep('IP1','Негативна'      ,4,4,60);
     --Зважений коефіцієнт покриття боргу забезпеченням
add_question('Кредитна історія', 2,'IP2', 60, '', 1 );
add_question_rep('IP2','Високий'     ,1,1,60);
add_question_rep('IP2','Добрий'      ,2,2,60);
add_question_rep('IP2','Низький'     ,3,3,60);



--=========================================================================================================================================
--=======================================БЮДЖЕТНІ ОРГАНІЗАЦІЇ==============================================================================
--=========================================================================================================================================

add_question('Контрагент створений шляхом реорганізації', 1,'KSR', 71 );
add_question_rep('KSR','Ні'           ,1,0,71);
add_question_rep('KSR','Так'          ,2,1,71);

add_question('Пов’язаний із фінансуванням інвестиційних проектів контрагентів Банку', 1,'INV', 71 );
add_question_rep('INV','Не інвестиційний проект'       ,1,1,71);
add_question_rep('INV','Кредитно-інвестиційний проект'          ,2,2,71);

add_question('Пов’язаний із фінансуванням інвестиційних проектів контрагентів Банку', 1,'INV', 71 );
add_question_rep('INV','Не інвестиційний проект'       ,1,1,32);
add_question_rep('INV','Кредитно-інвестиційний проект'          ,2,2,32);

--===========================
add_question('з дати держреєстрації менше 1-го року (крім випадків реорганізації боржника та розгляду інвестпроекту)', 1,'KR1', 72, '', 1 );
add_question_rep('KR1','Ні'           ,1,0,72);
add_question_rep('KR1','Так'          ,2,1,72);

add_question('прострочення боргу від 31 до 60 днів (включно) з дати виконання зобов’язання за договором (застосовується за урахованим векселем та факторингом)', 2,'KR2', 72, '', 1 );
add_question_rep('KR2','Ні'           ,1,0,72);
add_question_rep('KR2','Так'          ,2,1,72);

add_question('спрямування кредиту, наданого боржнику А, на погашення кредиту боржника В, що був використаний боржником В для погашення кредиту боржника С', 3,'KR3', 72, '', 0 );
add_question_rep('KR3','Ні'           ,1,0,72);
add_question_rep('KR3','Так'          ,2,1,72);

add_question('прострочення боргу від 61 до 90 днів (включно) з дати виконання зобов’язання за договором (застосовується за урахованим векселем та факторингом)', 4,'KR4', 72, '', 1 );
add_question_rep('KR4','Ні'           ,1,0,72);
add_question_rep('KR4','Так'          ,2,1,72);

add_question('від’ємне значення капіталу на кінець року протягом 3-ох останніх років поспіль (крім місцевих бюджетів)', 5,'KR5', 72, '', 1 );
add_question_rep('KR5','Ні'           ,1,0,72);
add_question_rep('KR5','Так'          ,2,1,72);



 delete from FIN_QUESTION_REPLY where kod = 'KR6' and idf = 72;
 delete from FIN_QUESTION where kod = 'KR6' and idf = 72;
 commit;
/*
add_question('недостатній обсяг підтвердженої виручки для виконання зобов’язань за кредитом в іноземній валюті упродовж наступних 12 місяців', 6,'KR6', 72, '', 0 );
add_question_rep('KR6','Ні'           ,1,0,72);
add_question_rep('KR6','Так'          ,2,1,72);
*/



-- =========Додаткові показники коригування коофіциенту PD
add_question('Кредитна історія', 1,'IP1', 70, '
ПОЗИТИВНА-прострочка погашення боргу протягом останніх 12 місяців не перевищує 7 днів 
ДОБРА-прострочка погашення боргу протягом останніх 12 місяців становить від 8 до 30 днів
ЗАДОВІЛЬНА-прострочка погашення боргу протягом останніх 12 місяців становить від 31 до 60 днів
НЕГАТИВНА-прострочка погашення боргу протягом останніх 12 місяців перевищує 61
', 0 );
add_question_rep('IP1','Позитивна'      ,1,1,70);
add_question_rep('IP1','Добра'          ,2,2,70);
add_question_rep('IP1','Задовільна'     ,3,3,70);
add_question_rep('IP1','Негативна'      ,4,4,70);


add_question('Зважений коефіцієнт покриття боргу забезпеченням', 2,'IP2', 70, '', 1 );
add_question_rep('IP2','Високий'     ,1,1,70);
add_question_rep('IP2','Добрий'      ,2,2,70);
add_question_rep('IP2','Низький'     ,3,3,70);


--  безумовних ознак визнання дефолту боржника (2.2.)   73
add_question('прострочення боргу більш ніж на 90 днів, в.ч. за урахованим векселем та факторингом (з дати виконання зобов’язання за договором)', 1,'BO1', 73, '', 1 );
add_question_rep('BO1','Ні'           ,1,0,73);
add_question_rep('BO1','Так'          ,2,1,73);

--сформований банком резерв під зменшення корисності наданого боржнику фінансового активу становить 50 та більше відсотків боргу
add_question('сформований банком резерв під зменшення корисності наданого боржнику фінансового активу становить 50 та більше відсотків боргу', 2,'BO2', 73, '', 1 );
add_question_rep('BO2','Ні'           ,1,0,73);
add_question_rep('BO2','Так'          ,2,1,73);


add_question(' змінені умови договору, у т.ч. у зв''язку з реструктуризацією боргу', 3,'BO3', 73, 
'змінені умови договору, у т.ч. у зв''язку з 
реструктуризацією боргу (крім реструктуризації 
боргу, яка здійснена відповідно до вимог закону 
України щодо фінансової реструктуризації), що 
передбачають прощення частини боргу та/або 
капіталізацію або заміну на інший актив 
нарахованих та несплачених відсотків за більш 
ніж 90 днів поспіль', 0 );
add_question_rep('BO3','Ні'           ,1,0,73);
add_question_rep('BO3','Так'          ,2,1,73);

add_question(' боржник заявив про банкрутство або банк порушив проти боржника справу про банкрутство або боржника визнано банкрутом або розпочато процедуру припинення ЮО ', 4,'BO4', 73, '', 0 );
add_question_rep('BO4','Ні'           ,1,0,73);
add_question_rep('BO4','Так'          ,2,1,73);

add_question('Рейтинг боржника згідно з міжнародною рейтинговою шкалою понижено до рівня “дефолт"', 5,'BO5', 73,
'хоча б один із зовнішніх рейтингів боржника згідно з 
міжнародною рейтинговою шкалою, підтверджений 
агентством (компанією) Standard$Poor’s, Moody’s 
Investors Service та Fitch IBCA, понижено до 
рівня “дефолт"' );
add_question_rep('BO5','Ні'             ,1 ,0,73);
add_question_rep('BO5','Так'            ,2 ,1,73); 

add_question(' відбулася повторна/наступна заміна активу на інший актив', 6,'BO6', 73, '', 0 );
add_question_rep('BO6','Ні'           ,1,0,73);
add_question_rep('BO6','Так'          ,2,1,73);

add_question(' змінені умови договору, не пов’язані з реструктуризацією, у частині збільшення строків користування активом', 7,'BO7', 73, 
'змінені умови договору, не пов’язані з реструктуризацією, 
у частині збільшення строків користування активом, наданим 
боржнику, який не спроможний погасити борг без реалізації 
застави, попри відсутність на дату оцінки кредитного ризику 
прострочення погашення боргу', 0 );
add_question_rep('BO7','Ні'           ,1,0,73);
add_question_rep('BO7','Так'          ,2,1,73);


add_question(' за одним із активів боржника відбулося списання боргу за рахунок сформованого резерву', 8,'BO8', 73, '', 0 );
add_question_rep('BO8','Ні'           ,1,0,73);
add_question_rep('BO8','Так'          ,2,1,73);

add_question(' за одним із активів боржника відбувся продаж зі збитком в обсязі 20 або більше відсотків боргу', 9,'BO9', 73, '', 0 );
add_question_rep('BO9','Ні'           ,1,0,73);
add_question_rep('BO9','Так'          ,2,1,73);

add_question(' за одним із активів боржника, який є лізингоотримувачем, відбулось анулювання банком лізингового договору у зв’язку з порушенням умов договору', 10,'BO10', 73, 
'за одним із активів/часткою активу боржника, який є 
лізингоотримувачем, відбулось анулювання банком 
лізингового договору у зв’язку з порушенням боржником 
(лізингоотримувачем) умов договору', 0 );
add_question_rep('BO10','Ні'           ,1,0,73);
add_question_rep('BO10','Так'          ,2,1,73);


add_question('Продаж Банком активу з відстроченням платежу більш ніж на 7 календарних днів, при цьому Контрагент сплачує за активом одним платежем у кінці строку дії договору', 11,'BO11', 73, 
'продаж банком активу із відстроченням платежу більше ніж на 7 календарних днів відповідно до умов договору про продаж активу, який супроводжується однією з таких подій: 
1) на дату оцінки кредитного ризику контрагент, що купує актив, сплатив банку менше 30% його вартості/сплату за активом не здійснював; 
2) контрагент сплачує за активом одним платежем у кінці строку дії договору про продаж активу або сплачує більшу частку вартості активу наближено до кінця строку дії договору про продаж активу', 0 );
add_question_rep('BO11','Ні'           ,1,0,73);
add_question_rep('BO11','Так'          ,2,1,73);

add_question(' боржника, що є емітентом цінних паперів  уключено до списку емітентів, що мають ознаки фіктивності', 12,'BO12', 73, 
'боржника, що є емітентом цінних паперів, згідно з порядком, передбаченим нормативно-правовим актом НКЦПФР, уключено до списку емітентів, що мають ознаки фіктивності', 0 );
add_question_rep('BO12','Ні'           ,1,0,73);
add_question_rep('BO12','Так'          ,2,1,73);

add_question(' є затримка погашення номінальної  вартості або процентів понад 7 календарних днів за борговими цінними паперами', 13,'BO13', 73, '', 0 );
add_question_rep('BO13','Ні'           ,1,0,73);
add_question_rep('BO13','Так'          ,2,1,73);

add_question(' фінансова звітність боржника, за даними якої банк здійснив оцінку фінансового стану такого боржника, не відповідає вимогам чинного законодавства України ', 14,'BO14', 73, '', 0 );
add_question_rep('BO14','Ні'           ,1,0,73);
add_question_rep('BO14','Так'          ,2,1,73);

add_question(' фінансова звітність боржника, надана боржником, має негативний висновок аудитора/не має висновку аудитора у звязку з відмовою аудитора від висловлення думки щодо фінансової звітності боржника ', 15,'BO15', 73, 
'', 0 );
add_question_rep('BO15','Ні'           ,1,0,73);
add_question_rep('BO15','Так'          ,2,1,73);

add_question(' Контрагент скористався передбаченою умовами договору про надання кредиту можливістю змін попередніх умов виконання ним зобов’язань', 16,'BO16', 73, 
'боржник скористався передбаченою умовами договору про надання кредиту можливістю змін попередніх умов виконання ним зобов’язань на такі, що відповідають ознакам, визначеним для цього фактора коригування класу боржника', 0 );
add_question_rep('BO16','Ні'           ,1,0,73);
add_question_rep('BO16','Так'          ,2,1,73);

--====================Умовні ознаки визнання дефолту боржника=======================================================================
add_question('Сплата боргу Контрагентом в обсязі, меншому, ніж обсяг доходів, визнаних Банком', 1,'VD1', 74,
'сплати боргу боржником (крім боргу за кредитом під інвестиційний проект; кредитом, наданим на виробничі цілі із сезонним або циклічним характером виробництва) в обсязі менше ніж обсяг доходів, визнаних банком згідно з нормативно-правовими актами НБУ з бухгалтерського обліку', 0 );
add_question_rep('VD1','Ні'           ,1,0,74);
add_question_rep('VD1','Так'          ,2,1,74);


add_question('Внесення змін до умов договору, пов’язаних із реструктуризацією боргу', 2,'VD2', 74,
'змінені умови договору, пов’язані із реструктуризацією боргу (крім реструктуризації боргу, яка здійснена відповідно до вимог закону України щодо фінансової реструктуризації), та на момент такої реструктуризації боржник прострочив погашення боргу більше ніж на 30 днів
',0 );
add_question_rep('VD2','Ні'           ,1,0,74);
add_question_rep('VD2','Так'          ,2,1,74);

add_question('Внесення змін до умов договору за відсутності яких актив був би віднесений Банком до категорії непрацюючих (NPL)', 3,'VD3', 74 );
add_question_rep('VD3','Ні'           ,1,0,74);
add_question_rep('VD3','Так'          ,2,1,74);

add_question('Зменшення відсоткової ставки більш ніж на 30% від первинних умов договору', 4,'VD4', 74,
'Зменшення відсоткової ставки більш ніж 
на 30% від первинних умов договору внаслідок 
зміни попередніх умов договору, не пов’язаних 
із реструктуризацією, не спричинене зміною 
ринкових умов',0 );
add_question_rep('VD4','Ні'           ,1,0,74);
add_question_rep('VD4','Так'          ,2,1,74);

add_question('Відсутність в Контрагента на звітну дату власних/орендованих основних засобів або іншого майна, необхідного для здійснення діяльності', 5,'VD5', 74,
'Відсутність в Контрагента на звітну дату 
власних/орендованих основних засобів або 
іншого майна, необхідного для здійснення 
діяльності (виробничого обладнання, складських 
приміщень, транспортних засобів, торгових 
або офісних приміщень тощо), що генерує 
грошові потоки в обсягах, необхідних для 
погашення кредиту' );
add_question_rep('VD5','Ні'           ,1,0,74);
add_question_rep('VD5','Так'          ,2,1,74);

add_question('Відсутність в штаті Контрагента персоналу, необхідного для здійснення операційної діяльності', 6,'VD6', 74 );
add_question_rep('VD6','Ні'           ,1,0,74);
add_question_rep('VD6','Так'          ,2,1,74);

add_question('Відсутність Контрагента за вказаною ним адресою місцезнаходження', 7,'VD7', 74 );
add_question_rep('VD7','Ні'           ,1,0,74);
add_question_rep('VD7','Так'          ,2,1,74);

add_question('Боржник скористався передбаченою умовами договору про надання кредиту можливістю змін попередніх умов виконання ним зобов’язань', 8,'VD8', 74,
'боржник скористався передбаченою умовами договору 
про надання кредиту можливістю змін попередніх умов 
виконання ним зобов’язань на такі, що відповідають 
ознакам, визначеним у цьому пункті.' );
add_question_rep('VD8','Ні'           ,1,0,74);
add_question_rep('VD8','Так'          ,2,1,74);

-- ===== Ознаки припинення події дефолту

add_question('Контрагент поновив регулярні платежі', 1,'ZD1', 75,
'Контрагент поновив регулярні платежі, тобто 
впродовж щонайменше 180 календарних днів 
поспіль від дня запровадження банком заходів, 
спрямованих на відновлення його здатності 
обслуговувати борг, забезпечує щомісячне або 
впродовж 365 днів – щоквартальне погашення 
основного боргу, або процентів у сумі, не меншій 
ніж сума нарахованих процентів за ставкою, 
визначеною в договорі, за відповідний період (місяць, квартал)', 0 );
add_question_rep('ZD1','Ні'           ,1,0,75);
add_question_rep('ZD1','Так'          ,2,1,75);


add_question('Жодне з зобов’язань Контрагента на дату ухвалення рішення про припинення визнання дефолту не є простроченим більше ніж на 30 календарних днів', 2,'ZD2', 75,
'Жодне з зобов’язань Контрагента на дату ухвалення рішення про припинення визнання дефолту боржника/контрагента не є простроченим більше ніж на 30 календарних днів',0 );
add_question_rep('ZD2','Ні'           ,1,0,75);
add_question_rep('ZD2','Так'          ,2,1,75);


add_question('Банк має документально підтверджене обґрунтоване судження, що Контрагент, попри наявні фінансові труднощі, спроможний обслуговувати борг', 3,'ZD3', 75,
'' );
add_question_rep('ZD3','Ні'           ,1,0,75);
add_question_rep('ZD3','Так'          ,2,1,75);
 

 -- ===== Розрахунок
add_question('Ознака високого кредитного ризику', 0,'RK0', 76, '', 1 );
add_question_rep('RK0','Ні'           ,1,0,76);
add_question_rep('RK0','Так'          ,2,1,76);

add_question('Безумовна ознакавизнання дефолту боржника', 1,'RK1', 76, '', 1 );
add_question_rep('RK1','Ні'           ,1,0,76);
add_question_rep('RK1','Так'          ,2,1,76);

add_question('Умовна ознака визнання дефолту боржника', 2,'RK2', 76, '', 1 );
add_question_rep('RK2','Ні'           ,1,0,76);
add_question_rep('RK2','Так'          ,2,1,76);

add_question('Ознака припинення визнання дефолту боржника  ', 3,'RK3', 76, '', 1 );
add_question_rep('RK3','Ні'           ,1,0,76);
add_question_rep('RK3','Так'          ,2,1,76);

add_question('Наявність у Банку інформації щодо кредитної історії Контрагента в частині його класифікації за класом 5 ', 4,'RK4', 76, '', 0 );
add_question_rep('RK4','Ні'           ,1,0,76);
add_question_rep('RK4','Так'          ,2,1,76);

-- шнші бюджетні організації

add_question('Наявність судження Банку про відстутність  умовних ознак визнання дефолту боржника ', 3,'VD0', 74, '', 1 );
add_question_rep('VD0','Ні'           ,1,0,74);
add_question_rep('VD0','Так'          ,2,1,74);
null;
commit;
end;
/