
 
 PROMPT ===================================================================================== 
 PROMPT *** Run *** ========== Scripts /Sql/BARS/function/fin23_def.sql =========*** Run *** 
 PROMPT ===================================================================================== 
 
  CREATE OR REPLACE FUNCTION BARS.FIN23_DEF (p_rnk number, p_fin_old int)
  return int   is

-- функция получения FIN23 по-умолчанию
   cc customer%rowtype;
   l_FIN23 int;
   l_fin   int;
begin
   begin
     select * into cc from customer where rnk = p_rnk;
   EXCEPTION WHEN NO_DATA_FOUND THEN return null;
   end;

   l_fin := nvl( p_fin_old, nvl(cc.crisk,1) ) ; -- старый FIN

   --3.для ФЛ по методике ОБ
   If cc.custtype in (3)  then
      If l_fin = 5        then l_fin23 := 4;
      else                     l_fin23 := l_fin;
      end if;

   -- 2. для ЮЛ по методике Петроком
   elsIf cc.custtype = 2  then

/* ****************************************************************
Уважаемая Татьяна Александровна,
в рамках нашей встречи (19.07.2012)
Вами был задан вопрос относительно приблизительного расчета коеф.К для ЮЛ
(в расчета резервов по постанове НБУ-23), если по срокам не будем успевать.
Могу предложить еще красивый" подход, а именно:

Категорiя якостi за кредитом 5 значень (I  II  III  IV  V )
------------------------------------------------------------------
Фiнклас|ФiнКлас|  Обслуговування (необхiдно нове, 5 значень)     |
старий |новий  |-------------------------------------------------|
       |       |1.високе|2.добре|3.задовiльне|4.слабке|5.незадов.|
---------------|-------------------------------------------------|
А      | 2     | I      | I     | III        | IV     | V        |
Б      | 4     | I      | II    | III        | IV     | V        |
В      | 5     | II     | II    | III        | IV     | V        |
Г      | 7     | II     | III   | IV         | IV     | V        |
Д      | 9     | II     | III   | IV         | IV     | V        |
------------------------------------------------------------------

------------------------------------------------------------------
Категорiя якостi за кредитом  | Значення показника ризику кредиту|
                              |  т.е. искомое К                  |
------------------------------|----------------------------------|
I   - найвища                 | 0.035                            |
II  -                         | 0.135                            |
III -                         | 0.355                            |
IV  -                         | 0.75                             |
V   - найнижча                | 1                                |
------------------------------------------------------------------

Данный поход требует единственное новое,
это расчет обслуживания долга по новому.
****************************************************************   */

      If    l_fin   = 1  then l_fin23 := 2;
      elsIf l_fin   = 2  then l_fin23 := 4;
      elsIf l_fin   = 3  then l_fin23 := 3;
      elsIf l_fin   = 4  then l_fin23 := 7;
      elsIf l_fin   = 5  then l_fin23 := 9;
      end if;

   else
      -- 3r. для БАНКИ-рез по методике БАРС
      If cc.country = 804 then
         If l_fin = 5    then l_fin23 := 4;
         else                 l_fin23 := l_fin;
         end if;

      -- 3nr. для БАНКИ-НЕ рез по методике НБУ
      else
         -- !!!! пока НЕ сделано
         If l_fin = 5    then l_fin23 := 4;
         else                 l_fin23 := l_fin;
         end if;
      end if;
   end if;
   RETURN l_fin23;

end fin23_def;
/
 show err;
 
 
 
 PROMPT ===================================================================================== 
 PROMPT *** End *** ========== Scripts /Sql/BARS/function/fin23_def.sql =========*** End *** 
 PROMPT ===================================================================================== 
 