Calendar.LANG("ua", "Українська", {

        fdow: 1,                // first day of week for this locale; 0 = Sunday, 1 = Monday, etc.

        goToday: "Cьогоднi",

        today: "Cьогоднi",         // appears in bottom bar

        wk: "нед",

        weekend: "0,6",         // 0 = Sunday, 1 = Monday, etc.

        AM: "am",

        PM: "pm",

         mn: [ "Січень", 
                "Лютий", 
                "Березень", 
                "Квітень", 
                "Травень", 
                "Червень", 
                "Липень", 
                "Серпень", 
                "Вересень", 
                "Жовтень", 
                "Листопад", 
                "Грудень"], 

         smn: [ "Січень", 
                "Лютий", 
                "Березень", 
                "Квітень", 
                "Травень", 
                "Червень", 
                "Липень", 
                "Серпень", 
                "Вересень", 
                "Жовтень", 
                "Листопад", 
                "Грудень"], 

        dn: [ "Неділя", 
                "Понеділок", 
                "Вівторок", 
                "Середа", 
                "Четвер", 
                "П`ятниця", 
                "Субота", 
                "Неділя"], 
         sdn: [ "нд", 
                 "пн", 
                 "вт", 
                 "ср", 
                 "чт", 
                 "пт", 
                 "сб", 
                 "нд"] 

});
