

PROMPT ===================================================================================== 
PROMPT *** Run *** ========== Scripts /Sql/BARS/Trigger/TI_ARCRRP_BLK_CRYM.sql =========*** 
PROMPT ===================================================================================== 


PROMPT *** Create  trigger TI_ARCRRP_BLK_CRYM ***

  CREATE OR REPLACE TRIGGER BARS.TI_ARCRRP_BLK_CRYM 
  AFTER INSERT ON "BARS"."ARC_RRP"
  REFERENCING FOR EACH ROW
    WHEN (
--new.kv=980 and
new.fn_a like '_A%'
      ) DECLARE
  l_mfo_b     banks.mfo%type;
BEGIN
  --
  -- блокировка платежей от Крымского РУ
  -- на все банки, кроме филиалов ВПС
  -- ( Макаренко И.В. 06/05/2014 )
  --
--  IF :new.mfoa = '324805' THEN
--    BEGIN
--    select mfo into l_mfo_b from banks
--    where mfo=:new.mfob and
--      (    mfo=gl.kf                    -- на ГРЦ
--        or (mfop=gl.kf and kodn=6)      -- на Обл. Дирекциии Ощадбанка
--        or mfop in                      -- на районные балансовые учреждения
--           (select mfo from banks
--             where mfop=gl.kf and kodn=6)
--      );
--    exception when no_data_found then
--      raise_application_error(-20000, '\0907 - Від філії-відправника заборонені всі платежі', TRUE);
--    END;
--  END IF;
  --
  -- ********************************************
  -- * !!!!!!! БЛОКИРОВКА ПЛАТЕЖЕЙ НА : !!!!!!! *
  -- ********************************************
  --
  IF    :new.mfob = '304706' -- АТ "СП БАНК"
     OR :new.mfob = '304988' -- ПАТ "УКРКОМУНБАНК"
     OR ( trunc(sysdate) >= to_date('28/09/2015','DD/MM/YYYY')
          AND
          :new.mfob IN ( '353467' ) -- Управління НБУ в Чернігівській обл.     (лист № 60-01009/69782 від 25/09/2015)
         )
     OR ( trunc(sysdate) >= to_date('08/10/2015','DD/MM/YYYY')
          AND
          :new.mfob IN ( '302504',  -- Управління НБУ в Вінницькій обл.        (лист № 60-01011/73633 від 07/10/2015)
                         '311034' ) -- Управління НБУ в Житомирській обл.      (лист № 60-01011/73633 від 07/10/2015)
         )
     OR ( trunc(sysdate) >= to_date('12/10/2015','DD/MM/YYYY')
          AND
          :new.mfob IN ( '354024',  -- Управління НБУ в Черкаській обл.        (лист № 60-01010/74713 від 09/10/2015)
                         '323378',  -- Управління НБУ в Кіровоградській обл.   (лист № 60-01010/74713 від 09/10/2015)
                         '336343' ) -- Управління НБУ в Івано-Франківській обл.(лист № 60-01010/74713 від 09/10/2015)
         )
     OR ( trunc(sysdate) >= to_date('15/10/2015','DD/MM/YYYY')
          AND
          :new.mfob IN ( '313377',  -- Управління НБУ в Запорізькій обл.(лист № 60-01010/75537 від 12/10/2015)
                         '328027',  -- Управління НБУ в Одеській обл.   (лист № 60-01010/75537 від 12/10/2015)
                         '337308' ) -- Управління НБУ в Сумській обл.   (лист № 60-01010/75537 від 12/10/2015)
         )
     OR ( trunc(sysdate) >= to_date('19/10/2015','DD/MM/YYYY')
          AND
          :new.mfob IN ( '303020',  -- Управління НБУ в Волинській обл.     (лист № 60-01010/75647 від 13/10/2015)
                         '326450',  -- Управління НБУ в Миколаївській обл.  (лист № 60-01010/75647 від 13/10/2015)
                         '337308' ) -- Управління НБУ в Хмельницькій обл.   (лист № 60-01010/75647 від 13/10/2015)
         )
     OR ( trunc(sysdate) >= to_date('22/10/2015','DD/MM/YYYY')
          AND
          :new.mfob IN ( '312152',  -- Управління НБУ в Закарпатській обл.  (лист № 60-01010/77546 від 19/10/2015)
                         '331047',  -- Управління НБУ в Полтавській обл.    (лист № 60-01010/77546 від 19/10/2015)
                         '338415',  -- Управління НБУ в Тернопільській обл. (лист № 60-01010/77546 від 19/10/2015)
                         '352297' ) -- Управління НБУ в Херсонській обл.    (лист № 60-01010/77546 від 19/10/2015)
         )
     OR ( trunc(sysdate) >= to_date('26/10/2015','DD/MM/YYYY')
          AND
          :new.mfob IN ( '324333',  -- Управління НБУ в АР Крим             (лист № 60-01010/78824 від 21/10/2015)
                         '325622',  -- Управління НБУ в Львівській обл.     (лист № 60-01010/78824 від 21/10/2015)
                         '351447' ) -- Управління НБУ в Харківській обл.    (лист № 60-01010/78824 від 21/10/2015)
         )
     OR ( trunc(sysdate) >= to_date('29/10/2015','DD/MM/YYYY')
          AND
          :new.mfob IN ( '305006',  -- Управління НБУ в Дніпропетровській обл.  (лист № 60-01010/80527 від 26/10/2015)
                         '334624',  -- Управління НБУ в Донецькій обл.          (лист № 60-01010/80527 від 26/10/2015)
                         '333324',  -- Управління НБУ в Рівненській обл.        (лист № 60-01010/80527 від 26/10/2015)
                         '356185' ) -- Управління НБУ в Чернівецькій обл.       (лист № 60-01010/80527 від 26/10/2015)
         )
     OR ( trunc(sysdate) >= to_date('02/11/2015','DD/MM/YYYY')
          AND
          :new.mfob IN ( '304030',  -- Управління НБУ в Луганській обл.     (лист № 60-01011/81826 від 28/10/2015)
                         '300302' ) -- Центральне сховище НБУ               (лист № 60-01011/81826 від 28/10/2015)
         )
     OR ( trunc(sysdate) >= to_date('19/11/2015','DD/MM/YYYY')
          AND
          :new.mfob IN ( '399023' ) -- ЦРП НБУ                              (лист № 60-01011/88039 від 16/11/2015)
         )
     OR ( trunc(sysdate) >= to_date('23/11/2015','DD/MM/YYYY')
          AND
          :new.mfob IN ( '399261' ) -- Головне господарське управління НБУ  (лист № 60-01011/89871 від 19/11/2015)
         )
     OR ( trunc(sysdate) >= to_date('26/11/2015','DD/MM/YYYY')
          AND
          :new.mfob IN ( '399012' ) -- Державна скарбниця НБУ               (лист № 60-01011/90988 від 23/11/2015)
         )
     OR ( trunc(sysdate) >= to_date('11/12/2015','DD/MM/YYYY')
          AND
          :new.mfob IN ( '322799' ) -- АТ "БАНК ВЕЛЕС"
         )
     OR ( trunc(sysdate) >= to_date('29/12/2015','DD/MM/YYYY')
          AND
          :new.mfob IN ( '399131' ) -- Група управління проектами міжнародних кредитних ліній при НБУ (лист № 60-01011/90988 від 23/11/2015)
         )
     OR ( trunc(sysdate) >= to_date('08/02/2016','DD/MM/YYYY')
          AND
          :new.mfob IN ( '321024' ) -- ГОЛОВНЕ УПР. НБУ ПО М.КИЄВУ І КИЇВ.ОБЛ
         )
  THEN
--    BEGIN
--    select mfo into l_mfo_b from banks
--    where mfo=:new.mfob and
--      (    mfo=gl.kf                    -- на ГРЦ
--        or (mfop=gl.kf and kodn=6)      -- на Обл. Дирекциии Ощадбанка
--        or mfop in                      -- на районные балансовые учреждения
--           (select mfo from banks
--             where mfop=gl.kf and kodn=6)
--      );
--    exception when no_data_found then
    RAISE_APPLICATION_ERROR(-20000, '\0904 - Платежі на адресу банка Б заборонені', TRUE);
--    END;
  END IF;
END;


/
ALTER TRIGGER BARS.TI_ARCRRP_BLK_CRYM ENABLE;


PROMPT ===================================================================================== 
PROMPT *** End *** ========== Scripts /Sql/BARS/Trigger/TI_ARCRRP_BLK_CRYM.sql =========*** 
PROMPT ===================================================================================== 
