

PROMPT ===================================================================================== 
PROMPT *** Run *** ========== Scripts /Sql/BARS/Procedure/IKF.sql =========*** Run *** =====
PROMPT ===================================================================================== 


PROMPT *** Create  procedure IKF ***

  CREATE OR REPLACE PROCEDURE BARS.IKF (p_kf varchar2)
is
begin
    -- устанавливаем импортируемый код филиала
    mgr_utl.set_kf(p_kf);
end ikf;
/
show err;



PROMPT ===================================================================================== 
PROMPT *** End *** ========== Scripts /Sql/BARS/Procedure/IKF.sql =========*** End *** =====
PROMPT ===================================================================================== 
