
 
 PROMPT ===================================================================================== 
 PROMPT *** Run *** ========== Scripts /Sql/BARS/function/fs240_def.sql =========*** Run *** 
 PROMPT ===================================================================================== 
 
  CREATE OR REPLACE FUNCTION BARS.FS240_DEF (
   nbs_    IN   VARCHAR2,
   type_   IN   NUMBER DEFAULT 2,
   t020_   IN   NUMBER DEFAULT 0
)
   RETURN VARCHAR2
	result_cache
/*%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% DESCRIPTION :   Ф-я прост/ значений по умолчанию для кода срока до погашения
% COPYRIGHT   :   Copyright UNITY-BARS Limited, 1999.  All Rights Reserved.
% VERSION     :   16/08/2010 (01.12.2008, 15.08.2008)
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
    параметры: nbs_ - балансовый счет
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%*/
IS
   kod_   VARCHAR2 (1) := '0';
BEGIN
   -- значения по умолчанию
   IF nbs_ IN
         ('1600',
          '1819',
          '2600',
          '2601',
          '2603',
          '2604',
          '2605',
          '2620',
          '2625',
          '2628',
          '2650',
          '2655',
          '2900',
          '2901',
          '2902',
          '2903',
          '2905',
          '2909'
         )
   THEN
      kod_ := '1';
   END IF;

   IF type_ = 2
   THEN
      IF nbs_ IN ('4400', '4409', '4430', '4431', '4500', '4509', '4530')
      THEN
         kod_ := 'C';
      END IF;
   END IF;

   -- сделано для ANI-отчетов (из файла EKP_2_A7 (расчет показателей для 631 формы) по состоянию на 15/08/2008)
   -- 16/08/2010  - актуализация состояния
   IF type_ = 2
   THEN
      -- Пасивнi залишки - поточні рахунки коштів бюджету та державних цільових фондів
      IF     (   nbs_ IN
                    ('2512',
                     '2513',
                     '2520',
                     '2523',
                     '2526',
                     '2530',
                     '2531',
                     '2541',
                     '2542',
                     '2544',
                     '2545',
                     '2565'
                    )
              OR nbs_ BETWEEN '2552' AND '2555'
              OR nbs_ BETWEEN '2560' AND '2562'
              OR nbs_ BETWEEN '2570' AND '2572'
             )
         AND t020_ = 2
      THEN
         kod_ := '1';
      END IF;

      -- Активнi залишки - цінні папери власного боргу, емітовані банком на вимогу
      IF (t020_ = '1') AND (nbs_ IN ('3346'))
      THEN
         kod_ := '1';
      END IF;

      -- Пасивнi залишки - цінні папери власного боргу, емітовані банком на вимогу
      IF (t020_ = '2') AND (nbs_ IN ('3340', '3347'))
      THEN
         kod_ := '1';
      END IF;

      -- Пасивнi залишки - депозити овернайт
      IF (t020_ = '2') AND (nbs_ IN ('1610'))
      THEN
         kod_ := '2';
      END IF;

      -- Пасивнi залишки - кредити овернайт
      IF (t020_ = '2') AND (nbs_ IN ('1621'))
      THEN
         kod_ := '2';
      END IF;

      -- Пасивнi залишки - кредити овердрафт
      IF (t020_ = '2') AND (nbs_ IN ('1500'))
      THEN
         kod_ := '1';
      END IF;

      -- Пасивнi залишки - на вимогу
      IF (t020_ = '2') AND (nbs_ IN ('1300'))
      THEN
         kod_ := '1';
      END IF;

      -- Пасивнi залишки - кредити овернайт, що отримані від НБУ
      IF (t020_ = '2') AND (nbs_ IN ('1310'))
      THEN
         kod_ := '1';
      END IF;

      -- Пасивнi залишки - кошти на вимогу
      IF (t020_ = '2') AND (nbs_ IN ('1600'))
      THEN
         kod_ := '1';
      END IF;

      -- Пасивнi залишки - кошти суб'єктiв господарювання на вимогу
      IF (t020_ = '2') AND (nbs_ in ('2600', '2601') or nbs_ BETWEEN '2603' AND '2606')
      THEN
         kod_ := '1';
      END IF;

      -- Пасивнi залишки - кошти фізичних осіб на вимогу
      IF (t020_ = '2') AND (nbs_ IN ('2620', '2622', '2625'))
      THEN
         kod_ := '1';
      END IF;

      -- Пасивнi залишки - кошти небанківських фiнансових установ на вимогу
      IF (t020_ = '2') AND (nbs_ IN ('2650', '2655'))
      THEN
         kod_ := '1';
      END IF;

      -- Пасивнi залишки - кредитові суми до з'ясування
      IF (t020_ = '2') AND (nbs_ IN ('3720'))
      THEN
         kod_ := '3';
      END IF;

      -- Пасивнi залишки - ?прострочена заборгованість за строковими вкладами (депозитами) інших банків
      IF (t020_ = '2') AND (nbs_ IN ('1617'))
      THEN
         kod_ := '1';
      END IF;

      -- Пасивнi залишки - ?прострочена заборгованість за скредитами, що отримані від інших банків
      IF (t020_ = '2') AND (nbs_ IN ('1627'))
      THEN
         kod_ := '1';
      END IF;

      -- Пасивнi залишки - капитал банку
      IF     (t020_ = '2')
         AND (   nbs_ IN ('5200')
              OR nbs_ BETWEEN '5000' AND '5109'
              OR nbs_ BETWEEN '6000' AND '6079'
              OR nbs_ BETWEEN '6090' AND '6179'
              OR nbs_ BETWEEN '6190' AND '6379'
              OR nbs_ BETWEEN '6390' AND '6999'
              OR nbs_ BETWEEN '7000' AND '7079'
              OR nbs_ BETWEEN '7090' AND '7179'
              OR nbs_ BETWEEN '7190' AND '7379'
              OR nbs_ BETWEEN '7390' AND '7999'
             )
      THEN
         kod_ := 'H';
      END IF;

      -- Активнi залишки - капитал банку
      IF     (t020_ = '1')
         AND (   nbs_ BETWEEN '5000' AND '5109'
              OR nbs_ BETWEEN '6000' AND '6079'
              OR nbs_ BETWEEN '6090' AND '6179'
              OR nbs_ BETWEEN '6190' AND '6379'
              OR nbs_ BETWEEN '6390' AND '6999'
              OR nbs_ BETWEEN '7000' AND '7079'
              OR nbs_ BETWEEN '7090' AND '7179'
              OR nbs_ BETWEEN '7190' AND '7379'
              OR nbs_ BETWEEN '7390' AND '7999'
             )
      THEN
         kod_ := 'H';
      END IF;

      -- Активнi залишки - банкноти та монети
      IF     (t020_ = '1')
         AND (nbs_ IN ('1007') OR nbs_ BETWEEN '1001' AND '1005')
      THEN
         kod_ := '1';
      END IF;

      -- Активнi залишки - кошти на вимогу
      IF (t020_ = '1') AND (nbs_ IN ('1200', '1203'))
      THEN
         kod_ := '1';
      END IF;

      -- Активнi залишки - казначейські та інші ЦП, що рефiнансуються НБУ, у торговому портфелi банку
      IF     (t020_ = '1')
         AND (   nbs_ IN ('1400', '1401', '1407')
              OR nbs_ BETWEEN '1403' AND '1405'
             )
      THEN
         kod_ := '1';
      END IF;

      -- Пасивнi залишки - казначейські та інші ЦП, що рефiнансуються НБУ, у торговому портфелi банку
      IF (t020_ = '2') AND (nbs_ IN ('1405', '1406'))
      THEN
         kod_ := '1';
      END IF;

      -- Активнi залишки - кредити овердрафт
      IF (t020_ = '1') AND (nbs_ IN ('1600'))
      THEN
         kod_ := '1';
      END IF;

      -- Активнi залишки - депозити овернайт
      IF (t020_ = '1') AND (nbs_ IN ('1510'))
      THEN
         kod_ := '2';
      END IF;

      -- Активнi залишки - кошти на вимогу
      IF (t020_ = '1') AND (nbs_ IN ('1500'))
      THEN
         kod_ := '1';
      END IF;

      -- Активнi залишки - кредити овернайт
      IF (t020_ = '1') AND (nbs_ IN ('1521'))
      THEN
         kod_ := '2';
      END IF;

      -- Активнi залишки - борговi цiннi папери в торговому порфелi банку
      IF     (t020_ = '1')
         AND (nbs_ IN ('3017') OR nbs_ BETWEEN '3010' AND '3015')
      THEN
         kod_ := '1';
      END IF;

      -- Пасивнi залишки - борговi цiннi папери в торговому порфелi банку
      IF (t020_ = '2') AND (nbs_ IN ('3015', '3016'))
      THEN
         kod_ := '1';
      END IF;

      -- Активнi залишки - акції та інші цiннi папери з нефіксованим прибутком в торговому порфелi банку
      IF (t020_ = '1') AND (nbs_ IN ('3002', '3003', '3005', '3007'))
      THEN
         kod_ := '1';
      END IF;

      -- Пасивнi залишки - акції та інші цiннi папери з нефіксованим прибутком в торговому порфелi банку
      IF (t020_ = '2') AND (nbs_ IN ('3007'))
      THEN
         kod_ := '1';
      END IF;

      -- Активнi залишки - інвестиції в асоційовані та дочірні компанії (більше 10 років)
      IF     (t020_ = '1')
         AND (nbs_ IN ('4102', '4103', '4105', '4202', '4203', '4205'))
      THEN
         kod_ := 'H';
      END IF;

      -- Активнi залишки - дебетові суми до з'ясування (від 2 до 7 днів)
      IF (t020_ = '1') AND (nbs_ IN ('3710'))
      THEN
         kod_ := '3';
      END IF;

      -- для счетов резервов по просьбе Сухово1 Т.А. внесла 28.11.2008
      IF nbs_ IN ('1317', '1327', '1517', '1527', '1580', '1581', '1582', '1589', '1590', '1591', '1592', '1593',
        '1617', '1627', '1780', '1880', '2027', '2037', '2047', '2057', '2067', '2077', '2087', '2090', '2091', '2092',
        '2093', '2094', '2095', '2096', '2097', '2099', '2107', '2117', '2127', '2137', '2190', '2191', '2198',
        '2199', '2207', '2217', '2227', '2237', '2290', '2291', '2292', '2295', '2299', '2888', '2889', '3580',
        '3589', '1419', '1429', '1509', '1519', '1529', '1780', '2029', '2039', '2049', '2059', '2069', '2079',
        '2089', '2109', '2119', '2129', '2139', '2209', '2219', '2229', '2239', '2480', '3119', '3219', '3579',
        '1490', '1491', '1492', '1493', '1590', '1591', '1592', '1593', '1790', '1890', '2400', '2401', '2490',
        '2890', '3190', '3191', '3290', '3291', '3590', '3599', '3690', '3699')
      THEN
         kod_ := 'X';
      END IF;
   END IF;

   RETURN kod_;
END;
/
 show err;
 
PROMPT *** Create  grants  FS240_DEF ***
grant EXECUTE                                                                on FS240_DEF       to WR_ALL_RIGHTS;

 
 
 PROMPT ===================================================================================== 
 PROMPT *** End *** ========== Scripts /Sql/BARS/function/fs240_def.sql =========*** End *** 
 PROMPT ===================================================================================== 
 