
 
 PROMPT ===================================================================================== 
 PROMPT *** Run *** ========== Scripts /Sql/BARS/function/ot_period_cnt.sql =========*** Run 
 PROMPT ===================================================================================== 
 
  CREATE OR REPLACE FUNCTION BARS.OT_PERIOD_CNT (dat1_ DATE, dat2_ DATE)
  RETURN NUMBER DETERMINISTIC
IS
/******************************************************************************
 Название  : ot_period_cnt
 Назначение: Функция дял подсчета кол-ва рабочих дней в периоде
 Версия    : 1 от 03.10.2006

 Параметры :
   dat1_ - начало периода
   dat2_ - конец периода

 Изменения и дополнения:
 Дата      Автор  Описание
 --------  ------ -------------------------------------------------------------
 03.10.06  VIRKO  1. Создание функции
******************************************************************************/
  cnt_ number := 0;
BEGIN
  SELECT count(*) INTO cnt_ FROM fdat WHERE fdat BETWEEN dat1_ AND dat2_;
  RETURN cnt_;
END;
 
/
 show err;
 
PROMPT *** Create  grants  OT_PERIOD_CNT ***
grant EXECUTE                                                                on OT_PERIOD_CNT   to WR_ALL_RIGHTS;

 
 
 PROMPT ===================================================================================== 
 PROMPT *** End *** ========== Scripts /Sql/BARS/function/ot_period_cnt.sql =========*** End 
 PROMPT ===================================================================================== 
 